{"status": "ok", "totalResults": 3707901, "articles": [{"source": {"id": null, "name": "Kinja.com"}, "author": "Aimée Lutkin", "title": "How to Feel Less Alone, According to Reddit", "description": "Loneliness is a natural warning that occurs in human brains, much like hunger or thirst, except it’s telling you that you need company. It’s much easier to buy a burrito than make a friend however, so here’s how to beat back loneliness when you’re lacking hum…", "url": "http://feeds.kinja.com/~r/lifehacker/vip/~3/B2-8VW36pGg/how-to-feel-less-alone-according-to-reddit-1832845799", "urlToImage": null, "publishedAt": "2019-02-25T15:30:00Z", "content": null}, {"source": {"id": null, "name": "Kinja.com"}, "author": "Abu Zafar", "title": "What the Hajj Pilgrimage Is Like, According to a Muslim American", "description": "Gizmodo Media Group is teaming up with Smartypants Pictures to premiere the second season of The Secret Life of Muslims —a video series with a view on modern Islam you’re not getting on cable news. Read more...", "url": "http://feeds.kinja.com/~r/lifehacker/vip/~3/3IDAPW2CZ2s/what-the-hajj-pilgrimage-is-like-according-to-a-muslim-1832943225", "urlToImage": null, "publishedAt": "2019-02-28T15:00:00Z", "content": null}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "What's the Best Purchase You've Ever Made?", "description": "Who can we really trust among Amazon, Yelp, and the countless other review site that depend on customer intel to inform buying decisions? Read more...", "url": "https://lifehacker.com/whats-the-best-purchase-youve-ever-made-1833096691", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--qj_tvfwH--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/u3mynvsjor3j30eyqoiy.jpg", "publishedAt": "2019-03-06T20:30:00Z", "content": "Who can we really trust among Amazon, Yelp, and the countless other review site that depend on customer intel to inform buying decisions?\r\nLets face it: even if a product has four and a half stars, we cant help but be swayed by the one- and two-star reviews. … [+1949 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "Quickly Determine What Country and Time Zone Your Coworkers Are in This Week Using This Tool", "description": "Over the past few years, it’s started to become more and more common for not everyone that works on a team to actually work in the same office. In some cases, a work “team” can also include people that not only don’t live in the same city that you do, but the…", "url": "https://lifehacker.com/quickly-determine-what-country-and-time-zone-your-cowor-1833011887", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--fZe27AEn--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/nzaodrn1k9akcmanapbm.jpg", "publishedAt": "2019-03-02T20:15:00Z", "content": "Over the past few years, its started to become more and more common for not everyone that works on a team to actually work in the same office. In some cases, a work team can also include people that not only dont live in the same city that you do, but they al… [+1350 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Rob Walker", "title": "What to Do When a Colleague Overshares", "description": "This week, Human Resource answers the question: How do you deal with a work “friend” who treats you like his personal therapist? Read more...", "url": "https://lifehacker.com/what-to-do-when-a-colleague-overshares-1833105678", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--XzAmspmm--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/wq7maqs8dctgr7ggu7hx.png", "publishedAt": "2019-03-11T16:30:00Z", "content": "This week, Human Resource answers the question: How do you deal with a work friend who treats you like his personal therapist? \r\nSend questions about your work dilemmas, large or small, to humanresource@lifehacker.com. \r\nDear Human Resource, \r\nI work as a hos… [+5712 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Get Ahead of Twitter Harassment by Checking Your Lists", "description": "Being harassed on Twitter is never fun. And it can happen to you whether you’re already a decently well-known figure with that blue check mark of authenticity, an up-and-comer in the world of online witticisms, or if you came up with a single tweet that blew …", "url": "https://lifehacker.com/get-ahead-of-twitter-harassment-by-checking-your-lists-1833373649", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--85J0pqmo--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/fgqwisx2pudkcz6kyq8z.png", "publishedAt": "2019-03-18T20:30:00Z", "content": "Being harassed on Twitter is never fun. And it can happen to you whether youre already a decently well-known figure with that blue check mark of authenticity, an up-and-comer in the world of online witticisms, or if you came up with a single tweet that blew u… [+2683 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Alicia Adamczyk", "title": "Give Yourself the Gift of Time This Week", "description": "One of the greatest pleasures of my new-ish morning routine is that I start many of my days by doing nothing. I lay around for a bit, before getting ready and then sitting with a cup of coffee for a few minutes. Read more...", "url": "https://lifehacker.com/give-yourself-the-gift-of-time-this-week-1833372698", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--PEDH3H5B--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/mqqwtrjztu4cp9thsu2a.jpg", "publishedAt": "2019-03-18T15:00:00Z", "content": "One of the greatest pleasures of my new-ish morning routine is that I start many of my days by doing nothing. I lay around for a bit, before getting ready and then sitting with a cup of coffee for a few minutes. \r\nMy resting cup of coffee never takes me more … [+1845 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Joel Kahn", "title": "Vanna White's Evening Gown Routine Involves 10-Pound Dumbbells", "description": "Vanna White has been turning letters on Wheel of Fortune for 36 years, and has worn nearly 7,000 evening gowns in the process. Read more...", "url": "https://lifehacker.com/vanna-whites-evening-gown-routine-involves-10-pound-dum-1833320439", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--ZRZQdb6O--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ta2ebtismx1cb5yvacis.jpg", "publishedAt": "2019-03-15T19:30:00Z", "content": "Vanna White has been turning letters on Wheel of Fortune for 36 years, and has worn nearly 7,000 evening gowns in the process.\r\nWhile most of us get gussied up only for special occasions, Vanna has to start at 8am every workday. She sat down with us (in her t… [+257 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert", "title": "You Can Start a Sentence With 'And' 'But' or 'Or'", "description": "When I was growing up, English teachers drove a specific rule into our developing writer brains: Do not start a sentence with a conjunction. Read more...", "url": "https://lifehacker.com/you-can-start-a-sentence-with-and-but-or-or-1832984839", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--OQykZY6i--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/acpdppsusn0l2zwsmpxs.jpg", "publishedAt": "2019-03-01T16:30:00Z", "content": "When I was growing up, English teachers drove a specific rule into our developing writer brains: Do not start a sentence with a conjunction. \r\nThis, my friends, is incorrect.\r\nIn case you need a little grammar brush-up sesh, a conjunction is a word that conne… [+2388 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert on Offspring, shared by Meghan Moravcik Walbert to Lifehacker", "title": "Introduce Your Kid to the Baby-Sitters Club", "description": "If you’ve been waiting for a sign that it’s time to introduce your kids to The Baby-Sitters Club, Netflix has generously decided to oblige. Read more...", "url": "https://offspring.lifehacker.com/introduce-your-kid-to-the-baby-sitters-club-1832995807", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--SSm46cCj--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/inmod8b6sntkurq6bgo2.jpg", "publishedAt": "2019-03-01T22:00:00Z", "content": "If youve been waiting for a sign that its time to introduce your kids to The Baby-Sitters Club, Netflix has generously decided to oblige. \r\nThe streaming service announced that it has ordered 10 episodes of the classic 1980s and 90s book series-turned-TV show… [+1152 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Michelle Woo", "title": "Put Yourself on 'Low Power Mode' When You're Feeling Depleted", "description": "If you’re going through a big transition or simply feeling drained, it can help to go into “low power mode.” I heard this tip on the podcast “Happier With Gretchen Rubin” while I was on maternity leave, and immediately felt comforted. Low power mode—yes. Duri…", "url": "https://lifehacker.com/put-yourself-on-low-power-mode-when-youre-feeling-deple-1832935868", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--DCRxF1dR--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/siwjahfw7c00hukperco.jpg", "publishedAt": "2019-02-27T20:00:00Z", "content": "If youre going through a big transition or simply feeling drained, it can help to go into low power mode. I heard this tip on the podcast Happier With Gretchen Rubin while I was on maternity leave, and immediately felt comforted. Low power modeyes. During thi… [+1497 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki on Vitals, shared by Beth Skwarecki to Lifehacker", "title": "Follow These Health Professionals' Tips to Avoid Terrible Fates", "description": "The day-to-day decisions that most impact your health aren’t the ones you make in the grocery store, say, deciding between the organic and the regular apples. They’re high impact things like getting vaccines and wearing your seatbelt. Read more...", "url": "https://vitals.lifehacker.com/follow-these-health-professionals-tips-to-avoid-terribl-1832903041", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--RIXCxyjz--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/d6lsyrds8lkcgj5ozlry.jpg", "publishedAt": "2019-02-26T20:00:00Z", "content": "The day-to-day decisions that most impact your health arent the ones you make in the grocery store, say, deciding between the organic and the regular apples. Theyre high impact things like getting vaccines and wearing your seatbelt. \r\nOn Twitter, registered n… [+2857 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert", "title": "Stop Using the Words 'At Least' to Comfort", "description": "When someone confides in you—about anything from truly awful to just an average shitty day—the next words out of your mouth should never, ever be: “At least...” Read more...", "url": "https://lifehacker.com/stop-using-the-words-at-least-to-comfort-1833158663", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--PAMa_YqT--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/metmsjghd1fem0mzyvzv.jpg", "publishedAt": "2019-03-11T17:30:00Z", "content": "When someone confides in youabout anything from truly awful to just an average shitty daythe next words out of your mouth should never, ever be: At least...\r\nWhatever comes after At least... is minimizing at best and offensive at worst.\r\nIve got such a bad co… [+974 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Mike Epstein", "title": "Share up to 2.5GB of Files at Once (for Free) with Firefox Send", "description": "Sometimes, it’s a lot easier to dump a file (or a ton of files) into a cloud storage service like Box or Dropbox instead of trying to attach them all in an email. That, or you hunt around the web for any number of “free file upload” services that promise to t…", "url": "https://lifehacker.com/share-up-to-2-5gb-of-files-at-once-for-free-with-fire-1833232502", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--hfbxd-l---/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/kq65a9pvbmpgu7pqtsxt.png", "publishedAt": "2019-03-12T19:00:00Z", "content": "Sometimes, its a lot easier to dump a file (or a ton of files) into a cloud storage service like Box or Dropbox instead of trying to attach them all in an email. That, or you hunt around the web for any number of free file upload services that promise to temp… [+1090 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "How to Find Out If You're Booked on a 737 Max and What to Do if You Are", "description": "After two deadly plane crashes involving Boeing’s 737 Max 8 jet over the past six months, many airline passengers and airlines have starting to consider whether or not the planes are safe to fly. Read more...", "url": "https://lifehacker.com/how-to-find-out-if-youre-booked-on-a-737-max-and-what-t-1833243838", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--mh2GWmiI--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xzd4mkbvt33jt55mr4ad.jpg", "publishedAt": "2019-03-12T21:13:00Z", "content": "After two deadly plane crashes involving Boeings 737 Max 8 jet over the past six months, many airline passengers and airlines have starting to consider whether or not the planes are safe to fly.\r\nWhile a number of airlines have opted to ground the planes, sev… [+3282 chars]"}, {"source": {"id": null, "name": "Thetakeout.com"}, "author": "Danny Palumbo on The Takeout, shared by Virginia K. Smith to Lifehacker", "title": "Proper Italian wedding soup is penance for all my culinary wrongs", "description": "Let’s talk about Ed Alfredo. I know Ed Alfredo sounds like an alias, or what you’d make up if somebody held a gun to your head and asked you to quickly name a mob boss, but I swear he’s real. Ed and I worked together at a country club in western Pennsylvania,…", "url": "https://thetakeout.com/recipe-proper-italian-wedding-soup-1833035950", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--tzHqwRKK--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/kazgczcwcxywsj7dbwm7.jpg", "publishedAt": "2019-03-12T01:03:00Z", "content": "Lets talk about Ed Alfredo. I know Ed Alfredo sounds like an alias, or what youd make up if somebody held a gun to your head and asked you to quickly name a mob boss, but I swear hes real. Ed and I worked together at a country club in western Pennsylvania, an… [+6049 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "How to Stop Your Roommates From Messing with Your Amazon Echo", "description": "I first realized something was wrong when I started getting reminders on my iPhone about upcoming appointments at 9 p.m.—not a time I’m typically booked with something to do. And then there were the subjects of the appointments themselves: “Check for herpes,”…", "url": "https://lifehacker.com/how-to-stop-your-roommates-from-messing-with-your-amazo-1833229706", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--Dgju7nVF--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/daz2dnbf3ncqcvvw9u4n.jpg", "publishedAt": "2019-03-14T14:00:00Z", "content": "I first realized something was wrong when I started getting reminders on my iPhone about upcoming appointments at 9 p.m.not a time Im typically booked with something to do. And then there were the subjects of the appointments themselves: Check for herpes, sai… [+8795 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "How to Block Violent Videos on Facebook, Twitter, and YouTube", "description": "Because it’s 2019, and livestreaming has had five years or so to really build up into a mainstream activity that people actually do, this means that horrific acts of violence and terror around the world have a greater-than-zero chance of having some video com…", "url": "https://lifehacker.com/how-to-block-violent-videos-on-facebook-twitter-and-y-1833320168", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--UanDTOfb--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/mcgrpp3iwrrwaipnyy1y.png", "publishedAt": "2019-03-15T16:10:00Z", "content": "Because its 2019, and livestreaming has had five years or so to really build up into a mainstream activity that people actually do, this means that horrific acts of violence and terror around the world have a greater-than-zero chance of having some video comp… [+3345 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Claire Lower on Skillet, shared by Claire Lower to Lifehacker", "title": "Squirt Your Thirst With This Rum Cocktail", "description": "Last weekend, Sunday lived up to its name, and I was able to enjoy a few cocktails in a sunny cocktail bar in southeast Portland. I started with a coconut gin negroni and, while sipping on that, a sassy little number with Squirt (one of my favorite sodas as a…", "url": "https://skillet.lifehacker.com/squirt-your-thirst-with-this-rum-cocktail-1833329568", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--veNbO3wc--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/lbgxsqxqt8hirrb16t0y.jpg", "publishedAt": "2019-03-15T19:00:00Z", "content": "Last weekend, Sunday lived up to its name, and I was able to enjoy a few cocktails in a sunny cocktail bar in southeast Portland. I started with a coconut gin negroni and, while sipping on that, a sassy little number with Squirt (one of my favorite sodas as a… [+1160 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "Add a Pomodoro Timer to Your Mac's Taskbar With this App", "description": "If you’re looking for ways to be a bit more productive, the Pomodoro technique can be a good place to start. The technique, which was developed in the early 90s by developer Francesco Cirillo, involves breaking down large tasks into short, timed intervals. Ci…", "url": "https://lifehacker.com/add-a-pomodoro-timer-to-your-macs-taskbar-with-this-app-1833337558", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--ACNNYU30--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/mxiao4pniuadylsc9y7r.jpg", "publishedAt": "2019-03-16T13:00:00Z", "content": "If youre looking for ways to be a bit more productive, the Pomodoro technique can be a good place to start. The technique, which was developed in the early 90s by developer Francesco Cirillo, involves breaking down large tasks into short, timed intervals. Cir… [+1620 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Melissa Kirsch", "title": "What's Coming and Going From Netflix the Week of March 18, 2019", "description": "I hate biopics! I’d so much rather watch a biographical documentary than watch actors pretend to be real live people. Sure, you’ll probably get an Oscar for your portrayal (cf. Rami Malek), but I’m not entirely sure why, because acting in a biopic involves so…", "url": "https://lifehacker.com/whats-coming-and-going-from-netflix-the-week-of-march-1-1833208521", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--sF0Fo9tY--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/kyfnqxhg3fwsvwa4daex.jpg", "publishedAt": "2019-03-18T12:35:00Z", "content": "I hate biopics! Id so much rather watch a biographical documentary than watch actors pretend to be real live people. Sure, youll probably get an Oscar for your portrayal (cf. Rami Malek), but Im not entirely sure why, because acting in a biopic involves so mu… [+1456 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Lauren Evans", "title": "What Exactly Is the Green New Deal?", "description": "In the months since the Green New Deal entered the public consciousness, it has been called many things: Zany. Unrealistic. Wildly popular.  A socialist Christmas list. It has provoked strong reactions from both the right and ostensible left, and is already b…", "url": "https://lifehacker.com/what-exactly-is-the-green-new-deal-1833410236", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s---9dGbbtd--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/nvh9go9v2tplhuhzkibr.jpg", "publishedAt": "2019-03-21T13:30:00Z", "content": "In the months since the Green New Deal entered the public consciousness, it has been called many things: Zany. Unrealistic. Wildly popular. A socialist Christmas list. It has provoked strong reactions from both the right and ostensible left, and is already be… [+8865 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Aimée Lutkin", "title": "When You Have a Negative Thought About Yourself, Cancel It", "description": "There are certain negative thoughts we have about ourselves that we replay over and over. If you’re trying to break the habit of thinking terrible stuff about yourself, here’s a helpful hint: cancel that thought. Read more...", "url": "https://lifehacker.com/when-you-have-a-negative-thought-about-yourself-cancel-1832873530", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--1U_JlDcX--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/cr289a0ksazpwescx9ty.jpg", "publishedAt": "2019-02-26T16:30:00Z", "content": "There are certain negative thoughts we have about ourselves that we replay over and over. If youre trying to break the habit of thinking terrible stuff about yourself, heres a helpful hint: cancel that thought.\r\nThis relates to a recent post on /r/LifeProTips… [+2518 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "Turn Your Tweets into Messages to Politicians With This Chrome Extension", "description": "Now more than ever, we all have the habit of venting about politics on Twitter and Facebook. Read more...", "url": "https://lifehacker.com/turn-your-tweets-into-messages-to-politicians-with-this-1832897027", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--6psV7maa--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/fed6cwfq06xec3atpiui.jpg", "publishedAt": "2019-02-26T18:30:00Z", "content": "Now more than ever, we all have the habit of venting about politics on Twitter and Facebook. \r\nWant to turn all that resentment into something a little more useful? Heres your chance to make your anger heard (if you use it sparingly, that is).\r\nIf youre looki… [+3070 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Aimée Lutkin", "title": "How to Properly Wash Your Comforter", "description": "Some of us are huddled under our comforters cursing the cold right now, so the idea of washing that life-sustaining layer may seem outrageous. But you gotta—it’s dirty. Read more...", "url": "https://lifehacker.com/how-to-properly-wash-your-comforter-1833064250", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--gKUOZHFT--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/mu8ys8crhhscgx1huvqi.jpg", "publishedAt": "2019-03-05T19:30:00Z", "content": "Some of us are huddled under our comforters cursing the cold right now, so the idea of washing that life-sustaining layer may seem outrageous. But you gottaits dirty.\r\nThough sheets offer some protection from your body, your comforter is still picking up all … [+2716 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Aimée Lutkin", "title": "How to Binge-Stream Every Marvel Movie Before Avengers: Endgame Is Released", "description": "If you’ve managed to never get sucked into the Marvel cinematic universe, you’re almost in the clear: the final film in this series, Avengers: Endgame, is being released April 26. Then it’s all over! But why deny yourself? Here’s where you can stream all the …", "url": "https://lifehacker.com/how-to-binge-stream-every-marvel-movie-before-avengers-1832987863", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--JoqLKr0y--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/iicym7dvrtwyakwrqqdl.jpg", "publishedAt": "2019-03-01T17:30:00Z", "content": "If youve managed to never get sucked into the Marvel cinematic universe, youre almost in the clear: the final film in this series, Avengers: Endgame, is being released April 26. Then its all over! But why deny yourself? Heres where you can stream all the prev… [+3108 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Long", "title": "How to Get on ‘Jeopardy!’", "description": "Are you a trivia master? Or an Alex Trebek superfan? You could be on Jeopardy! The show’s application and testing process are open to anyone willing to put their knowledge to the test. Read more...", "url": "https://lifehacker.com/how-to-get-on-jeopardy-1832949569", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--vNGVCzI3--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/b9bvd1clzbdkzs3tjjxg.png", "publishedAt": "2019-02-28T19:30:00Z", "content": "Are you a trivia master? Or an Alex Trebek superfan? You could be on Jeopardy! The shows application and testing process are open to anyone willing to put their knowledge to the test.\r\nThat said, getting selected to appear on a Jeopardy! episode is part skill… [+3749 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nick Douglas", "title": "These Video Games Let You Pet the Dogs", "description": "As our sister site Kotaku has explained, all video games should let you pet the animals. Sadly, many games include dogs, but no way to pet them. Until Congress gets its act together and outlaws this oversight, a new Twitter account, Can You Pet the Dog?, tell…", "url": "https://lifehacker.com/these-video-games-let-you-pet-the-dogs-1833127272", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--niQ1gZcr--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/cjhyowqmwl3kkwycssvx.png", "publishedAt": "2019-03-07T21:30:00Z", "content": "As our sister site Kotaku has explained, all video games should let you pet the animals. Sadly, many games include dogs, but no way to pet them. Until Congress gets its act together and outlaws this oversight, a new Twitter account, Can You Pet the Dog?, tell… [+930 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Alicia Adamczyk on Two Cents, shared by Alicia Adamczyk to Lifehacker", "title": "Can You 'Over-Diversify' Your Assets?", "description": "A diversified portfolio is one of the keys to a successful long-term investment strategy. But can your assets ever be too diversified? Read more...", "url": "https://twocents.lifehacker.com/can-you-over-diversify-your-assets-1833132385", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--YZdUFfjz--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/z323be9ozd1ux2vh0crs.jpg", "publishedAt": "2019-03-08T15:30:00Z", "content": "A diversified portfolio is one of the keys to a successful long-term investment strategy. But can your assets ever be too diversified?\r\nTechnically, nothere are always new avenues for investors to explore to spread out risk. That said, because you likely dont… [+2622 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Abu Zafar", "title": "Use Your Freezer for More Than Just Ice Cream and Frozen Pizza", "description": "Do more with your freezer. Read more...", "url": "https://lifehacker.com/use-your-freezer-for-more-than-just-ice-cream-and-froze-1833133606", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--fir6nRBA--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/v1/qa/3648348.jpg", "publishedAt": "2019-03-08T15:00:00Z", "content": "Do more with your freezer.\r\nIn the video above, we share some creative ways to use a freezer. Like storing your plastic wrap in the freezer to stop it from clinging, saving all your vegetable scraps for an eventual stock, or creating pesto cubes in an ice tra… [+194 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "How to Quickly Stop Bleeding From a Shaving Cut", "description": "You’re in a rush to get to work when suddenly all hell breaks loose—on your face, that is. Read more...", "url": "https://lifehacker.com/how-to-quickly-stop-bleeding-from-a-shaving-cut-1833091194", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--I4eI3l5o--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ltht3diaghxhgpzyknfq.jpg", "publishedAt": "2019-03-06T18:30:00Z", "content": "Youre in a rush to get to work when suddenly all hell breaks looseon your face, that is.\r\nWhile shaving, you manage to cut yourself ever so slightly, only for it to gush blood like an unfixable faucet leak. Youre left with the decision: continue to dab it wit… [+3214 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nick Douglas", "title": "Scrub Up With the Lifehacker Bathtime Playlist for Adults", "description": "When my baby daughter was getting grumpy in the bathtub, and I put TLC’s “No Scrubs” on Spotify, I knew I had something special to share with the world. There are tons of bathtime songs for children, but most of them are tedious. So I made a bathtime playlist…", "url": "https://lifehacker.com/scrub-up-with-the-lifehacker-bathtime-playlist-for-adul-1833034580", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--XE-1MEXr--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/yn1ehlkzsixjoymz81fv.png", "publishedAt": "2019-03-04T17:00:00Z", "content": "When my baby daughter was getting grumpy in the bathtub, and I put TLCs No Scrubs on Spotify, I knew I had something special to share with the world. There are tons of bathtime songs for children, but most of them are tedious. So I made a bathtime playlist fo… [+589 chars]"}, {"source": {"id": null, "name": "Kinja.com"}, "author": "Michelle Woo on Offspring, shared by Michelle Woo to Lifehacker", "title": "Cut the Straps of Your Expired Car Seat", "description": "I’ve traded old, expired car seats for sweet coupons at Target in the past, but if these types of promos didn’t exist, I wouldn’t know what to do with these clunky things. In researching how to recycle a car seat, I’ve learned that it is quite the process. Yo…", "url": "http://feeds.kinja.com/~r/lifehacker/vip/~3/Oa1N5LUpBBY/cut-the-straps-of-your-expired-car-seat-1833096528", "urlToImage": null, "publishedAt": "2019-03-06T19:00:00Z", "content": null}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "See What the World Looked Like When the World Wide Web Was Born", "description": "The World Wide Web turned 30 this week, and everyone celebrated the best way they know how—by coming up with big lists of all the internet-related topics we’ve dealt with (or obsessed over) the past few decades. That includes dial-up modems, AOL, avatar- and …", "url": "https://lifehacker.com/see-what-the-world-looked-like-when-the-world-wide-web-1833324960", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--qxe8o1l9--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/mtdmwkvmkpjhh4w95htv.png", "publishedAt": "2019-03-15T21:00:00Z", "content": "The World Wide Web turned 30 this week, and everyone celebrated the best way they know howby coming up with big lists of all the internet-related topics weve dealt with (or obsessed over) the past few decades. That includes dial-up modems, AOL, avatar- and co… [+2142 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Brendan Hesse", "title": "Here's Your Cheat Sheet for Verizon's New 5G Data Plans", "description": "5G continues its slow rollout around the world as more companies announce plans to launch 5G networks in 2019. The most recent is Verizon, who has detailed its upcoming 5G services launching April 11. Read more...", "url": "https://lifehacker.com/heres-your-cheat-sheet-for-verizons-new-5g-data-plans-1833278817", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--_9taDmGJ--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/q5m47fz1qibj5u5pbqon.png", "publishedAt": "2019-03-14T17:00:00Z", "content": "5G continues its slow rollout around the world as more companies announce plans to launch 5G networks in 2019. The most recent is Verizon, who has detailed its upcoming 5G services launching April 11.\r\nSince 5G is a tricky technology and companies like to ove… [+3049 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "Visualize Your Wall Painted a Different Color With These Apps", "description": "Painting your walls is definitely an undertaking, but not quite as much of an undertaking as figuring out what paint color you want to use. Read more...", "url": "https://lifehacker.com/visualize-your-wall-painted-a-different-color-with-thes-1833360173", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--qexkAPUn--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/bu6czajenwbvnzqmay32.jpg", "publishedAt": "2019-03-17T19:37:00Z", "content": "Painting your walls is definitely an undertaking, but not quite as much of an undertaking as figuring out what paint color you want to use.\r\nSelecting a paint color has traditionally entailed heading down to your local paint shop to color swatches or samples … [+1537 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Claire Lower on Skillet, shared by Claire Lower to Lifehacker", "title": "What Does It Mean to 'Stir Frequently'?", "description": "If you are one to get caught up in details and definitions, cooking from recipes can kick the pedantic portion of your brain into overdrive. Words and phrases that are intuitive to more seasoned home cooks can prove utterly mystifying to newbies, particularly…", "url": "https://skillet.lifehacker.com/what-does-it-mean-to-stir-frequently-1833386414", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--yrGv_c1Y--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/eusl79v9pvhxzzmndvmn.jpg", "publishedAt": "2019-03-19T16:00:00Z", "content": "If you are one to get caught up in details and definitions, cooking from recipes can kick the pedantic portion of your brain into overdrive. Words and phrases that are intuitive to more seasoned home cooks can prove utterly mystifying to newbies, particularly… [+3883 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "How to Watch the NCAA March Madness Bracket Reveal From the Bar", "description": "As a girl from North Carolina, March Madness is one of the most important times of the year for me. As it turns out, living a few miles away from the college campuses of three teams that often make it into the tournament will push you to get really into colle…", "url": "https://lifehacker.com/how-to-watch-the-ncaa-march-madness-bracket-reveal-from-1833358941", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--lLIalOUX--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/pn6ue2zh7r9owgxnzxrs.jpg", "publishedAt": "2019-03-17T17:59:00Z", "content": "As a girl from North Carolina, March Madness is one of the most important times of the year for me. As it turns out, living a few miles away from the college campuses of three teams that often make it into the tournament will push you to get really into colle… [+1779 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Aimée Lutkin", "title": "See the First Spring Equinox Supermoon in 19 Years Tonight", "description": "Today, March 20, is the spring equinox. In the northern hemisphere, days will start getting longer, nights shorter, and warmth will flood the land. To celebrate this shift, go outside tonight and check out the supermoon, which will coincidentally be lighting …", "url": "https://lifehacker.com/see-the-first-spring-equinox-supermoon-in-19-years-toni-1833438550", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--tp1PGcBz--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/tmapz6smfedv8lhrp8xl.jpg", "publishedAt": "2019-03-20T16:51:00Z", "content": "Today, March 20, is the spring equinox. In the northern hemisphere, days will start getting longer, nights shorter, and warmth will flood the land. To celebrate this shift, go outside tonight and check out the supermoon, which will coincidentally be lighting … [+1323 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Brendan Hesse", "title": "How to Send Quoted Replies in Facebook Messenger", "description": "It’s about to get a lot easier to manage conversations on Facebook. The social giant—when it’s not busy ruining your account security—is adding a new sort-of threaded reply feature for all users’ Messenger conversations. When you use one of these replies, you…", "url": "https://lifehacker.com/how-to-send-quoted-replies-in-facebook-messenger-1833472989", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--dZ_F1s6R--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/uzypq7htqzeo2tid6i61.jpg", "publishedAt": "2019-03-22T13:30:00Z", "content": "Its about to get a lot easier to manage conversations on Facebook. The social giantwhen its not busy ruining your account securityis adding a new sort-of threaded reply feature for all users Messenger conversations. When you use one of these replies, youll be… [+1517 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "Buy Your Flight Two and a Half Months Early", "description": "You’ve heard it all. Buy on Tuesday! Wake up at 5 AM! Buy a separate returning flight! But travel advice is rarely one-size-fits-all. Read more...", "url": "https://lifehacker.com/buy-your-flight-two-and-a-half-months-early-1833470494", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--WztFQgoc--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/va1oogb7slfonqjchp7h.jpg", "publishedAt": "2019-03-22T15:30:00Z", "content": "Youve heard it all. Buy on Tuesday! Wake up at 5 AM! Buy a separate returning flight! But travel advice is rarely one-size-fits-all.\r\nThanks to a recent report by CheapAir.com, who analyzed some 917 million separate airfares in 2018, however, we do have some … [+3194 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Mike Epstein", "title": "How to Block Auto-Play Videos Using Firefox", "description": "No one likes auto-play videos. A random assault of sound that you may or may not have come to see is rarely a pleasant surprise. This week, Firefox received an update that adds a new, robust tool for blocking the audio from auto-play videos from any site, whi…", "url": "https://lifehacker.com/how-to-block-auto-play-videos-using-firefox-1833493848", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--JKEOtCTL--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/o6iu7zfbsbgr3kdxyesf.png", "publishedAt": "2019-03-22T20:15:00Z", "content": "No one likes autoplay videos. A random assault of sound that you may or may not have come to see is rarely a pleasant surprise. This week, Firefox received an update that adds a new, robust tool for blocking the audio from autoplay videos from any site, which… [+1500 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "Eject Water From Your Phone's Speakers After an Unexpected Dunk Using This Web Tool", "description": "At some point or another, even the most careful of us ends up having a smartphone mishap, specifically one that results in our $1,000+ piece of equipment taking a dunk in a puddle, pool, or more likely, a toilet. Read more...", "url": "https://lifehacker.com/eject-water-from-your-phones-speakers-after-an-unexpect-1832854171", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--dc0odjE7--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/gkibfhgf843vghonhjnc.png", "publishedAt": "2019-02-24T18:11:00Z", "content": "At some point or another, even the most careful of us ends up having a smartphone mishap, specifically one that results in our $1,000+ piece of equipment taking a dunk in a puddle, pool, or more likely, a toilet.\r\nIn general, the best move in such a situation… [+1210 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "Keep a 'Mobile Medicine Cabinet' Packed in Your Suitcase For Travel Mishaps", "description": "I do a good bit of travel writing, which means I spend a lot of time on the road. After a few “emergency” trips to the local drug store, which can often be difficult to find, I took a small cosmetic bag and created a bag of medication for my suitcase that I a…", "url": "https://lifehacker.com/keep-a-mobile-medicine-cabinet-packed-in-your-suitcase-1832848084", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--enGUdxnm--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/nlawkqvd5u3qtri9fhvt.jpg", "publishedAt": "2019-02-24T00:45:00Z", "content": "I do a good bit of travel writing, which means I spend a lot of time on the road. After a few emergency trips to the local drug store, which can often be difficult to find, I took a small cosmetic bag and created a bag of medication for my suitcase that I alw… [+2402 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Rob Walker", "title": "How to Deal With Jerks at Work", "description": "This week we’re got two semi-related questions about obnoxious coworkers—a common workplace theme! Thank you for all the questions, please keep them coming: humanresource@lifehacker.com. Read more...", "url": "https://lifehacker.com/how-to-deal-with-jerks-at-work-1832819304", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--4CQtgBBK--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/u8wsx5zvafinvujybpa8.jpg", "publishedAt": "2019-02-25T16:30:00Z", "content": "This week were got two semi-related questions about obnoxious coworkersa common workplace theme! Thank you for all the questions, please keep them coming: humanresource@lifehacker.com. \r\nDear Human Resource,\r\nI work as a file clerk at a small but very lucrati… [+4924 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nick Douglas", "title": "How to Write the Ultimate Canned Email", "description": "If you get a lot of emails that deserve at least a cursory reply, you might feel like no form-letter email could possibly replace all of them. Here’s a clever solution, borrowed from the sci-fi author Robert Heinlein. Read more...", "url": "https://lifehacker.com/how-to-write-the-ultimate-canned-email-1832879435", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--VygY7mL0--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/rjojsg7l1paiklhglrph.jpg", "publishedAt": "2019-02-25T21:15:00Z", "content": "If you get a lot of emails that deserve at least a cursory reply, you might feel like no form-letter email could possibly replace all of them. Heres a clever solution, borrowed from the sci-fi author Robert Heinlein.\r\nArtist and encourager-of-artists Austin K… [+686 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "A.A. Newton", "title": "Please Don't Put These Things Down Your Garbage Disposal", "description": "Garbage disposals are designed to take a lot of abuse, but nowhere near what some people put them through. As magical as they seem, these powerful machines do have their limits—and if used improperly, you can do just as much damage to your plumbing with a dis…", "url": "https://lifehacker.com/please-dont-put-these-things-down-your-garbage-disposal-1832877161", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--9vztjVW7--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ldombuusrou4pyrdfcoj.jpg", "publishedAt": "2019-02-25T21:30:00Z", "content": "Garbage disposals are designed to take a lot of abuse, but nowhere near what some people put them through. As magical as they seem, these powerful machines do have their limitsand if used improperly, you can do just as much damage to your plumbing with a disp… [+5066 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Brendan Hesse", "title": "Update Google Play Services to Enable Touch-ID Sign-Ins for Websites", "description": "Today, the FIDO Alliance and World Wide Web Consortium (WC3)\nannounced that the Android OS has received FIDO2 certification. This will enable Android users to use their fingerprint—rather than a password—to sign into websites and other services, and developer…", "url": "https://lifehacker.com/update-google-play-services-to-enable-touch-id-sign-ins-1832874607", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--wWCmoSc4--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xbopqtexprnekluipa2e.jpg", "publishedAt": "2019-02-25T20:30:00Z", "content": "Today, the FIDO Alliance and World Wide Web Consortium (WC3)announced that the Android OS has received FIDO2 certification. This will enable Android users to use their fingerprintrather than a passwordto sign into websites and other services, and developers w… [+2775 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Claire Lower on Skillet, shared by Claire Lower to Lifehacker", "title": "Why You Should Add a Little Yogurt to Your Butter", "description": "Even the cheapest, most basic butter is a thing of beauty but, just as I love many salts of various price points and colors, I love all sorts of different butters, from the cultured to compound. Actually, my new favorite child happens to be a compound butter …", "url": "https://skillet.lifehacker.com/why-you-should-add-a-little-yogurt-to-your-butter-1832877504", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--COD9ZUP_--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/f6gpnyxukkuyjlmqr5wd.jpg", "publishedAt": "2019-02-25T21:00:00Z", "content": "Even the cheapest, most basic butter is a thing of beauty but, just as I love many salts of various price points and colors, I love all sorts of different butters, from the cultured to compound. Actually, my new favorite child happens to be a compound butter … [+1789 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert on Offspring, shared by Meghan Moravcik Walbert to Lifehacker", "title": "How to Talk to Your Kids About Climate Change", "description": "Of all the tough conversations we should be having with our kids as they grow up, I’ll admit that educating my son about climate change has not exactly been a priority. We’ve had conversations about death, disability, mental illness, racism, sexism, poverty a…", "url": "https://offspring.lifehacker.com/how-to-talk-to-your-kids-about-climate-change-1832935630", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--gAg7OckR--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/b1cm8zmhq5avywbwylvk.jpg", "publishedAt": "2019-02-28T17:00:00Z", "content": "Of all the tough conversations we should be having with our kids as they grow up, Ill admit that educating my son about climate change has not exactly been a priority. Weve had conversations about death, disability, mental illness, racism, sexism, poverty and… [+4482 chars]"}, {"source": {"id": null, "name": "Thetakeout.com"}, "author": "Gwen Ihnat on The Takeout, shared by Alice Bradley to Lifehacker", "title": "How to make Scotch eggs, a sausage-wrapped expression of brunch love", "description": "If you’re committed to day-drinking, you have to find plausible excuses to do so. Fortunately, neighbors of ours are fans of all things Irish and are also big rugby enthusiasts. This culminates every February in weekend group parties for the Six Nations rugby…", "url": "https://thetakeout.com/recipe-how-to-make-scotch-eggs-1832907217", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--h619Nhuc--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ortmmfjcqxsvsmcfqv6t.jpg", "publishedAt": "2019-02-27T02:08:00Z", "content": "If youre committed to day-drinking, you have to find plausible excuses to do so. Fortunately, neighbors of ours are fans of all things Irish and are also big rugby enthusiasts. This culminates every February in weekend group parties for the Six Nations rugby … [+4308 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "How to Schedule an Exact Delivery Day for Your Amazon Packages", "description": "What’s worse than waiting for an Amazon package? Finding out it will arrive sometime between tomorrow and a week from now, with no guarantee. Read more...", "url": "https://lifehacker.com/how-to-schedule-an-exact-delivery-day-for-your-amazon-p-1832965958", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--1XGKeQix--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/cbl0tjcbydj6ud9q4bsa.jpg", "publishedAt": "2019-02-28T21:30:00Z", "content": "Whats worse than waiting for an Amazon package? Finding out it will arrive sometime between tomorrow and a week from now, with no guarantee.\r\nIf youre like me and tired of the uncertainty of Amazon package deliveries (SURPRISE, ITS INSIDE THE HOUSE), then pre… [+1518 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Alicia Adamczyk on Two Cents, shared by Alicia Adamczyk to Lifehacker", "title": "How to Find Out the Status of Your State Tax Refund", "description": "If you’ve filed your tax return and are waiting for that sweet, sweet refund, you likely know how easy it is to check on your federal status. You simply go to the IRS’s website or use its app (you can track yours here ). Read more...", "url": "https://twocents.lifehacker.com/how-to-find-out-the-status-of-your-state-tax-refund-1832954998", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--VH1B0C1r--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ltgkaii9kiuzrlql8irf.jpg", "publishedAt": "2019-02-28T14:30:00Z", "content": "If youve filed your tax return and are waiting for that sweet, sweet refund, you likely know how easy it is to check on your federal status. You simply go to the IRSs website or use its app (you can track yours here). \r\nThe federal government is fairly effici… [+884 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nick Douglas", "title": "Name Your Next Project With This Pun Generator", "description": "At Gizmodo Media, Lifehacker’s parent company, we love a portmanteau. A lot of our sister sites, as well as their subdomains, are combinations of existing words: Deadspin evokes backspin but also ESPN; Gizmodo contains gizmo and mod. Lifehacker’s subsites fin…", "url": "https://lifehacker.com/name-your-next-project-with-this-pun-generator-1832939093", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--8037W7YF--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/tciib0x0lnizpfdchw4c.jpg", "publishedAt": "2019-02-28T14:30:00Z", "content": "At Gizmodo Media, Lifehackers parent company, we love a portmanteau. A lot of our sister sites, as well as their subdomains, are combinations of existing words: Deadspin evokes backspin but also ESPN; Gizmodo contains gizmo and mod. Lifehackers subsites find … [+1902 chars]"}, {"source": {"id": null, "name": "Kinja.com"}, "author": "Kinja! on Kinja Roundup, shared by Alice Bradley to Lifehacker", "title": "The Concourse Gamer Was A Batshit Great Bad Movie That Was A Decade Ahead Of Its Time | Jezebel Wend", "description": "The Concourse Gamer Was A Batshit Great Bad Movie That Was A Decade Ahead Of Its Time | Jezebel Wendy Williams Is Back!!! | The Grapevine Leaving Neverland: Reconciling With the ‘Man in the Mirror’ | Splinter Democrats Ready to Throw Ilhan Omar Under the Bus,…", "url": "https://kinjaroundup.kinja.com/the-concourse-gamer-was-a-batshit-great-bad-movie-that-1833047722", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--znfWfrhX--/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/mvfeu9q41lgjnplcllqp.png", "publishedAt": "2019-03-04T22:45:00Z", "content": null}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert on Vitals, shared by Meghan Moravcik Walbert to Lifehacker", "title": "Check if Your Hospital Has a High Rate of Infection", "description": "In an effort to encourage hospitals to provide better care, the federal government penalizes those institutions that have had the highest rates of infections, readmissions and patient injuries. Under the Affordable Care Act, the government reduces Medicare pa…", "url": "https://vitals.lifehacker.com/check-if-your-hospital-has-a-high-rate-of-infection-1833060747", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--CPb49vRc--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/rvmknakylu5itxpqf0gk.jpg", "publishedAt": "2019-03-05T16:30:00Z", "content": "In an effort to encourage hospitals to provide better care, the federal government penalizes those institutions that have had the highest rates of infections, readmissions and patient injuries. Under the Affordable Care Act, the government reduces Medicare pa… [+687 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "How to Zero-Waste Grocery Shop", "description": "With the rise of zero-waste grocery stores, it’s now easier than ever to reduce your environmental impact when shopping for food. But what exactly is “zero waste”, you ask? Read more...", "url": "https://lifehacker.com/how-to-zero-waste-grocery-shop-1833064391", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--iAo9HNrO--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/jwyujbq9h4uovnbd6v2t.jpg", "publishedAt": "2019-03-05T21:30:00Z", "content": "With the rise of zero-waste grocery stores, its now easier than ever to reduce your environmental impact when shopping for food. But what exactly is zero waste, you ask?\r\nPut simply, its about producing less byproduct (not necessarily zerothats just the goal)… [+4768 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Alicia Adamczyk on Two Cents, shared by Alicia Adamczyk to Lifehacker", "title": "The Difference Between Hard and Soft Credit Inquiries", "description": "If you’ve received credit offer after offer in which you’re “pre-approved” for a certain product, you may wonder how the lender made their decision. Read more...", "url": "https://twocents.lifehacker.com/the-difference-between-hard-and-soft-credit-inquiries-1833060484", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--Fqtbf4Kl--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/bq7ohzc0wvg8uznuoqsg.jpg", "publishedAt": "2019-03-05T14:30:00Z", "content": "If youve received credit offer after offer in which youre pre-approved for a certain product, you may wonder how the lender made their decision. \r\nThe insurance/credit card/mortgage company likely made a soft credit inquiry into your report without your permi… [+3823 chars]"}, {"source": {"id": null, "name": "Kinja.com"}, "author": "Kinja! on Kinja Roundup, shared by Melissa Kirsch to Lifehacker", "title": "Deadspin The Lakers Are Exhausted And Depleted And Probably Dead | The A.V.", "description": "Deadspin The Lakers Are Exhausted And Depleted And Probably Dead | The A.V. Club The dream of the ’90s is alive in the underwhelming Captain Marvel | Splinter Batshit QAnon Book Is Currently One of the Highest Ranked Politics Books on Amazon | Jezebel Riverda…", "url": "https://kinjaroundup.kinja.com/deadspin-the-lakers-are-exhausted-and-depleted-and-prob-1833061486", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--znfWfrhX--/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/mvfeu9q41lgjnplcllqp.png", "publishedAt": "2019-03-05T14:52:00Z", "content": null}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Claire Lower on Skillet, shared by Claire Lower to Lifehacker", "title": "You Should Brûlée Your Pork Belly", "description": "Slow-cooked pork belly is pretty hard to improve upon. The uncured bacon steak is meaty and tender, with melty portions of delicious pork fat running through. It’s already indulgent, but you should make it even more so by giving it a sweet and crackly brûlée …", "url": "https://skillet.lifehacker.com/you-should-brulee-your-pork-belly-1833079149", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--if6EqIh8--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/vlzksr21bimvznfe0zmf.jpg", "publishedAt": "2019-03-06T17:00:00Z", "content": "Slow-cooked pork belly is pretty hard to improve upon. The uncured bacon steak is meaty and tender, with melty portions of delicious pork fat running through. Its already indulgent, but you should make it evenmore so by giving it a sweet and crackly brûlée cr… [+3075 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Alicia Adamczyk on Two Cents, shared by Alicia Adamczyk to Lifehacker", "title": "How Financial Gurus Make Money", "description": "Show me $1 and I’ll show you 10 “money gurus” who claim they can turn it into $2. Read more...", "url": "https://twocents.lifehacker.com/how-financial-gurus-make-money-1832996842", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--1ftC2wCV--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/fhoenxzlxl6uezzmgejl.jpg", "publishedAt": "2019-03-01T21:45:00Z", "content": "Show me $1 and Ill show you 10 money gurus who claim they can turn it into $2.\r\nThese so-called experts are a dime a dozen, and are responsible for a lot of bad money content and financial confusion. I try to avoid mentioning them when I can, which is why you… [+5387 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "A.A. Newton on Vitals, shared by A.A. Newton to Lifehacker", "title": "How to Stay Sharp in Old Age", "description": "Of all the common consequences of aging, none is more frightening than memory loss. Even if you’ve never helplessly watched a loved one succumb to Alzheimer’s—which I promise is worse than it sounds—it’s natural to wonder if something similar could happen to …", "url": "https://vitals.lifehacker.com/how-to-stay-sharp-in-old-age-1832826400", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--ZIkV3DEV--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/moaahakmzltj3cbqv58e.png", "publishedAt": "2019-03-01T14:00:00Z", "content": "Of all the common consequences of aging, none is more frightening than memory loss. Even if youve never helplessly watched a loved one succumb to Alzheimerswhich I promise is worse than it soundsits natural to wonder if something similar could happen to you. … [+14255 chars]"}, {"source": {"id": null, "name": "Thetakeout.com"}, "author": "Gwen Ihnat on The Takeout, shared by Virginia K. Smith to Lifehacker", "title": "Lessons I’ve learned from a decade of neighborhood chili cook-offs", "description": "I don’t consider myself a competitive person, but my friends would likely require your largest bath sheet to wipe away tears of laughter if they heard me say so. It’s true there are certain events that raise my blood pressure and get my adrenaline up, like va…", "url": "https://thetakeout.com/how-to-win-your-neighborhood-chili-cookoff-contest-1832941259", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--gPKSWm20--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/cnpl0hfwmbcymlpxkdvk.jpg", "publishedAt": "2019-03-01T01:31:00Z", "content": "I dont consider myself a competitive person, but my friends would likely require your largest bath sheet to wipe away tears of laughter if they heard me say so. Its true there are certain events that raise my blood pressure and get my adrenaline up, like vaca… [+7602 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "Unplug Your Electronics Before a Thunderstorm", "description": "Bad weather around the corner? You may have to endure a rainy day without electronic distractions—that is, if you still want your television to turn on the following day. Read more...", "url": "https://lifehacker.com/unplug-your-electronics-before-a-thunderstorm-1832986570", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--EB3CDJuV--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/wvrniwch4ndr02ucdkq7.jpg", "publishedAt": "2019-03-01T18:30:00Z", "content": "Bad weather around the corner? You may have to endure a rainy day without electronic distractionsthat is, if you still want your television to turn on the following day.\r\nToday, CNET brought up the one question many of us asked ourselves during a thunderstorm… [+2532 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Why Does My Laptop Take 30 Minutes to Start Up?", "description": "One of the more annoying situations you can encounter is a desktop or laptop that takes forever to load. It gets there eventually, but one of the surest signs that something has gone wrong is when your system takes a lot longer to boot into Windows or macOS t…", "url": "https://lifehacker.com/why-does-my-laptop-take-30-minutes-to-start-up-1832958231", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--WrnCgUEk--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xza5bid7p60x8o4u9m6t.png", "publishedAt": "2019-03-01T15:30:00Z", "content": "One of the more annoying situations you can encounter is a desktop or laptop that takes forever to load. It gets there eventually, but one of the surest signs that something has gone wrong is when your system takes a lot longer to boot into Windows or macOS t… [+4523 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nick Douglas", "title": "Find Examples of Word Use With This Web App", "description": "A thesaurus is a fruitful tool when you use it befittingly. If you fathom what you’re performing, a thesaurus patronizes you find the merited word for your specific ballgame. But if you ply synonyms without kenning their shadinesses of gist, you will look rea…", "url": "https://lifehacker.com/find-examples-of-word-use-with-this-web-app-1832960909", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--Q4C68GcV--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/zoqap1c6q7qbfvutl3wb.png", "publishedAt": "2019-03-01T16:00:00Z", "content": "A thesaurus is a fruitful tool when you use it befittingly. If you fathom what youre performing, a thesaurus patronizes you find the merited word for your specific ballgame. But if you ply synonyms without kenning their shadinesses of gist, you will look real… [+3449 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nick Douglas", "title": "Tell Us Your City's Best Parking Hacks", "description": "During a Chicago winter, you can reserve a parking spot with a folding chair, a playpen, or a giant teddy bear. Or at least you can try. It’s one of the greatest parking hacks in the world: If you shovel out a snowed-in parking spot in Chicago, and you put a …", "url": "https://lifehacker.com/tell-us-your-citys-best-parking-hacks-1832989545", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--fVSvu-rS--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/bfgkbncxsvxxdljy70a4.jpg", "publishedAt": "2019-03-04T14:00:00Z", "content": "During a Chicago winter, you can reserve a parking spot with a folding chair, a playpen, or a giant teddy bear. Or at least you can try. Its one of the greatest parking hacks in the world: If you shovel out a snowed-in parking spot in Chicago, and you put a p… [+1495 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Brendan Hesse", "title": "Use a Plex Media Server to Stream Your Media Collection Anywhere", "description": "We might be in the era of cloud streaming and subscription services, but media ownership (both digital and physical) is still alive and well. That said, being able to consolidate and stream your collection of movies, music, and other media from one place is f…", "url": "https://lifehacker.com/use-a-plex-media-server-to-stream-your-media-collection-1832992483", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--7un7TqP8--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/bfokoadlpeay70c4vjtv.jpg", "publishedAt": "2019-03-04T18:00:00Z", "content": "We might be in the era of cloud streaming and subscription services, but media ownership (both digital and physical) is still alive and well. That said, being able to consolidate and stream your collection of movies, music, and other media from one place is f… [+9520 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "What to Do When You've Witnessed a Hit-and-Run Accident", "description": "You’re on a sidewalk, and suddenly, a driver in a Tesla hits a parked car. The car smashes the other’s side-view mirror, leaving shards in its wake. Before you have time to process what’s happened, the driver speeds off. Come back here, you filthy rascal! You…", "url": "https://lifehacker.com/what-to-do-when-youve-witnessed-a-hit-and-run-accident-1833038734", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--BDaAf0yl--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/yzl4amffuzbz1rvax55v.jpg", "publishedAt": "2019-03-04T22:00:00Z", "content": "Youre on a sidewalk, and suddenly, a driver in a Tesla hits a parked car. The car smashes the others side-view mirror, leaving shards in its wake. Before you have time to process whats happened, the driver speeds off. Come back here, you filthy rascal! You wo… [+3917 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Alicia Adamczyk on Two Cents, shared by Alicia Adamczyk to Lifehacker", "title": "Bridge Your Relationship's Money Gap With a Data Dump", "description": "One of the keys to getting on the same page with your partner about money is to have open and honest communication. As Lifehacker has covered, scheduling periodic money check-ins—whether that’s weekly, monthly, etc.—is important in any relationship. Read more…", "url": "https://twocents.lifehacker.com/bridge-your-relationships-money-gap-with-a-data-dump-1832898475", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--WgfWQWMT--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xbgtq1k0ov8ze5321shl.jpg", "publishedAt": "2019-02-26T19:00:00Z", "content": "One of the keys to getting on the same page with your partner about money is to have open and honest communication. As Lifehacker has covered, scheduling periodic money check-inswhether thats weekly, monthly, etc.is important in any relationship.\r\nWhere you m… [+2574 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Aimée Lutkin", "title": "How to Properly Hand Wash Dishes in the Sink", "description": "There are a lot of things you shouldn’t be putting in the dishwasher, if you’re lucky enough to have one. That means putting on the gloves and getting to scrubbing, yes, but there’s also a right and wrong way to hand wash most things. Read more...", "url": "https://lifehacker.com/how-to-properly-hand-wash-dishes-in-the-sink-1832900812", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--DTImAhx0--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xs183qnv7jjjnrpxomxt.jpg", "publishedAt": "2019-02-26T21:18:00Z", "content": "There are a lot of things you shouldnt be putting in the dishwasher, if youre lucky enough to have one. That means putting on the gloves and getting to scrubbing, yes, but theres also a right and wrong way to hand wash most things.\r\nAs someone who grew up wit… [+4906 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "How to Turn on Your Windows PC Automatically Each Morning", "description": "Most of us have morning rituals, and yours probably involves a computer at some point. And while it’s not that hard to press the power button, wait for your system to boot up, and then type in your Windows password to log into your desktop, those are a lot of…", "url": "https://lifehacker.com/how-to-turn-on-your-windows-pc-automatically-each-morni-1832926531", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--cxvgj_Zg--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ygcggfbjfubpvafuu7au.jpg", "publishedAt": "2019-02-27T15:30:00Z", "content": "Most of us have morning rituals, and yours probably involves a computer at some point. And while its not that hard to press the power button, wait for your system to boot up, and then type in your Windows password to log into your desktop, those are a lot of … [+2448 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "Rediscover Random Episodes of Your Favorite Shows on Netflix Using This Web App", "description": "We all have a few shows that we love. When that show is one with seven or eight seasons then choosing which episode to rewatch on a Saturday afternoon can be a bit of a challenge. For me, that typically means watching the same five or six episodes over and ov…", "url": "https://lifehacker.com/rediscover-random-episodes-of-your-favorite-shows-on-ne-1833020395", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--PbdijWxc--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ytwafsvdp5mhlttnosj5.jpg", "publishedAt": "2019-03-03T16:48:00Z", "content": "We all have a few shows that we love. When that show is one with seven or eight seasons then choosing which episode to rewatch on a Saturday afternoon can be a bit of a challenge. For me, that typically means watching the same five or six episodes over and ov… [+1081 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "Stop Recycling Plastic Bottles Without Caps On", "description": "With the recycling industry in flux, the rules surrounding recycling plastic aren’t always a given (at least, in the U.S.). For one, you can’t recycle plastic bags or straws and now black plastic is even becoming a problem. How will we ever know the right way…", "url": "https://lifehacker.com/stop-recycling-plastic-bottles-without-caps-on-1832992981", "urlToImage": null, "publishedAt": "2019-03-01T21:30:00Z", "content": null}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "How to Date Someone Who's Sober", "description": "Dating’s hard as it is. For those in recovery from substance abuse, or simply don’t drink, it can be even harder. It’s not an easy conversation to have on a first date, after all, and it can complicate those first few outings when the option of having a date …", "url": "https://lifehacker.com/how-to-date-someone-whos-sober-1833044831", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--FKDyJ1B9--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/krjqqn9ke5waelfmbhjc.jpg", "publishedAt": "2019-03-05T19:00:00Z", "content": "Datings hard as it is. For those in recovery from substance abuse, or simply dont drink, it can be even harder. Its not an easy conversation to have on a first date, after all, and it can complicate those first few outings when the option of having a date at … [+4477 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert on Offspring, shared by Meghan Moravcik Walbert to Lifehacker", "title": "Let Kids Receive Gifts at Their Birthday Parties", "description": "Seeing “Please, no gifts” on a child’s birthday party invitation has become more and more common in recent years. And I can understand why. They already have so much stuff. They’re probably going to be getting gifts from grandparents or aunts and uncles, too.…", "url": "https://offspring.lifehacker.com/let-kids-receive-gifts-at-their-birthday-parties-1833229625", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--vafP5rIw--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/jfkrs3g3nkwcsu4ob5xf.jpg", "publishedAt": "2019-03-12T20:00:00Z", "content": "Seeing Please, no gifts on a childs birthday party invitation has become more and more common in recent years. And I can understand why. They already have so much stuff. Theyre probably going to be getting gifts from grandparents or aunts and uncles, too. Per… [+3542 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Claire Lower on Skillet, shared by Claire Lower to Lifehacker", "title": "Turn a Can of Black Eyed Peas Into a Hearty Stew", "description": "I’d never thought I’d say this, but I am fairly obsessed with canned black eyed peas. They make a great hummus, yes, but they’re also the perfect base for an extremely filling, surprisingly delicious stew that comes together in under 15 minutes. Read more...", "url": "https://skillet.lifehacker.com/turn-a-can-of-black-eyed-peas-into-a-hearty-stew-1833204388", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--fx4Br-ui--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ouanskg2aty2qqofp0vv.jpg", "publishedAt": "2019-03-11T16:00:00Z", "content": "Id never thought Id say this, but I am fairly obsessed with canned black eyed peas. They make a great hummus, yes, but theyre also the perfect base for an extremely filling, surprisingly delicious stew that comes together in under 15 minutes.\r\nI have always t… [+1692 chars]"}, {"source": {"id": null, "name": "Kinja.com"}, "author": "Kinja! on Kinja Roundup, shared by Melissa Kirsch to Lifehacker", "title": "Jezebel Olympic Cyclist Kelly Catlin Is Dead at 23 | Deadspin The Warriors Had Another Weird One, An", "description": "Jezebel Olympic Cyclist Kelly Catlin Is Dead at 23 | Deadspin The Warriors Had Another Weird One, And Now It’s Time To Read Steve Kerr’s Lips | Splinter Here’s Tucker Carlson Going Full Misogynist and Saying Wild Shit About Rape  | The Grapevine It Seems Like…", "url": "https://kinjaroundup.kinja.com/jezebel-olympic-cyclist-kelly-catlin-is-dead-at-23-de-1833201788", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--znfWfrhX--/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/mvfeu9q41lgjnplcllqp.png", "publishedAt": "2019-03-11T14:18:00Z", "content": null}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "IHOP is Offering Customers Free Pancakes on Tuesday", "description": "Tuesday is IHOPs 14th annual free pancake day, and this year’s theme is “Flip it forward for kids.” From 7am to 7pm on Tuesday, participating restaurants are giving away a free short stack of pancakes to anyone that wants one. In some cases, locations will st…", "url": "https://lifehacker.com/ihop-is-offering-customers-free-pancakes-on-tuesday-1833212752", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--Sk9blvkl--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ffv8qgsp0q39nw1ivuo3.jpg", "publishedAt": "2019-03-11T20:40:00Z", "content": "Tuesday is IHOPs 14th annual free pancake day, and this years theme is Flip it forward for kids. From 7am to 7pm on Tuesday, participating restaurants are giving away a free short stack of pancakes to anyone that wants one. In some cases, locations will stay … [+914 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Joel Kahn", "title": "A Non-Geek's Guide to Start Reading Comics", "description": "So you want to get into comics, but don’t know where to start. Read more...", "url": "https://lifehacker.com/a-non-geeks-guide-to-start-reading-comics-1833244345", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--5NiBAo95--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/v1/qa/3651112.jpg", "publishedAt": "2019-03-13T15:30:00Z", "content": "So you want to get into comics, but dont know where to start.\r\nShould you buy a volume, or an omnibus? Should you check out a classic superhero starting from the very first issue? What can you read if you dont even like superheroes? Are graphic novels inheren… [+471 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Spice Up Google's Carmen Sandiego Game With the Real Theme Song", "description": "I have always had room in my heart for the old-school “edutainment” Carmen Sandiego games, because they taught me a decent bit about geography as a kid. I also loved the awesome television show (with the awesome theme song), although I’m pretty sure I had nig…", "url": "https://lifehacker.com/spice-up-googles-carmen-sandiego-game-with-the-real-the-1833271689", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--K7Ia644O--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ebx8xn35lzaod033morr.png", "publishedAt": "2019-03-13T22:00:00Z", "content": "I have always had room in my heart for the old-school edutainment Carmen Sandiego games, because they taught me a decent bit about geography as a kid. I also loved the awesome television show (with the awesome theme song), although Im pretty sure I had nightm… [+2079 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Claire Lower on Skillet, shared by Claire Lower to Lifehacker", "title": "You Should Brûlée Your Next Glazed Doughnut", "description": "A good doughnut does not rely on gimmicks, but a gimmick can help out a subpar doughnut. It doesn’t matter how artisanal or renowned a doughnut shop is, if they can’t produce a decent plain, yeast-risen, glaze doughnut—without covering it in distracting ingre…", "url": "https://skillet.lifehacker.com/you-should-brulee-your-next-glazed-doughnut-1833377289", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--ELbixqXY--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xbrhotm2kciqcwsvyr2k.jpg", "publishedAt": "2019-03-18T16:30:00Z", "content": "A good doughnut does not rely on gimmicks, but a gimmick can help out a subpar doughnut. It doesnt matter how artisanal or renowned a doughnut shop is, if they cant produce a decent plain, yeast-risen, glaze doughnutwithout covering it in distracting ingredie… [+1368 chars]"}, {"source": {"id": null, "name": "Thetakeout.com"}, "author": "Kevin Pang on The Takeout, shared by Virginia K. Smith to Lifehacker", "title": "Cooking from Anthony Bourdain's Les Halles Cookbook: Finding pleasures in Boeuf Bourguignon", "description": "All this week, The Takeout’s Kevin Pang will be cooking from Anthony Bourdain’s Les Halles Cookbook and writing about his experience. Read more...", "url": "https://thetakeout.com/anthony-bourdain-les-halles-cookbook-boeuf-bourguignon-1833392149", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--N515dgsm--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/bdirftqfxsdcgcjjs1a8.jpg", "publishedAt": "2019-03-19T05:08:00Z", "content": "All this week, The Takeouts Kevin Pang will be cooking from Anthony Bourdains Les Halles Cookbook and writing about his experience.\r\nMy appreciation for boeuf Bourguignon entered late in my life. It was there all along, defying my derision, even as I and many… [+6131 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Rebecca Fishbein", "title": "How to Select the Right Therapist for You", "description": "It’s not easy to find a good therapist. Therapy can be incredibly cost-prohibitive, for one thing, depending on insurance coverage. Then, there are scheduling constraints (it’s hard to find a therapist with open hours if you work a traditional 9-to-5), locati…", "url": "https://lifehacker.com/how-to-select-the-right-therapist-for-you-1833246447", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--JoH7_gda--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/kjynu3bl6yogibirtz4z.jpg", "publishedAt": "2019-03-21T13:00:00Z", "content": "Its not easy to find a good therapist. Therapy can be incredibly cost-prohibitive, for one thing, depending on insurance coverage. Then, there are scheduling constraints (its hard to find a therapist with open hours if you work a traditional 9-to-5), location… [+10091 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nick Douglas", "title": "Track Multiple Time Zones in Your Menu Bar With This Little App", "description": "MacOS: We still like Clocker, the free time zone clock for your menu bar. But if you have to track a lot of time zones, you should also look at Menu World Time, another free menu bar world clock with a slightly different interface. Read more...", "url": "https://lifehacker.com/track-multiple-time-zones-in-your-menu-bar-with-this-li-1833438396", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--I9jkwy7D--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/oudokyrvdu5k0pkvpvut.jpg", "publishedAt": "2019-03-21T14:00:00Z", "content": "MacOS: We still like Clocker, the free time zone clock for your menu bar. But if you have to track a lot of time zones, you should also look at Menu World Time, another free menu bar world clock with a slightly different interface.\r\nMac: Your Mac has a world … [+935 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki on Vitals, shared by Beth Skwarecki to Lifehacker", "title": "Roundup Lost a Lawsuit, But We Still Don't Know if It Causes Cancer", "description": "This week a jury found that a man’s use of Roundup on weeds in his yard was a “substantial factor” in causing the cancer that he developed years later. But court cases are not scientific studies, and scientists are still divided on whether glyphosate should r…", "url": "https://vitals.lifehacker.com/roundup-lost-a-lawsuit-but-we-still-dont-know-if-it-ca-1833446705", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--AENmFAsW--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/cpbdodznvnlawsfjrviu.jpg", "publishedAt": "2019-03-20T20:30:00Z", "content": "This week a jury found that a mans use of Roundup on weeds in his yard was a substantial factor in causing the cancer that he developed years later. But court cases are not scientific studies, and scientists are still divided on whether glyphosate should real… [+2050 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Brendan Hesse", "title": "Pre-Register Now for the 'Call of Duty: Mobile' Beta on iOS and Android", "description": "Following in the footsteps of PUBG and Fortnite, Activision is bringing Call of Duty’s storied multiplayer gameplay to iOS and Android devices with Call of Duty: Mobile. The game will include classic Call of Duty multiplayer modes such as Team Death Match and…", "url": "https://lifehacker.com/pre-register-now-for-the-call-of-duty-mobile-beta-on-i-1833442617", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--6cr10Mj7--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/gaowv977wumcq9llsgca.jpg", "publishedAt": "2019-03-20T18:50:00Z", "content": "Following in the footsteps of PUBG and Fortnite, Activision is bringing Call of Dutys storied multiplayer gameplay to iOS and Android devices with Call of Duty: Mobile. The game will include classic Call of Duty multiplayer modes such as Team Death Match and … [+2616 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Josh Ocampo", "title": "How to Save on Airline Baggage Fees", "description": "Remember the days when you could board a flight without long security lines and exorbitant bag fees? Believe it or not, there was a time when airports didn’t feel like a nightmare you couldn’t wake up from. Read more...", "url": "https://lifehacker.com/how-to-save-on-airline-baggage-fees-1833461087", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--GxVgn0JV--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/iafht3accq828v1njtph.jpg", "publishedAt": "2019-03-21T18:30:00Z", "content": "Remember the days when you could board a flight without long security lines and exorbitant bag fees? Believe it or not, there was a time when airports didnt feel like a nightmare you couldnt wake up from.\r\nAnd while security lines may be unavoidable (for now)… [+3998 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "A.A. Newton", "title": "How Not to Email Customer Support", "description": "Nobody likes waiting on hold to talk to customer support, but for some reason, waiting for an email reply can be even more frustrating. Angrily smashing that “reply” button before you get a response might feel satisfying in the moment, but it actually decreas…", "url": "https://lifehacker.com/how-not-to-email-customer-support-1833465655", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--GOx5jb8E--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/zewyubavmjlak7edw825.jpg", "publishedAt": "2019-03-21T18:00:00Z", "content": "Nobody likes waiting on hold to talk to customer support, but for some reason, waiting for an email reply can be even more frustrating. Angrily smashing that reply button before you get a response might feel satisfying in the moment, but it actually decreases… [+2365 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Mike Epstein", "title": "How to Sign Up for the Android Q Beta Right Now", "description": "The Android OS cycle starts again this week, with Google announcing more details on Android Q and releasing a first,  early beta for adventurous types who want to take a peek under the hood. If you’re one of those people, and you have a Google Pixel phone, yo…", "url": "https://lifehacker.com/how-to-sign-up-for-the-android-q-beta-right-now-1833291629", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--bZWaepUV--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ymwvapeeyudvjxt6frjb.jpg", "publishedAt": "2019-03-14T16:30:00Z", "content": "The Android OS cycle starts again this week, with Google announcing more details on Android Q and releasing a first, early beta for adventurous types who want to take a peek under the hood. If youre one of those people, and you have a Google Pixel phone, you … [+3280 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "A.A. Newton on Skillet, shared by A.A. Newton to Lifehacker", "title": "Leave Onion Roots Intact for Easier Slicing and Dicing", "description": "By now, I could chop an onion in my sleep: slice it in half, trim off the stem and root, peel, and slice away. In all my years of onion prep, it never occurred to me to shake things up, but skipping just one of those steps—removing the root—has changed my hea…", "url": "https://skillet.lifehacker.com/leave-onion-roots-intact-for-easier-slicing-and-dicing-1833271164", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--f260hS2X--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/pqdrdvqhmnsiwwfa8pv7.jpg", "publishedAt": "2019-03-14T17:30:00Z", "content": "By now, I could chop an onion in my sleep: slice it in half, trim off the stem and root, peel, and slice away. In all my years of onion prep, it never occurred to me to shake things up, but skipping just one of those stepsremoving the roothas changed my heavi… [+873 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Mike Epstein", "title": "Having Issues Playing Games on PC? Update Windows 10", "description": "If you’ve noticed that some of your games on Windows 10 have been particularly unresponsive in the last week, you aren’t alone. Microsoft confirmed that a recent Windows 10 update, patch KB4482887, introduced a bug that dramatically increased lag. Don’t sweat…", "url": "https://lifehacker.com/having-issues-playing-games-on-pc-update-windows-10-1833277554", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--2N1Fq4_0--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/usyytbhexbxdwc7flam5.png", "publishedAt": "2019-03-14T14:30:00Z", "content": "If youve noticed that some of your games on Windows 10 have been particularly unresponsive in the last week, you arent alone. Microsoft confirmed that a recent Windows 10 update, patch KB4482887, introduced a bug that dramatically increased lag. Dont sweat it… [+1583 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "Update WinRAR on Your PC Right Now", "description": "Last month a 19-year-old bug was discovered in WinRAR, the software many PC users use to extract.zip and other files on their computer. While the company was quick to patch the bug, that match requires users to update their software in order to be safe from t…", "url": "https://lifehacker.com/update-winrar-on-your-pc-right-now-1833353182", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--j0h9us7t--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/nm7mkuwga19modhjfj14.jpg", "publishedAt": "2019-03-16T22:18:00Z", "content": "Last month a 19-year-old bug was discovered in WinRAR, the software many PC users use to extract .zip and other files on their computer. While the company was quick to patch the bug, that match requires users to update their software in order to be safe from … [+590 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "Change Your March Southwest Flights For Free, Even if There's a Fare Difference", "description": "It may have taken the FAA to convince Southwest to take its 737 Max 8’s out of the air, but the airline is making up for it (sort of) with a March promotion that allows you to change your flight for free, even if there’s a difference in the price of the ticke…", "url": "https://lifehacker.com/change-your-march-southwest-flights-for-free-even-if-t-1833338919", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--agiWZIDY--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ibmjwlbnfc1o0dih2oup.jpg", "publishedAt": "2019-03-16T14:00:00Z", "content": "It may have taken the FAA to convince Southwest to take its 737 Max 8s out of the air, but the airline is making up for it (sort of) with a March promotion that allows you to change your flight for free, even if theres a difference in the price of the ticket.… [+1256 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Claire Lower on Skillet, shared by Claire Lower to Lifehacker", "title": "How to Make a Cachaça Cocktail That Isn't a Caipirinha", "description": "This week, while rearranging my bar cart, I rediscovered a bottle of cachaça, which I had only ever used to make the iconic caipirinha. It’s a great drink, but I hate monotony, even in my cocktails, which led to me searching the internet for other, non-caipir…", "url": "https://skillet.lifehacker.com/how-to-make-a-cachaca-cocktail-that-isnt-a-caipirinha-1833159532", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--9TrBPBE7--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xjddnzjjmgy1a8rqc43x.jpg", "publishedAt": "2019-03-08T21:30:00Z", "content": "This week, while rearranging my bar cart, I rediscovered a bottle of cachaça, which I had only ever used to make the iconic caipirinha. Its a great drink, but I hate monotony, even in my cocktails, which led to me searching the internet for other, non-caipiri… [+1003 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "A.A. Newton on Skillet, shared by A.A. Newton to Lifehacker", "title": "Turn Sad Winter Tomatoes into Delicious Roasted Salsa", "description": "At least once a year, desperate for the tiniest glimmer of spring, I buy the first crop of supermarket tomatoes that look even vaguely ripe. They are never anything but a total letdown, which means I end up regretting my purchase—and resenting those subpar to…", "url": "https://skillet.lifehacker.com/turn-sad-winter-tomatoes-into-delicious-roasted-salsa-1833380599", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--lGGjel_c--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/qwt7ibnxvhne6xgroetm.jpg", "publishedAt": "2019-03-19T13:00:00Z", "content": "At least once a year, desperate for the tiniest glimmer of spring, I buy the first crop of supermarket tomatoes that look even vaguely ripe. They are never anything but a total letdown, which means I end up regretting my purchaseand resenting those subpar tom… [+6346 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert on Offspring, shared by Meghan Moravcik Walbert to Lifehacker", "title": "Do Not Vape Around Your Kids", "description": "A new study by MassGeneral Hospital for Children (MGHfC) researchers found that many parents perceive e-cigarettes to be safer than regular cigarettes. Parents who vape were much more likely to vape in their homes and cars with their children present than par…", "url": "https://offspring.lifehacker.com/do-not-vape-around-your-kids-1833326607", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--lfoL0rte--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/izxbnzfkx98jsy66fgzk.jpg", "publishedAt": "2019-03-18T13:00:00Z", "content": "A new study by MassGeneral Hospital for Children (MGHfC) researchers found that many parents perceive e-cigarettes to be safer than regular cigarettes. Parents who vape were much more likely to vape in their homes and cars with their children present than par… [+2083 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Brendan Hesse", "title": "How to Safely Opt Your Device Out of the Android Q Beta Program", "description": "While Google is letting users test out the upcoming Android Q through a public beta program, it’s not going to be for everyone. If you updated to the Android Q beta build and find your device has slowed down, that the battery isn’t as efficient, or that certa…", "url": "https://lifehacker.com/how-to-safely-opt-your-device-out-of-the-android-q-beta-1833378770", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--1cxuJ3W2--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/et6ubfvh78lssjsqcyxz.jpg", "publishedAt": "2019-03-18T18:45:00Z", "content": "While Google is letting users test out the upcoming Android Q through a public beta program, its not going to be for everyone. If you updated to the Android Q beta build and find your device has slowed down, that the battery isnt as efficient, or that certain… [+5703 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Meghan Moravcik Walbert", "title": "'Marie Kondo' Is Not a Verb", "description": "Boy, we really know how to wreck a good thing. Japan sends us their charismatic organizational expert and what do we Americans do? We ruin her by turning her into a verb. Read more...", "url": "https://lifehacker.com/marie-kondo-is-not-a-verb-1833373654", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--72llxj0q--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/oruf4oavtj5vpmvaquew.jpg", "publishedAt": "2019-03-18T18:30:00Z", "content": "Boy, we really know how to wreck a good thing. Japan sends us their charismatic organizational expert and what do we Americans do? We ruin her by turning her into a verb. \r\nMaybe shes partly to blame. (As Americans, we also like to blame everyone else.) We ha… [+1907 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Long", "title": "How to Repot Your Plants", "description": "Despite what Instagram would have you believe, plant parenting is hard. There are so many questions to answer. Are you watering too much? Not enough? Is the light in your space bright, indirect, or low? What is soil rot? Why is everything dying? Read more...", "url": "https://lifehacker.com/how-to-repot-your-plants-1833383381", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--LfZcmDWQ--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/y5iiycsohhqug9yrg2qv.jpg", "publishedAt": "2019-03-18T21:00:00Z", "content": "Despite what Instagram would have you believe, plant parenting is hard. There are so many questions to answer. Are you watering too much? Not enough? Is the light in your space bright, indirect, or low? What is soil rot? Why is everything dying?\r\nThis is why … [+2604 chars]"}]}