{"status": "ok", "totalResults": 966, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Save money with Rakuten’s site-wide sale and Walmart’s Nintendo Switch discount", "description": "Rakuten is hosting a site-wide sale today, and you can save 15 percent on many tech products with an offer code. At Walmart, you can still save $30 on an acclaimed Switch game when you buy a Nintendo Switch console.", "url": "https://www.theverge.com/good-deals/2019/3/18/18271099/rakuten-walmart-nintendo-switch-sale-discount-deal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/cttgAetqigMEnHQVLaFRuq9lWeo=/0x214:2040x1282/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13119947/akrales_180919_2956_0013.jpg", "publishedAt": "2019-03-18T20:36:45Z", "content": "Japanese e-commerce giant Rakuten is hosting another site-wide discount, and you can save 15 percent on select products when you use the offer code SAVE15 at checkout. Promos like these happen fairly regularly, and the offer code typically works on most of th… [+1222 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Qualcomm is working on standalone wireless VR headsets that can also connect to PCs", "description": "Qualcomm’s new VR headset will be one of the first to work as a standalone mobile headset and also connect to PCs wirelessly. The headsets will be demoed at the Game Developers Conference that’s currently going on in San Francisco, and they could arrive in st…", "url": "https://www.theverge.com/2019/3/18/18271385/qualcomm-wireless-vr-headset-standalone-connect-to-pc", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Y7epTkfRyOsWvwxLsiYn8v-OFnA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7408601/qualcomm_vr_adi_robertson_1.jpg", "publishedAt": "2019-03-18T20:24:27Z", "content": "Qualcomms new VR headset will be one of the first to work as a standalone mobile headset and also connect to PCs wirelessly. The headsets will be demoed at the Game Developers Conference thats currently going on in San Francisco, and they could arrive in stor… [+1718 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "New Zealand ISPs are blocking sites that do not remove Christchurch shooting video", "description": "Sites like 4chan, 8chan, LiveLeak, and the file-sharing site Mega have all been pulled by ISPs like Vodafone, Spark, and Vocus. The ISPs appear to be blocking access at the DNS level to sites that do not respond to takedown requests, but it’s unclear how effe…", "url": "https://www.theverge.com/2019/3/18/18271511/new-zealand-isp-blocking-sites-christchurch-shooting-video-removal-4chan-8chan-liveleak", "urlToImage": "https://cdn.vox-cdn.com/thumbor/sh4p-y-b6denYZfYtZ44i7HLMZY=/0x71:1020x605/fit-in/1200x630/cdn.vox-cdn.com/assets/1153349/ethernet-internet-cord-stock_1020.jpg", "publishedAt": "2019-03-18T20:01:57Z", "content": "Following the Christchurch shooting last week, internet service providers in New Zealand are blocking access to websites that do not respond or refuse to comply to requests to remove reuploads of the shooter’s original live stream. According to Bleeping Compu… [+1547 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "JR Raphael", "title": "How to set up emergency location sharing on Android and iOS", "description": "Both Android and iOS have easy-to-use systems for sharing your location with a friend, family member, or other trusted contact in an emergency.", "url": "https://www.theverge.com/2019/3/18/18267500/how-to-set-up-emergency-location-sharing-android-ios", "urlToImage": "https://cdn.vox-cdn.com/thumbor/j1DFS0oeRVl0dxKAu806WZDHKIE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970374/akrales_190318_3299_0011.jpg", "publishedAt": "2019-03-18T19:44:45Z", "content": "Smartphones are spectacular for snapping photos, scanning the news, and sending messages, but they can also be literal lifesavers if you take the time to set them up before the need arises.\r\nBoth Android and iOS have easy-to-use systems for sharing your locat… [+4136 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "B David Zarley", "title": "America’s first exascale supercomputer to be built by 2021", "description": "Details of America’s next-generation supercomputer were revealed at a ceremony attended by Secretary of Energy Rick Perry and Senator Dick Durbin at Argonne National Laboratory. The Department of Energy’s new supercomputer will be built by Intel Corporation a…", "url": "https://www.theverge.com/2019/3/18/18271328/supercomputer-build-date-exascale-intel-argonne-national-laboratory-energy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/uNEtwSZBc5XzwNPn5lMRtmr9-FU=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970267/High_tech_Aurora1600x900.jpg", "publishedAt": "2019-03-18T19:19:21Z", "content": "Details of Americas next-generation supercomputer were revealed at a ceremony attended by Secretary of Energy Rick Perry and Senator Dick Durbinat Argonne National Laboratory today. The Department of Energys new supercomputer will be built by Intel at Argonne… [+4505 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Stefan Etienne", "title": "Xiaomi announces its Black Shark 2 gaming phone with a pressure-sensitive AMOLED display", "description": "The gaming phone trend is continuing into Spring 2019, with Xiaomi announcing the new Black Shark 2 smartphone, equipped with a pressure-sensitive AMOLED display and a Snapdragon 855. And yes, it looks gaudy like most gaming hardware.", "url": "https://www.theverge.com/2019/3/18/18271308/xiaomi-black-shark-2-gaming-phone-pressure-sensitive-amoled-display-snapdragon", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Ww-ZqDg0P0cRQcYiRpZWYgoCc4U=/0x114:1177x730/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970222/Annotation_2019_03_18_142153.jpg", "publishedAt": "2019-03-18T18:59:15Z", "content": "Today, Xiaomi announced its new gaming smartphone, the Black Shark 2. We previewed the first model last year ; at the time, it seemed like a promising competitor to other gaming phone makers, like Asus and Razer. And Xiaomi is no stranger to designing and rel… [+1968 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Netflix’s next interactive show is called You vs. Wild, launches April 10th", "description": "Netflix has announced its next big interactive story — a choose-your-adventure TV series called You vs. Wild (emphasis on the “adventure” part, here), starring Bear Grylls, the survival TV personality best known for his Discovery Channel series Man vs. Wild, …", "url": "https://www.theverge.com/2019/3/18/18271372/netflix-interactive-show-you-vs-wild-bear-grylls-date", "urlToImage": "https://cdn.vox-cdn.com/thumbor/XAszDGUbvwu6wYVFOQbK0p5VFUk=/0x20:1000x544/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970264/youvswild_onesheet_srgb_v2web_e1552929968648.jpg", "publishedAt": "2019-03-18T18:53:16Z", "content": "Netflix has announced its next big interactive story — a choose-your-adventure TV series called You vs. Wild (emphasis on the “adventure” part, here), starring Bear Grylls, the survival TV personality best known for his Discovery Channel series Man vs. Wild, … [+1504 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Warner Bros. chairman and CEO Kevin Tsujihara is out amid allegations", "description": "For a moment, it seemed like Warner Bros. boss Kevin Tsujihara might have been in the clear — despite allegations that he’d had an extramarital affair with one of the studio’s actresses, his new corporate overlords at AT&T saw fit to promote him to head up al…", "url": "https://www.theverge.com/2019/3/18/18271309/warner-bros-ceo-chairman-step-down-kevin-tsujihara-sexual-misconduct-scandal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/8tOABtVndPpKtP7TOX_UBK8wcIc=/0x253:3533x2103/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970137/996307962.jpg.jpg", "publishedAt": "2019-03-18T18:21:23Z", "content": "For a moment, it seemed like Warner Bros. boss Kevin Tsujihara might have been in the clear despite allegations that hed had an extramarital affair with one of the studios actresses, his new corporate overlords at AT&amp;T saw fit to promote him to head up al… [+1158 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "The first Apex Legends battle pass launches tomorrow with new character Octane", "description": "Respawn Entertainment’s fast-growing battle royale hit Apex Legends is launching its much-anticipated first season tomorrow, the developer announced this morning. The first season, dubbed Wild Frontier, will come with a Fortnite-style battle pass costing $9.5…", "url": "https://www.theverge.com/2019/3/18/18271259/apex-legends-respawn-battle-pass-season-one-octane-new-legend-announced", "urlToImage": "https://cdn.vox-cdn.com/thumbor/CcPZANBxv_kpB8HJ10e2i8kiyEM=/0x31:1600x869/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970066/apex_legends_octane_celebration_2048.jpg", "publishedAt": "2019-03-18T17:42:04Z", "content": "Respawn Entertainments fast-growing battle royale hit Apex Legends is launching its much-anticipated first season tomorrow, the developer announced this morning. The first season, dubbed Wild Frontier, will come with a Fortnite-style battle pass costing $9.50… [+1764 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "DJI’s $39 mic adapter for the Osmo Pocket is here to save your vlog’s audio", "description": "DJI has finally released a 3.5mm microphone adapter for the Osmo Pocket, its handheld vlogging camera that was released back in December. The $39 adapter plugs into the camera’s USB Type-C port.", "url": "https://www.theverge.com/2019/3/18/18271247/dji-osmo-pocket-microphone-mic-adapter-price-features", "urlToImage": "https://cdn.vox-cdn.com/thumbor/cp3loExgVfttYOO4SxdUXKqWSWE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13586711/dji_osmo_pocket_1447.jpg", "publishedAt": "2019-03-18T17:29:44Z", "content": "DJI has finally released a 3.5mm microphone adapter for the Osmo Pocket, its handheld vlogging camera that was released back in December, reports Drone DJI. The $39 adapter plugs into the cameras USB Type-C port, and it will reportedly work with microphones f… [+1362 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Boeing under increased scrutiny as new details surface about approval of crashed jet", "description": "The Department of Transportation’s inspector general is probing the Federal Aviation Administration’s approval of Boeing’s 737 Max 8 aircraft after new reports raised questions about the FAA’s reliance on the aircraft manufacturer during its certification pro…", "url": "https://www.theverge.com/2019/3/18/18270910/boeing-faa-investigation-max-8-mcas-trump", "urlToImage": "https://cdn.vox-cdn.com/thumbor/LdlmfDUF5h8N05anc4c4nDdAG04=/0x459:5209x3186/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969543/1130432213.jpg.jpg", "publishedAt": "2019-03-18T15:54:01Z", "content": "The Department of Transportations inspector general is probing the Federal Aviation Administrations approval of Boeings 737 Max 8 aircraft after new reports raised questions about the FAAs reliance on the aircraft manufacturer during its certification process… [+3512 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Myspace deleted 12 years’ worth of music in a botched server migration", "description": "In an email, Myspace’s data privacy officer has confirmed that “due to a server migration files were corrupted and unable to be transferred over to our updated site.” Any music uploaded between 2003 and 2015 has been lost.", "url": "https://www.theverge.com/2019/3/18/18271023/myspace-music-videos-deleted-2003-2015-server-migration", "urlToImage": "https://cdn.vox-cdn.com/thumbor/49dZc792dzutEdhOYhFhcreJzG4=/0x22:756x418/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8001111/Screen_Shot_2017_02_17_at_8.41.52_AM.png", "publishedAt": "2019-03-18T15:35:01Z", "content": "Were you in a band with a Myspace page between 2003 and 2015? If you were, then any music you uploaded to the social media network is now gone. In an email sent to Redditor u/austinjckson, the companys data privacy officer confirmed that due to a server migra… [+1618 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Ashley Carman", "title": "WhatsApp tests in-app reverse image searches to prevent the spread of hoaxes", "description": "WhatsApp is reportedly testing a beta version of its app that’ll let users reverse Google image search any image that’s sent in the app as well as an in-app browser.", "url": "https://www.theverge.com/2019/3/18/18270890/whatsapp-browser-reverse-image-search-beta", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-byi7DUVw6XyMFNvwyg7YBHi1hE=/0x71:1020x605/fit-in/1200x630/cdn.vox-cdn.com/assets/4047873/WhatsApp1_1020.jpg", "publishedAt": "2019-03-18T15:31:29Z", "content": "The WhatsApp team at Facebook is continuing to build features to help thwart fake news. WABetaInfo reports that a new beta version of WhatsApp includes an in-app web browser and the ability to reverse image search an image thats sent in a chat so that you can… [+1241 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Apple’s new iPads cling to old Apple Pencil", "description": "Apple’s new iPad mini and iPad Air are its newest iPads, but they are not compatible with its newest Apple Pencil. Both feature “Apple Pencil support,” only that’s for the original first-generation Apple Pencil.", "url": "https://www.theverge.com/2019/3/18/18270843/apple-new-ipad-mini-air-old-apple-pencil", "urlToImage": "https://cdn.vox-cdn.com/thumbor/S0i1Mfiea3mZ2bjyCO-t8a4AuB4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969343/apencil.jpg", "publishedAt": "2019-03-18T15:21:45Z", "content": "When a company, in this case, Apple, replaces one simply named product like the Apple Pencil with an identically titled successor, youd usually be forgiven for assuming that the old product is about to be discontinued. Otherwise, advertising things like Apple… [+3373 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tasha Robinson", "title": "How The Dragon Prince’s creators retooled the show’s animation", "description": "Futurama and Avatar: The Last Airbender writer Aaron Ehasz and game developer Justin Richmond discuss the animation in their Netflix show The Dragon Prince, including how the frame rate has changed for season 2, how to achieve realism during a dragon attack s…", "url": "https://www.theverge.com/2019/3/18/18270609/netflix-the-dragon-prince-creators-interview-aaron-ehasz-justin-richmond-season-2", "urlToImage": "https://cdn.vox-cdn.com/thumbor/10sDwNC0G3ZeInjgPE875hc56Sc=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969055/TDP_Rayla_Lujanne.jpg", "publishedAt": "2019-03-18T15:00:00Z", "content": "Netflixs animated series The Dragon Prince, co-created by Avatar: The Last Airbender head writer Aaron Ehasz and Uncharted series game developer and director Justin Richmond, just dropped its second season, and its a powerful step forward for the fantasy seri… [+9689 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "How phones went from $200 to $2,000", "description": "High-end phones from Apple, Samsung, Google, and others can now cost hundreds of dollars more than they did just a couple of years ago. Here’s why, and why it isn’t necessarily a bad thing.", "url": "https://www.theverge.com/2019/3/18/18263584/why-phones-are-so-expensive-price-apple-samsung-google", "urlToImage": "https://cdn.vox-cdn.com/thumbor/qe3gFiz5pwkNusLcrimYJLQcOn0=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15965346/bigpic_money.jpg", "publishedAt": "2019-03-18T14:58:26Z", "content": "Phones are more expensive than ever. Flagship devices from Apple, Samsung, Google, and other top manufacturers can now cost hundreds of dollars more than they did just a couple of years ago. Now, with the arrival of foldable phones, which are being priced at … [+2735 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Colin Lecher", "title": "YouTube took down an ‘unprecedented volume’ of videos after New Zealand shooting", "description": "YouTube dealt with an “unprecedented volume” of videos during the mass shooting in New Zealand, as the platform struggled to remove tens of thousands of videos with the footage, YouTube’s chief product officer told The Washington Post.", "url": "https://www.theverge.com/2019/3/18/18270814/youtube-new-zealand-shooting-videos-moderation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/WIdiE9xrh4PNzvUapQCTS672s48=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10581015/acastro_180403_1777_youtube_0001.jpg", "publishedAt": "2019-03-18T14:18:31Z", "content": "YouTube dealt with an unprecedented volume of videos after last weeks mass shooting in New Zealand, as the platform struggled to remove videos with the footage, YouTubes chief product officer told The Washington Post. \r\nFridays killings at two mosques in Chri… [+1543 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "The majority of Britons don’t know the UK is blocking porn for users under 18 next month", "description": "The UK is introducing its controversial new porn block, which is aimed at stopping users who are under 18 years old from viewing porn online. A new survey from YouGov suggests that the law will come as a surprise to most citizens: 76 percent of those surveyed…", "url": "https://www.theverge.com/2019/3/18/18270763/uk-porn-block-ban-start-date-april-survey-unaware", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Sa8-K9CciNupeARg7YLmFnJ7UTA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10284799/acastro_ageID.jpg", "publishedAt": "2019-03-18T13:25:53Z", "content": "Next month, the UK is scheduled to introduce its so-called porn block, a controversial piece of legislation that aims to block access to online pornography for those under the age of 18. But new research suggests that most UK citizens dont even know the law i… [+2342 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Apple fears how its TV shows might use its products", "description": "Studios are reportedly experiencing a culture clash in their dealings with the Cupertino-based company. Apple is said to be too controlling when it comes to the portrayal of Apple products such as iPhones and MacBooks in the shows, while being uncommunicative…", "url": "https://www.theverge.com/2019/3/18/18270780/apple-streaming-service-iphone-macbook-tv-shows-products", "urlToImage": "https://cdn.vox-cdn.com/thumbor/W4T_cOXSKByy6vwN8c-FcH-1S4A=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477051/acastro_180604_1777_apple_wwdc_0003.jpg", "publishedAt": "2019-03-18T13:11:43Z", "content": "Studios that are working on content for Apples forthcoming streaming service are reportedly experiencing a culture clash in their dealings with the Cupertino-based company, according to The New York Times. Apple is said to be too controlling when it comes to … [+1686 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Apple brings back the iPad Air with new 10.5-inch display and Apple Pencil support", "description": "Apple is launching a new midrange iPad, the new iPad Air. It fits in between the original 9.7-inch iPad and the larger iPad Pro models. Apple’s new iPad Air has a 10.5-inch display and support for the original Apple Pencil and Apple’s Smart Keyboard.", "url": "https://www.theverge.com/2019/3/18/18270785/apple-ipad-air-features-pricing-models-display", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vXJp1seXWj31GIoTcvgT2Dw3ewc=/0x360:2400x1617/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969230/New_iPad_Air_with_Smart_Keyboard_Apple_Pencil_03192019.jpg", "publishedAt": "2019-03-18T13:02:30Z", "content": "Apple is bringing back the iPad Air today with a bigger model. Alongside a new iPad mini, Apple is launching a 10.5-inch version of the iPad Air with support for the original Apple Pencil (not the modern second-generation Apple Pencil). This new model will be… [+1517 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "Apple updates $399 iPad mini with Apple Pencil support", "description": "Using the old Lightning-port Apple Pencil", "url": "https://www.theverge.com/2019/3/18/18270750/ipad-mini-update-pencil-a12-bionic-399", "urlToImage": "https://cdn.vox-cdn.com/thumbor/1nAqZnDapS8TcGCDBtsDbQQHME4=/0x68:1200x696/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969211/D18P6oLVAAAr4jz.jpg", "publishedAt": "2019-03-18T12:39:41Z", "content": "Apple has updated the iPad mini for the first time in three and a half years, refreshing the tablet with a new processor and support for the Pencil stylus. The iPad mini now has last years A12 Bionic processor, instead of the A8 from 2014. Its storage is decr… [+1597 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Henrik Fisker delays his luxury sports car and announces ‘mass-market’ electric SUV", "description": "The new car will start under $40,000 with ‘close to’ 300 miles of range, but the EMotion sports car won’t ship until at least 2021 because the company’s solid state battery tech isn’t ready.", "url": "https://www.theverge.com/2019/3/18/18270350/henrik-fisker-electric-suv-karma-emotion-delayed", "urlToImage": "https://cdn.vox-cdn.com/thumbor/b1J2cfHOjdEuIVuI7LRqsgdgnpw=/0x124:2000x1171/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969111/EVHighRes.jpg", "publishedAt": "2019-03-18T12:00:00Z", "content": "Henrik Fisker, the man behind the ill-fated Tesla-challenging Karma hybrid sports car and current CEO of Fisker Inc., has announced a new electric SUV with close to 300 miles of range that will start below $40,000. The car, which is the second that Fisker Inc… [+4259 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Donald Trump is reportedly no fan of self-driving cars", "description": "US president Donald Trump, a man habituated to being driven everywhere he goes, is reportedly not a fan of self-driving car technology. Citing four sources who’ve seen and heard Trump commenting on autonomous vehicles, Axios says the president’s attitude in p…", "url": "https://www.theverge.com/2019/3/18/18270677/donald-trump-self-driving-cars-attitude-report", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9MYFQI-zF95N2_3WF7oLw-fgQa4=/0x265:3697x2201/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969098/1131227172.jpg.jpg", "publishedAt": "2019-03-18T11:08:51Z", "content": "US president Donald Trump, a man habituated to being driven everywhere he goes, is reportedly not a fan of self-driving car technology. Citing four sources who’ve seen and heard Trump commenting on autonomous vehicles, Axios says the president’s attitude in p… [+1521 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "ZTE’s next phone could slide sideways to reveal its cameras", "description": "Renders claiming to show an unannounced phone from ZTE called the Axon S have appeared online, showing a slider that moves horizontally to conceal its cameras. According to the images the phone’s screen slides sideways to reveal both its front-facing cameras …", "url": "https://www.theverge.com/circuitbreaker/2019/3/18/18270691/zte-axon-s-side-slider-front-rear-cameras-5g-news-features", "urlToImage": "https://cdn.vox-cdn.com/thumbor/FAsIN-r1FDtwHPuYD-vkIb4LtOI=/0x0:1875x982/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969119/zte_axon_s_4.jpg", "publishedAt": "2019-03-18T11:00:25Z", "content": "Renders claiming to show an unannounced phone from ZTE called the Axon S have appeared online, showing a slider that moves horizontally to conceal its cameras. According to the images posted by Notebook Italia, the phones screen slides sideways to reveal both… [+1399 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Arizona State University released a free sci-fi anthology about the future of solar power", "description": "Arizona State University’s Center for Science and the Imagination just released a free anthology of science fiction stories called The Weight of Light: A Collection of Solar Futures, which imagines the future of solar power.", "url": "https://www.theverge.com/2019/3/17/18269838/arizona-state-university-free-sci-fi-anthology-future-of-solar-power", "urlToImage": "https://cdn.vox-cdn.com/thumbor/6XLHiMO82q9zg6bV-30t4ZkGZ70=/0x60:768x462/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15967896/solarfutures_cover_768x1013.png", "publishedAt": "2019-03-17T20:12:19Z", "content": "Over the last couple of years, organizations and companies have begun to look at science fiction in ways that go beyond mere entertainment, with writers and thinkers pointing out that genre stories can be used as a practical tool to imagine optimistic futures… [+1807 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "The Internet Archive is working to preserve public Google+ posts before it shuts down", "description": "Google is set to begin deleting data from its beleaguered social network, Google+ in April, but before that happens, the Internet Archive and the ArchiveTeam say that they are working to preserve public posts on the platform before they vanish forever.", "url": "https://www.theverge.com/2019/3/17/18269707/internet-archive-archiveteam-preserving-public-google-plus-posts", "urlToImage": "https://cdn.vox-cdn.com/thumbor/zecX0cPldoJGxd8xivCIx07sXlA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745895/acastro_180427_1777_0001.jpg", "publishedAt": "2019-03-17T17:49:45Z", "content": "Google is set to begin deleting data from its beleaguered social network, Google+ in April, but before that happens, the Internet Archive and the ArchiveTeam say that they are working to preserve public posts on the platform before they vanish forever. \r\nIn a… [+1568 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "The top ten 2020 Tokyo Olympics pictograms, ranked", "description": "The official pictograms for the 2020 Tokyo Olympics were revealed as Japan marked 500 days until the summer games. Designed by Masaaki Hiromura, the icons were based on the designs from the 1964 Tokyo Olympics, where pictograms first made their debut.", "url": "https://www.theverge.com/2019/3/17/18265555/2020-tokyo-olympics-pictograms-ranked-icons-hiromura", "urlToImage": "https://cdn.vox-cdn.com/thumbor/8AzWorl9AitoT3nfPgJJ35yN6gY=/0x122:1827x1079/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15961596/2019_03_12_pictograms_tokyo_thumbnail.jpg", "publishedAt": "2019-03-17T17:00:00Z", "content": "The official pictograms for the 2020 Tokyo Olympics were revealed this past week as Japan marked 500 days until the summer games. Designed by Masaaki Hiromura, the icons are based on the designs from the 1964 Tokyo Olympics, where pictograms first made their … [+2793 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "YouTube creators are using a hilarious tactic to combat copyright policies", "description": "YouTube creators are performing a capella versions of songs to avoid copyright infringement claims on their videos. It’s a hilarious loophole that calls to attention YouTube’s copyright issues.", "url": "https://www.theverge.com/2019/3/17/18265484/tiktok-youtube-danny-gonzalez-kurtis-conner-react-commentary", "urlToImage": "https://cdn.vox-cdn.com/thumbor/nt9i7EhoqQhWg4sOaCbnCwfz7nQ=/0x15:1592x849/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15962133/Screen_Shot_2019_03_14_at_1.42.18_PM.png", "publishedAt": "2019-03-17T16:00:00Z", "content": "YouTube creators and Twitch streamers have been performing terrible a capella covers of popular songs in hilarious attempts to get around YouTubes widely criticized copyright strike system.\r\nIn recent months, YouTube creators have run into copyright issues wh… [+3153 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Michael Moore", "title": "Golf Peaks turns mini-golf into a card-based puzzle game", "description": "Golf Peaks is a brilliant example of how to use themes because it communicates much of how the game works to the player before they even start playing. In this case, it uses your previously held knowledge of miniature golf. Describing it as a game of miniatur…", "url": "https://www.theverge.com/2019/3/17/18262193/golf-peaks-minigolf-puzzle-game-switch-ios-steam", "urlToImage": "https://cdn.vox-cdn.com/thumbor/FCz9UcmZ1_nFKTEbCAryvWOq7YE=/0x315:3524x2160/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15961363/gp_promoart_1.png", "publishedAt": "2019-03-17T15:00:00Z", "content": "It can be difficult to find time to finish a video game, especially if you only have a few hours a week to play. In our biweekly column Short Play, we suggest video games that can be started and finished in a weekend.\r\nOne thing about abstract puzzle games is… [+3206 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "WhatsApp co-founder urges users to delete their Facebook accounts — again", "description": "WhatsApp co-founder Brian Acton appeared as a speaker at a class at Stanford University earlier this week, where he spoke about the decision to sell the company to Facebook, and urged students to delete their Facebook accounts.", "url": "https://www.theverge.com/2019/3/17/18269515/whatsapp-co-founder-brian-acton-urged-users-to-delete-their-faceboo", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-byi7DUVw6XyMFNvwyg7YBHi1hE=/0x71:1020x605/fit-in/1200x630/cdn.vox-cdn.com/assets/4047873/WhatsApp1_1020.jpg", "publishedAt": "2019-03-17T14:22:39Z", "content": "WhatsApp co-founder Brian Acton appeared as a speaker at a class at Stanford University earlier this week, where he spoke about the decision to sell the company to Facebook, and urged students to delete their Facebook accounts. According to Buzzfeed News, Act… [+941 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Colin Lecher", "title": "Is Huawei a security threat? Seven experts weigh in", "description": "The United States government is cracking down hard on Huawei. Lawmakers and intelligence officials have claimed the telecommunications giant could be exploited by the Chinese government for espionage, presenting a potentially grave national security risk, esp…", "url": "https://www.theverge.com/2019/3/17/18264283/huawei-security-threat-experts-china-spying-5g", "urlToImage": "https://cdn.vox-cdn.com/thumbor/D4mEviu6V_1wrC9G7eVghbqTw6w=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15959548/acastro_190305_3265_huawei_congress_0001.jpg", "publishedAt": "2019-03-17T14:00:00Z", "content": "The Verge convened authorities to hear their opinions The United States government is cracking down hard on Huawei. Lawmakers and intelligence officials have claimed the telecommunications giant could be exploited by the Chinese government for espionage, pres… [+11574 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Facebook says that it removed 1.5 million videos of the New Zealand mass shooting", "description": "In the first 24 hours after the deadly mass shooting in New Zealand, Facebook says that it has removed 1.5 million videos that were uploaded of the attack, and has blocked 1.2 million “at upload.”", "url": "https://www.theverge.com/2019/3/17/18269453/facebook-new-zealand-attack-removed-1-5-million-videos-content-moderation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/KXAhazZGGRE0A7ta_MEox0_A80k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11105269/acastro_180522_facebook_0001.jpg", "publishedAt": "2019-03-17T13:46:06Z", "content": "In the first 24 hours after the deadly mass shooting in New Zealand, Facebook says that it has removed 1.5 million videos that were uploaded of the attack, and has blocked 1.2 million at upload. \r\nThe company made the announcement in a Tweet, following up on … [+2336 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Foldable phones are about to make the US very jealous", "description": "The US is falling behind on phone design, and foldables are the proof. This year’s Mobile World Congress was full of foldables, from Huawei’s sleek Mate X to Xiaomi’s triple-folding model to TCL’s angular DragonHinge design to Oppo’s prototype to the clunky R…", "url": "https://www.theverge.com/circuitbreaker/2019/3/17/18267901/us-foldable-phones-china-import-5g-frustration-problem", "urlToImage": "https://cdn.vox-cdn.com/thumbor/xlDb0GPFGBibK8VpkQQTZk7hFGk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14420460/huawei_matex_mwc19_vsavov21.jpg", "publishedAt": "2019-03-17T13:00:00Z", "content": "The US is falling behind on phone design, and foldables are the proof. This years Mobile World Congress was full of foldables, from Huaweis sleek Mate X to Xiaomis triple-folding model to TCLs angular DragonHinge design to Oppos prototype to the clunky Royale… [+6232 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Spotify vs. Apple: the latest updates", "description": "On Wednesday, March 13th, Spotify filed a complaint with the European Commission over Apple’s business practices, saying that it used unfair tactics to suppress its competitors, something that it has alleged for several years.", "url": "https://www.theverge.com/2019/3/17/18268861/spotify-apple-antitrust-fight-latest-updates-news", "urlToImage": "https://cdn.vox-cdn.com/thumbor/feZJXvWKTxgrNdZ4g9ZPfvj1kv8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10224895/acastro_180213_1777_0002.jpg", "publishedAt": "2019-03-17T12:00:00Z", "content": "On Wednesday, March 13th, Spotify filed a complaint with the European Commission over Apples business practices, saying that it used unfair tactics to suppress its competitors, something that it has alleged for several years. \r\nThe fight between the two compa… [+127 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "The response to the deadly mass shooting in Christchurch, New Zealand", "description": "Following a deadly mass shooting at a pair of mosques in Christchurch, New Zealand, tech companies and platforms have worked to blunt the spread of an attack that seemed as though it was designed to go viral.", "url": "https://www.theverge.com/2019/3/16/18268907/christchurch-new-zealand-mass-shooting-tech-response-updates", "urlToImage": "https://cdn.vox-cdn.com/thumbor/VhHVKlnPHf_kDhdtwh7qnQ7OPgg=/0x68:4064x2196/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15966644/1136229512.jpg.jpg", "publishedAt": "2019-03-16T21:32:17Z", "content": "On Friday, a man released a 73-page racist manifesto and proceeded to kill 50 people in two mosques in Christchurch, New Zealand, video of which he subsequently posted to various social media platforms. \r\nThe attack was designed to go viral, with plenty of re… [+303 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Valve takes down user tributes memorializing the New Zealand shooting suspect", "description": "Valve has removed more than 100 tributes to the alleged shooter behind the deadly attack on Christchurch, New Zealand from Steam profiles, according to a report from Kotaku. In the days after the attack, it found that numerous users updated their profiles to …", "url": "https://www.theverge.com/2019/3/16/18268890/valve-steam-user-tribute-new-zealand-shooter-removed", "urlToImage": "https://cdn.vox-cdn.com/thumbor/B9ZfkJtlkeqL84fWvWnFkUJHeAc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10817765/acastro_180509_1777_steam_0001.jpg", "publishedAt": "2019-03-16T21:23:45Z", "content": "Valve removed more than 100 tributes to the alleged white supremacist responsible for the mass shooting at a mosque in Christchurch, New Zealand from Steam profiles, says Kotaku. In the days after the attack, it found that numerous users updated their profile… [+1086 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Spotify responds to Apple, calling it a ‘monopolist’", "description": "The tit-for-tat war of words between Spotify and Apple continued today, with the former calling the latter a “monopolist,” and that it’s response to the lawsuit was “entirely in line with our expectations.", "url": "https://www.theverge.com/2019/3/16/18268811/spotify-apple-european-commission-antitrust-statement-war-of-words", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mXlC_B6hceRCPuuFJWMbaP5NBuU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10224903/acastro_180213_1777_0006.jpg", "publishedAt": "2019-03-16T19:48:30Z", "content": "The tit-for-tat war of words between Spotify and Apple continued today, with the former calling the latter a monopolist, and that its response to the lawsuit was entirely in line with our expectations, according to Variety. \r\nThe statement is the latest in a … [+1508 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "Apple and Stanford’s Apple Watch study identified irregular heartbeats in over 2,000 patients", "description": "Apple and the Stanford University School of Medicine each issued press releases today citing the results of the Apple Heart Study that they jointly announced in November 2017. Over 2,000 people received notifications about an irregular heart rhythm.", "url": "https://www.theverge.com/2019/3/16/18268559/stanford-apple-heart-study-results-apple-watch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/iF6utnNqB0LQnDng_74-9Y22q14=/0x185:2040x1253/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9693871/akrales_171113_2119_0074.jpg", "publishedAt": "2019-03-16T18:20:09Z", "content": "Apple and the Stanford University School of Medicine each issued press releases today citing the results of the Apple Heart Study that they jointly announced in November 2017. Stanford Medicine also took its findings to the American College of Cardiology’s 68… [+4030 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "7 new trailers you should watch this week", "description": "Watch this week’s best new trailers, including Disney’s first full-length trailer for Aladdin and the final trailer for Avengers: Endgame.", "url": "https://www.theverge.com/2019/3/16/18267023/aladdin-avengers-endgame-booksmart-new-trailers", "urlToImage": "https://cdn.vox-cdn.com/thumbor/JSxX2c9z4LybiGLD5jiHLli8GVo=/272x0:2566x1201/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964045/am.png", "publishedAt": "2019-03-16T16:00:00Z", "content": "I usually dont buy into the whole you have to see it on the big screen hype about certain movies, be it action blockbusters or just gorgeously shot art films. I still tend to see a lot of movies in theaters just because I want to see them, but the theater exp… [+2867 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Neil deGrasse Tyson will return to National Geographic after sexual misconduct allegations", "description": "National Geographic has completed its investigation reports of sexual misconduct by astrophysicist Neil deGrasse Tyson, and will resume plans to air two shows that he is involved with, Star Talk and Cosmos: Possible Worlds.", "url": "https://www.theverge.com/2019/3/16/18268545/neil-degrasse-tyson-national-geographic-sexual-misconduct-allegations-cosmos-star-talk", "urlToImage": "https://cdn.vox-cdn.com/thumbor/rWluoADhr_RfvXqgl_qsNyLp-TI=/0x0:5688x2978/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15966370/1052846680.jpg.jpg", "publishedAt": "2019-03-16T15:45:12Z", "content": "National Geographic has completed its investigation reports of sexual misconduct by astrophysicist Neil deGrasse Tyson, and will resume plans to air two shows that he is involved with, Star Talk and Cosmos: Possible Worlds, reports Entertainment Weekly. \r\nAcc… [+1263 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Save $30 on a Mario game when you buy a Nintendo Switch, and catch up on leftover Pi Day sales", "description": "Today is your last day to save $30 on select Mario games when you purchase a Nintendo Switch console. There are other good deals, mostly leftovers from Pi Day, that are still available, including TCL 4K HDR TVs, Apple Watches, and more.", "url": "https://www.theverge.com/good-deals/2019/3/16/18267619/nintendo-switch-mario-game-deal-discount-sales-pi-day-tcl-4k-hdr-tvs-apple-watch-amazon", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RVSU1P38bxOTQDoHdSLvDOT4zoo=/0x127:2040x1195/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8903613/Nintendo_Switch.jpg", "publishedAt": "2019-03-16T15:00:00Z", "content": "Today is your last day to save $30 on a Mario-themed game when you buy a Nintendo Switch. You can purchase a Nintendo Switch for $299 (its regular price) and get a $30 discount on Super Mario Party, Super Mario Odyssey, Mario Kart 8 Deluxe, Super Mario Bros. … [+2239 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "American Gods will get a third season and a new showrunner", "description": "The second season of American Gods just premiered on Starz this past week, and fans can breath easy: the network has renewed the series for a third season, and has brought on Hemlock Grove and Walking Dead producer Charles Eglee to serve as showrunner.", "url": "https://www.theverge.com/2019/3/16/18268503/american-gods-starz-renewed-third-season-charles-eglee-new-showrunner-neil-gaiman", "urlToImage": "https://cdn.vox-cdn.com/thumbor/IdZHEAO6CZ8rkSEAFEUaklzKAvg=/0x129:1800x1071/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15951777/AGS2_206_Mr_Wednesday__Ian_McShane_.jpg", "publishedAt": "2019-03-16T14:24:45Z", "content": "The second season of American Gods just premiered on Starz this past week, and fans can breath easy: Deadline reports that the network has renewed the series for a third season, and has brought on Hemlock Grove and Walking Dead producer Charles Eglee to serve… [+1435 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Loren Grush", "title": "The first woman to fly commercial to space describes what it’s like to see Earth from 55 miles up", "description": "On February 22nd, Virgin Galactic’s passenger spaceplane VSS Unity took to the skies above the Mojave Desert in California during a test flight, carrying a type of rider it’s never had before. On board the vehicle was Beth Moses, the first passenger the Unity…", "url": "https://www.theverge.com/2019/3/16/18267514/virgin-galactic-beth-moses-chief-astronaut-instructor-vss-unity", "urlToImage": "https://cdn.vox-cdn.com/thumbor/QP7KLDHpAFLnY61hmjk8Ay77wUM=/0x0:2704x1416/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964987/Chief_Astronaut_Instructor_in_Space.jpeg", "publishedAt": "2019-03-16T14:00:00Z", "content": "On February 22nd, Virgin Galactics passenger spaceplane VSS Unity took to the skies above the Mojave Desert in California during a test flight, carrying a type of rider its never had before. On board the vehicle was Beth Moses, the first passenger the Unity h… [+10812 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Everything we think we know about Google’s mystery gaming announcement", "description": "Google is having its first-ever GDC keynote next week, where it’s expected to announce some form of gaming hardware and cloud gaming service designed to stream software to any screen. We don’t have a lot of details, but there’s been quite a few clues hinting …", "url": "https://www.theverge.com/2019/3/16/18268217/google-cloud-gaming-gdc-2019-announcement-event-hardware-news", "urlToImage": "https://cdn.vox-cdn.com/thumbor/8prPqvLDLzqWV7wMDohjR2zgctU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745893/acastro_180427_1777_0003.jpg", "publishedAt": "2019-03-16T13:00:00Z", "content": "Google is making a big play in gaming next week, but we’re still unsure exactly what that entails. For years, the company has toyed with the idea of getting involved in what is now the biggest sector of the entertainment industry, worth an estimated $138 bill… [+12418 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Sky New Zealand yanks Sky Australia after Christchurch footage sparks outrage", "description": "\"We stand in support of our fellow New Zealanders\"", "url": "https://www.theverge.com/2019/3/16/18268213/sky-new-zealand-yanks-sky-australia-after-christchurch-footage-sparks-outrage", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Eic8IddKWv__BYKp-b7i_W1PQ-w=/0x392:5472x3257/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15965929/1136070100.jpg.jpg", "publishedAt": "2019-03-16T04:27:07Z", "content": "When news broke of the mass shooting in Christchurch, New Zealand that left at least 49 dead Thursday evening, I started watching Twitter. Two surprising themes stood out: people urging their social media followers to protect themselves from accidentally watc… [+3114 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "Questions about policing online hate are much bigger than Facebook and YouTube", "description": "The spread of hate material outside big platforms with centralized moderation policies raises questions about how to balance internet freedom with fighting terrorism.", "url": "https://www.theverge.com/2019/3/15/18267638/new-zealand-christchurch-mass-shooting-online-hate-facebook-youtube", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Fx5kh928VBOWgDQODVln_5RGKKI=/0x412:5760x3428/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15965628/1136036756.jpg.jpg", "publishedAt": "2019-03-15T23:43:56Z", "content": "In the wake of a hate-fueled mass shooting in Christchurch, New Zealand, major web platforms have scrambled to take down a 17-minute video of the attack. Sites like YouTube have applied imperfect technical solutions, trying to draw a line between newsworthy a… [+5263 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "This week’s Simpsons focuses on League of Legends", "description": "League of Legends is taking on an unexpected appearance in Sunday’s upcoming episode of The Simpsons. The bizarre crossover will give fans of The Simpsons a look at the world of e-sports and PC gaming, while giving League fans who are lapsed Simpsons viewers …", "url": "https://www.theverge.com/2019/3/15/18267848/simpsons-league-of-legends-episode-this-week", "urlToImage": "https://cdn.vox-cdn.com/thumbor/nORKTkLp9qiuRKCwYmh1Y8p8ZxA=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15965361/TheSimpsons_3009_EMySports_Sc_3052_Avid_Color_Corrected.jpg", "publishedAt": "2019-03-15T22:01:49Z", "content": "League of Legends will be one of the focal points in Sundays episode of The Simpsons. The crossover will give fans of the show a look at the world of e-sports and PC gaming, while giving League fans who are lapsed Simpsons viewers a reason to tune in.\r\nWhalen… [+1462 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Valve says it will investigate Steam review bombing campaigns and hide bad-faith scores", "description": "Valve says it’s taking a new approach to user reviews on its gaming marketplace Steam, after attempting and largely failing to solve the problem of so-called review bombing that taints its consumer recommendation system.", "url": "https://www.theverge.com/2019/3/15/18267821/valve-steam-review-bombing-policy-remove-score-count-moderation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/UjLcQjas-Ltb_kcBiRrfIQEA-vw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10817781/acastro_180509_1777_steam_0002.jpg", "publishedAt": "2019-03-15T21:58:38Z", "content": "Valve says its taking a new approach to user reviews on its gaming marketplace Steam, after attempting and largely failing to solve the problem of so-called review bombing that taints its consumer recommendation system. In a blog post published today, Valve s… [+3365 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Ashley Carman", "title": "Tinder says it no longer uses a ‘desirability’ score to rank people", "description": "Tinder published a blog post today about how its algorithm works and how it’s depreciated its former Elo scores, which ranked people based off attractiveness.", "url": "https://www.theverge.com/2019/3/15/18267772/tinder-elo-score-desirability-algorithm-how-works", "urlToImage": "https://cdn.vox-cdn.com/thumbor/1jzZqJd5Q6jkFhozbksWA8Q93AQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12448949/acastro_180822_1777_tinder_0003.0.jpg", "publishedAt": "2019-03-15T21:30:00Z", "content": "Tinder wants to set the record straight about how its platform ranks and shows people potential matches, so today it published a blog post on the subject but still kept things fairly vague. The companys Elo score was a hot topic a few years ago, according to … [+2967 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "LG’s 2019 OLED TV lineup with AirPlay 2 will hit stores starting in April", "description": "LG has unveiled the pricing and release plans for some of its 2019 OLED TV lineup, basically mirroring the company’s playbook from last year. These are some of the very best TVs you can buy, so LG is continuing to price them as such.", "url": "https://www.theverge.com/2019/3/15/18267498/lg-2019-oled-4k-tv-thinq-pricing-release-date-features", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lat2GqUYJcE0CEpfJo-QVSFV1CY=/0x88:2076x1175/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15965222/Screen_Shot_2019_03_15_at_3.53.12_PM.png", "publishedAt": "2019-03-15T20:49:27Z", "content": "LG has unveiled the pricing and release plans for some of its 2019 OLED TV lineup, basically mirroring the companys playbook from last year. These are some of the very best TVs you can buy, so LG is continuing to price them as such. \r\nThe 2019 C9 (65-inch, 55… [+2011 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Snapchat may launch a gaming platform as early as next month", "description": "Snap may be launching a new gaming platform for Snapchat as early as next month at the company’s Snap Partner Summit in Los Angeles on April 4th.", "url": "https://www.theverge.com/2019/3/15/18267602/snapchat-gaming-platform-rumor-launch-april-developers", "urlToImage": "https://cdn.vox-cdn.com/thumbor/v3PC5d-K6IdLdS5EKMWyOyM8D3o=/0x15:2040x1083/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10411069/akrales_180305_1406_0004.jpg", "publishedAt": "2019-03-15T19:58:24Z", "content": "Snap may be launching a new gaming platform for Snapchat as early as next month at the companys Snap Partner Summit in Los Angeles on April 4th, according to a report from Cheddar. \r\nSnapchat has dabbled in games before the company launched Snappables, a set … [+1761 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "How to turn off autoplay videos on Facebook, Twitter, Reddit, and more", "description": "Autoplay videos are annoying, and sometimes harmful. Though it’s a feature that’s integral to some apps, like Instagram, you can disable it in most services, including Facebook, Twitter, Reddit, and on popular browsers, like Chrome and Firefox.", "url": "https://www.theverge.com/2019/3/15/18267244/how-to-turn-off-autoplay-videos-facebook-twitter-reddit-chrome-firefox", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ubaxELNj6vUqs8uuJwmC4rS9Kvk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11559995/akrales_180614_1777_0080.jpg", "publishedAt": "2019-03-15T19:39:56Z", "content": "Youve probably been caught off guard by videos that play automatically on Facebook, Twitter, and other services; in fact, just across the internet in general. They begin playing as soon as you load a page or (if theyre more deviously implemented) when you sta… [+6836 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Bijan Stephen", "title": "Reddit bans r/watchpeopledie in the wake of the New Zealand mosque massacres", "description": "Reddit has banned r/watchpeopledie, an infamous subreddit that hosted videos of people dying gruesomely. The ban comes after the subreddit re-hosted videos of the recent mosque massacres in New Zealand.", "url": "https://www.theverge.com/2019/3/15/18267645/reddit-watchpeopledie-ban-new-zealand-mosque-massacre-christchurch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/sOy7zM77kTTaprbHREw6kJMJK9k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10646763/acastro_180413_1777_reddit_0002.jpg", "publishedAt": "2019-03-15T19:16:23Z", "content": "Reddit has banned r/watchpeopledie, an infamous subreddit that hosted videos of people dying gruesomely. The ban comes after the subreddit re-hosted videos of the recent mosque massacres in New Zealand. According to the new landing page, the subreddit was ban… [+1496 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Why can’t YouTube automatically catch re-uploads of disturbing footage?", "description": "Questions about how YouTube polices re-uploads of disturbing events, like a terrorist attack in New Zealand that saw nearly 50 people killed, are back in the news.", "url": "https://www.theverge.com/2019/3/15/18267424/new-zealand-shooting-youtube-video-reupload-content-id-livestream", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ZiuCYa_FkQwyQxpmXoeTIeVO8XU=/0x0:5033x2635/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963735/1135900679.jpg.jpg", "publishedAt": "2019-03-15T19:02:32Z", "content": "After a man used Facebook to live stream his attack on two New Zealand mosques last night, the video quickly spread to YouTube. Moderators fought back, trying to take the horrific footage down, but new uploads of the video kept appearing. It led many observer… [+4317 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dani Deahl", "title": "Here’s why Apple is saying Spotify is suing songwriters", "description": "Apple hit back against Spotify ’s EU antitrust complaint in a press release, saying Spotify “wants all the benefits of a free app without being free.” The statement features the expected rebuttals to Spotify’s claims about how Apple uses the App Store to boos…", "url": "https://www.theverge.com/2019/3/15/18267288/apple-music-spotify-suing-songwriters-eu-antitrust", "urlToImage": "https://cdn.vox-cdn.com/thumbor/VYJnqjfDLXq2bANSwqUAdN9fCCc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10432247/mdoying_180308_1437_0030still.jpg", "publishedAt": "2019-03-15T18:51:02Z", "content": "Spoiler: Spotify isn’t suing songwriters Earlier today, Apple hit back against Spotify’s EU antitrust complaint in a press release, saying Spotify “wants all the benefits of a free app without being free.” The statement features the expected rebuttals to Spot… [+6615 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "James Gunn is reportedly back on to direct Guardians of the Galaxy 3", "description": "Despite being fired last year over a series of offensive tweets dug up by far-right provocateur Mike Cernovich, James Gunn is reportedly set to direct Guardians of the Galaxy 3, according to Deadline.", "url": "https://www.theverge.com/2019/3/15/18267551/james-gunn-direct-guardians-of-the-galaxy-3-disney-marvel", "urlToImage": "https://cdn.vox-cdn.com/thumbor/C6eSI2OAwLxIxGcIC0qU-BokzRQ=/0x263:3437x2062/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964781/983983346.jpg.jpg", "publishedAt": "2019-03-15T18:12:08Z", "content": "Disney has reportedly rehired James Gunn to direct Guardians of the Galaxy 3, according to Deadline, despite Gunns firing last year over a series of offensive tweets dug up by far-right provocateur Mike Cernovich. \r\nDeadline has reportedly confirmed it with M… [+3093 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Loren Grush", "title": "Watch ULA launch one of the last single-core Delta IV rockets this evening", "description": "To round out the end of the work week, the United Launch Alliance plans to launch a military satellite out of Florida, marking the second flight of the year for the company. ULA’s Delta IV rocket will be lofting a communications satellite called Wideband Glob…", "url": "https://www.theverge.com/2019/3/15/18267388/ula-delta-iv-medium-rocket-launch-air-force-wideband-global-satcom-10", "urlToImage": "https://cdn.vox-cdn.com/thumbor/0r40Q9p51kkhIfb72uL0tgH8XYQ=/0x254:3600x2139/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964706/40012249495_d61d7540ea_o.jpg", "publishedAt": "2019-03-15T18:08:21Z", "content": "To round out the end of the work week, the United Launch Alliance plans to launch a military satellite out of Florida this evening, marking the second flight of the year for the company. ULA’s Delta IV rocket will be lofting a communications satellite called … [+507 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Netflix finally agrees to remove real-life train derailment footage from Bird Box", "description": "Netflix has finally decided that its original horror movie Bird Box doesn’t need to contain footage of the real-life train disaster that killed 47 people in Lac-Mégantic, Canada in 2013. Originally, in the face of protests from the Canadian town and online su…", "url": "https://www.theverge.com/2019/3/15/18267427/netflix-remove-bird-box-train-derailment-lac-megantic-canada", "urlToImage": "https://cdn.vox-cdn.com/thumbor/MpyZMlvgg42JlmlLr1meqDhjkjQ=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964598/bird_box_netflix_2040.jpg", "publishedAt": "2019-03-15T18:04:13Z", "content": "Netflix has finally decided that its original horror movie Bird Box doesn’t need to contain footage of the real-life train disaster that killed 47 people in Lac-Mégantic, Canada in 2013. Originally, in the face of protests from the Canadian town and online su… [+1712 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Rachel Becker", "title": "Students ‘strike for climate’ across the United States", "description": "Students around the country are skipping class today to demand that the adults running the government start fighting back against climate change. The strikers join a worldwide movement of young activists who are fighting for a future on a habitable Earth.", "url": "https://www.theverge.com/2019/3/15/18266559/students-strike-for-climate-across-the-united-states", "urlToImage": "https://cdn.vox-cdn.com/thumbor/oMSuYj5IHny5luud4UsyT2cIDzw=/0x185:2040x1253/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964388/akrales_190315_3252_0256.jpg", "publishedAt": "2019-03-15T18:00:56Z", "content": "Students across the country walked out of school and into the streets today to demand that the adults running the government start fighting back against climate change. The strikers joined a worldwide movement of young activists who are fighting for a future … [+4446 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "11 new science fiction and fantasy books to check out for the rest of March", "description": "The later half of March brings a military science fiction novel from Kameron Hurley, the latest installment of The Expanse from James S.A. Corey, as well as nine other science fiction and fantasy novels.", "url": "https://www.theverge.com/2019/3/15/18214204/science-fiction-fantasy-recommendations-books-late-march-2019-james-sa-corey-expanse-doctorow-hurley", "urlToImage": "https://cdn.vox-cdn.com/thumbor/m3uny_y1ZlX6Fw-tUUBL0QJeOtM=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15962129/aliptak_190314_3261_8281.jpg", "publishedAt": "2019-03-15T17:45:07Z", "content": "In the last book list, I mentioned that I was reading The Hobbit to my son. While I was reading that, I was personally reading another Tolkien-related book: Anything You Can Imagine: Peter Jackson and the Making of Middle-earth by film journalist Ian Nathan. … [+9160 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Walmart is planning to launch its own low-cost Android tablet", "description": "Walmart is planning to release an inexpensive tablet under its in-house ONN brand, a spokesperson has confirmed. The report claims the device will be manufactured by a Chinese supplier and will run on Android.", "url": "https://www.theverge.com/2019/3/15/18267494/walmart-android-tablet-budget-features", "urlToImage": "https://cdn.vox-cdn.com/thumbor/HI2w57F21XaxE9KE5uFYeoorl74=/0x114:1000x638/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14525947/Walmart_Store.1419980088.jpg", "publishedAt": "2019-03-15T17:43:58Z", "content": "Walmart is planning to release an inexpensive tablet under its in-house ONN brand, a spokesperson for the company has confirmed to Bloomberg. The report claims the device will be manufactured by a Chinese supplier, run on Android, and its expected to be aimed… [+1338 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Deadly Boeing crashes raise questions about airplane automation", "description": "Two Boeing 737 Max 8 jets, a variant of the world’s most popular jetliner, crashed within six months of each other. It’s a stunning rate of failure that raises questions about the airplane’s automated systems. Preliminary data from the first crash, Lion Air F…", "url": "https://www.theverge.com/2019/3/15/18267365/boeing-737-max-8-crash-autopilot-automation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/jjBEYrTx1upMH9T2o50LiGuQdnQ=/0x72:1000x596/fit-in/1200x630/cdn.vox-cdn.com/assets/943006/Aircraft_cockpit_1000_SS.jpg", "publishedAt": "2019-03-15T17:40:55Z", "content": "Two Boeing 737 Max 8 jets, a variant of the worlds most popular jetliner, crashed within six months of each other in a stunning rate of failure that raises questions about the airplanes automated systems. \r\nPreliminary data from the first crash, Lion Air Flig… [+8538 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Colin Lecher", "title": "The FCC is planning new rules for tracking indoor 911 calls", "description": "In a proposal approved today, the Federal Communications Commission moved to require wireless carriers to more accurately track 911 calls indoors.", "url": "https://www.theverge.com/2019/3/15/18267428/fcc-911-indoor-phone-tracking-rules", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2piF0wKpFkuD6sxLTdKCR-8hrHE=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8833829/acastro_170619_1777_FCCserver2.jpg", "publishedAt": "2019-03-15T17:30:21Z", "content": "In a proposal approved for consideration today, the Federal Communications Commission said it will move to require wireless carriers to more accurately track 911 calls indoors. \r\nFor years, the FCC has been considering how best to require companies to track c… [+1385 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Huawei’s MateBook X Pro, one of the best laptops around, is up to $200 off", "description": "The Huawei MateBook X Pro is one of the best laptops that you can buy, and the Microsoft Store is taking up to $200 off of the 2018 model. It’s available in multiple configurations, and you can find it for as low as $1,049.", "url": "https://www.theverge.com/good-deals/2019/3/15/18267390/huawei-matebook-x-pro-2018-microsoft-store-sale-discount-deal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/g-H-scOUo0JdV-iElnnxAloOqc0=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11419045/jbareham_180524_2590_0079.jpg", "publishedAt": "2019-03-15T17:26:30Z", "content": "Only the best deals on Verge-approved gadgets get the Good Deals stamp of approval, so if you're looking for a deal on your next gadget or gift from major retailers like Amazon, Walmart, Best Buy, Target, and more, this is the place to be.\r\nThe Huawei MateBoo… [+1445 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "Beto O’Rourke was a member of the US’s oldest hacking group", "description": "It’s unclear what kind of hacking behavior O’Rourke engaged in with the “Cult of the Dead Cow” (CDC) hacktivist group throughout the ‘90s, which was named after an abandoned slaughterhouse in Texas. But CDC became influential for breaking into Microsoft Windo…", "url": "https://www.theverge.com/2019/3/15/18267413/beto-orourke-hacker-cult-dead-cow-cdc-president-run", "urlToImage": "https://cdn.vox-cdn.com/thumbor/MdIwrubCSppkmLy9_tH39BuqdjQ=/0x224:3105x1850/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964562/1127638345.jpg.jpg", "publishedAt": "2019-03-15T17:25:17Z", "content": "Beto ORourke used to be part of the United States oldest hacking group, something he and former members kept under wraps until now, the former representative from El Paso, Texas said in an interview with Reuters. ORourke announced his bid for the presidency y… [+2005 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Facebook adds dedicated gaming tab to its mobile app", "description": "Facebook is updating its mobile app with a dedicated gaming hub where users can explore game content on Facebook. To emphasize the importance that Facebook is putting on the hub, the company is adding it to the sidebar and as an option for the customizable na…", "url": "https://www.theverge.com/2019/3/15/18267254/facebook-app-gaming-tab-mobile", "urlToImage": "https://cdn.vox-cdn.com/thumbor/WZcOIkWkdjegOLmwOzQq-r0Uwm8=/0x86:1200x714/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964536/facebook.png", "publishedAt": "2019-03-15T17:10:06Z", "content": "Facebook is updating its mobile app with a dedicated gaming hub where users can explore game content on Facebook. To emphasize the importance that Facebook is putting on the hub, the company is adding it to the sidebar and as an option for the customizable na… [+813 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Verge Staff", "title": "A field guide to the wacky future of folding phones", "description": "What should we call these folding phones? Back before every phone was effectively a phablet, we had all sorts of categories: flip phones, candy bars, sliders, swivels, the original brick phones, and, of course, the infamous taco. Here are some ideas for the n…", "url": "https://www.theverge.com/2019/3/15/18266637/folding-phones-bendable-screens-names-illustrated-guide", "urlToImage": "https://cdn.vox-cdn.com/thumbor/aG5N1LNUm97tAhdAg5zYYKJOyyo=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963297/3276_Master_Nicknames_All.png", "publishedAt": "2019-03-15T16:44:50Z", "content": "Remember when people used to joke that every new phone was the same rounded rectangle? Those days are officially gone. Now, handset manufacturers are falling over themselves to one-up each other with designs that go entirely off the rails because you can buil… [+4334 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Loren Grush", "title": "NASA making its Moon mission commercial could signal a paradigm shift for deep-space travel", "description": "NASA is now mulling over the idea of using commercial rockets to launch a critical mission around the Moon next year instead of using the massive rocket that the agency has been building for the last decade. Such a drastic change would not only upend flight p…", "url": "https://www.theverge.com/2019/3/15/18265417/nasa-space-launch-system-orion-em-1-commercial-space-tugs-docking-assembly", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Zz0VtLCLXO938Zt-xtx37kiDJnU=/0x0:4267x2234/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964187/22760892219_24a07d81ab_o.jpg", "publishedAt": "2019-03-15T15:45:15Z", "content": "NASA is now mulling over the idea of using commercial rockets to launch a critical mission around the Moon next year instead of using the massive rocket that the agency has been building for the last decade. Such a drastic change would not only upend flight p… [+10359 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Noel Murray", "title": "For the original take on love, death, and robots, stream Robot Carnival for free online", "description": "David Fincher and Tim Miller’s new anime anthology Love, Death + Robots comes to Netflix today, with a lot of gruesome violence and frank nudity. For a quieter, more emotional take on love, death, and robots — also in the form of an animated anthology — strea…", "url": "https://www.theverge.com/2019/3/15/18267223/robot-carnival-streaming-recommendation-what-to-watch-anime-shorts-anthology", "urlToImage": "https://cdn.vox-cdn.com/thumbor/K9SXJNIVeZi97x-wxQ50KIOhARk=/0x20:2870x1523/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964225/Screen_Shot_2019_03_15_at_8.48.06_AM.png", "publishedAt": "2019-03-15T15:31:26Z", "content": "There are so many streaming options available these days, and so many conflicting recommendations, that its hard to see through all the crap you could be watching. Each Friday, The Verges Cut the Crap column simplifies the choice by sorting through the overwh… [+4839 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "PlayStation Plus one-year subscription is 25 percent off, and some Pi Day deals are still happening", "description": "Several Pi Day deals are still happening, including discounts on TCL’s 6-series 4K HDR TV and Acer’s G-Sync gaming monitors. PlayStation Plus memberships are cheaper as well, so it’s a good idea to renew today.", "url": "https://www.theverge.com/good-deals/2019/3/15/18267145/playstation-plus-1-year-subscription-ps4-sale-discount-pi-day-deals", "urlToImage": "https://cdn.vox-cdn.com/thumbor/NRTux_3mXRFlSsv_OMGAc7FUnfM=/0x0:1024x536/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14659208/img_5042.0.1408497468.jpg", "publishedAt": "2019-03-15T15:18:40Z", "content": "Only the best deals on Verge-approved gadgets get the Good Deals stamp of approval, so if you're looking for a deal on your next gadget or gift from major retailers like Amazon, Walmart, Best Buy, Target, and more, this is the place to be.\r\nToday is a good da… [+1866 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Electric scooter charging is a cutthroat business, and Lime wants to fix that", "description": "Lime is testing a new feature that allows its workforce of “juicers” to reserve a scooter before scooping it up for charging. In this way, juicers can claim a scooter before arriving at its location. Previously, collecting scooters for charging (which Lime ca…", "url": "https://www.theverge.com/2019/3/15/18267128/lime-electric-scooter-charging-juicers-harvesting-business", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9LnINftKmqPZfBOrtM699YHp-Bo=/0x227:3820x2227/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964084/994976598.jpg.jpg", "publishedAt": "2019-03-15T15:15:11Z", "content": "Charging the batteries of shareable electric scooters overnight — the latest entry in our metastasizing gig economy — can be a bit of a thankless task. The pay is minimal, the scooters can be hard to find, and freelancers often complain about unsafe condition… [+2137 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "New Huawei P30 Pro spec leak reveals the secrets of the 10x zoom camera", "description": "We’re still a few days away from Huawei’s official announcement of its new P30 Pro and P30 flagships, but the steady trickle of leaks regarding the phones has quickly turned into a flood. WinFuture has revealed the full specs for both devices, including how t…", "url": "https://www.theverge.com/circuitbreaker/2019/3/15/18267052/huawei-p30-pro-spec-leak-10x-zoom-images-kirin-processor", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Rwjc2RUEgZVfuzecvuy57_KDyvk=/0x86:1200x714/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964206/p30pro.png", "publishedAt": "2019-03-15T15:07:56Z", "content": "Were still a few days away from Huaweis official announcement of its new P30 Pro and P30 flagships, but the steady trickle of leaks regarding the phones has quickly turned into a flood. WinFuture has revealed the full specs for both devices, along with offici… [+2702 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "These sleek animations highlight the relationship between designers and clients", "description": "Motion graphics artist Deekay Kwon’s animated series highlights the relationship between designers and clients. Kwon says the series is inspired by not just one single client, but his experience working with all of his clients so far.", "url": "https://www.theverge.com/2019/3/15/18233884/deekay-kwon-designer-motion-graphics-animation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/zGnUwFVZuPVOu8mBq4la96sxMFA=/0x57:500x319/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14157843/Designer_and_Client__dribbble_.jpg", "publishedAt": "2019-03-15T14:33:03Z", "content": "Deekay Kwon is a motion graphics artist whos worked with clients like Google, Buck, and Huge. You might have seen his animations at the Made By Google keynote that introduced the Pixel, or on his Instagram, where his recent Designer &amp; Client series hit de… [+4638 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Marino", "title": "Vergecast: Galaxy S10E review and Spotify vs. Apple", "description": "The Verge’s Nilay Patel, Dieter Bohn, Natt Garun, and Paul Miller discuss the changes in the new Android Q beta as well as Natt’s review of the Samsung Galaxy S10E. How does it compare to the rest of the S10s?", "url": "https://www.theverge.com/2019/3/15/18267120/vergecast-podcast-345-galaxy-s10e-review-spotify-apple-tax", "urlToImage": "https://cdn.vox-cdn.com/thumbor/zkoc97bhej6Xp_TT7p-azAHu6lw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15957527/akrales_190311_3263_0274.jpg", "publishedAt": "2019-03-15T14:32:21Z", "content": "Google has released the first beta of Android Q, and Natt Garun has The Verge ’s first look. Natt joins Nilay Patel, Dieter Bohn, and Paul Miller on this week’s Vergecast to discuss it. Natt also reviewed Samsung’s Galaxy S10E, the smallest of the company’s r… [+1316 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Stefan Etienne", "title": "Sony’s latest mirrorless camera shows the limits of an aging platform", "description": "The a6400 is a good camera thwarted by messy menus", "url": "https://www.theverge.com/2019/3/15/18266143/sony-a6400-review-mirrorless-compact-vlogging-camera", "urlToImage": "https://cdn.vox-cdn.com/thumbor/KVGSZwOWW2J-5Sv2PxtHZTQ02iA=/0x243:2040x1311/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14541706/akrales_190221_3225_0314.jpg", "publishedAt": "2019-03-15T14:00:00Z", "content": "If you had to solve a CAPTCHA challenge every time you opened an app on your phone, would you still use that app? Thats how Ive felt using Sonys new a6400, where wading through pages of settings and submenus to change vital settings makes an otherwise solid m… [+10260 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Japan unveils robot assistants for 2020 Olympics", "description": "For the Tokyo Olympics in 2020, Japan is recruiting some unusual volunteers: robots made by Toyota will be deployed at different venues to help assist people in wheelchairs and carry around food and drinks. Exoskeletons made by Panasonic will be used by worke…", "url": "https://www.theverge.com/2019/3/15/18267055/tokyo-2020-olympics-robot-assistants-toyota-panasonic-exoskeleton", "urlToImage": "https://cdn.vox-cdn.com/thumbor/3HrZ_ErZoK0qcSUiN2TERsM-KgY=/0x74:1024x610/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15964070/GettyImages_1130615815.jpg", "publishedAt": "2019-03-15T13:52:48Z", "content": "When the Olympics came to London in 2012, the organizers relied on a legion of unpaid volunteers to herd the crowds and help them find their way. But when the games come to Tokyo in 2020, itll be robots taking on some of those same duties.\r\nToday, the organiz… [+2394 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Dark mode has taken over: the latest developments on this battery-saving feature", "description": "As dark mode makes its way to more apps, operating systems, gaming platforms, and more, we’ll be tracking each development.", "url": "https://www.theverge.com/2019/3/15/18261967/dark-mode-battery-saving-feature-apps-os-platforms-developments", "urlToImage": "https://cdn.vox-cdn.com/thumbor/fvrAylOhD5AOJNsscFAHOAMG4fE=/0x144:2040x1212/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15959699/akrales_190313_3291_0038.jpg", "publishedAt": "2019-03-15T13:38:31Z", "content": "Theres a lot of hype surrounding dark mode, a simple toggle that lets you change the background color of an app window to black. Some enjoy it simply for aesthetic reasons and because it allows for a slightly customized look compared to the default design. Ot… [+834 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Thomas Ricker", "title": "Ikea’s ‘affordable’ Sonos-powered speakers to be revealed on April 9th", "description": "Ikea has set the date to show off its first Sonos-powered Symfonisk speakers. The “products” will be revealed on April 9th in Milan, before they’re expected to go on sale in August.", "url": "https://www.theverge.com/2019/3/15/18266992/ikea-symfonisk-sonos-speaker-date-announcement", "urlToImage": "https://cdn.vox-cdn.com/thumbor/raZ1t43J4IqFjsdBgCYSVHrCXb0=/0x66:920x548/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13700492/IMG_9551.1528368212.jpg", "publishedAt": "2019-03-15T13:02:59Z", "content": "You’ve seen the prototypes, but now Ikea has set the date to show off its first Sonos-powered Symfonisk speakers. The “products” (plural) will be revealed on April 9th in Milan, before they’re expected to go on sale in August. “Ikea and Sonos have showed a pr… [+1071 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "No Man’s Sky Online announced, coming as a free update this summer", "description": "Hello Games has announced No Man’s Sky: Beyond, the next free update for its space exploration game. The update will consist of three components, but only one has been announced today: No Man’s Sky Online.", "url": "https://www.theverge.com/2019/3/15/18267025/no-mans-sky-beyond-online-release-date-news-features-price-free", "urlToImage": "https://cdn.vox-cdn.com/thumbor/r2X30BB9KbFmmTBO7TFVb4JErD8=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963936/BeyondLogo.png", "publishedAt": "2019-03-15T13:00:00Z", "content": "Hello Games has announced No Mans Sky: Beyond, the next free update for its procedurally generated space exploration game. The update will consist of three components, but only one has been announced today: No Mans Sky Online. Hello Games has offered almost n… [+1488 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Samsung’s refreshed Notebook 9 Pro launches on March 17th, starting at $1,100", "description": "At CES 2019, Samsung announced the latest versions of the Notebook 9 lineup of laptops: the Notebook 9 Pro and the Notebook 9 Pen. The company revealed that the two computers will be available starting on March 17th.", "url": "https://www.theverge.com/circuitbreaker/2019/3/15/18266227/samsung-notebook-9-pro-pen-price-release-date-laptop", "urlToImage": "https://cdn.vox-cdn.com/thumbor/V-TzOdU7htrcRf7UQ5gss6U1I8c=/0x97:2040x1165/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13674246/DSC02071.jpg", "publishedAt": "2019-03-15T13:00:00Z", "content": "At CES 2019, Samsung announced the latest versions of the Notebook 9 lineup of laptops: the Notebook 9 Pro and the Notebook 9 Pen. Today, the company revealed that the two computers will be available starting on March 17th.\r\nThe Notebook 9 Pro is the more rad… [+1122 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dan Seifert", "title": "Samsung Notebook 9 Pro review: boring is better than bad", "description": "Samsung’s latest laptop fixes many of the issues of older models, but does it with zero flair", "url": "https://www.theverge.com/2019/3/15/18266066/samsung-notebook-9-pro-laptop-review-spec-price-features", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RLG5TKlRw_JM_arG7yZjctrPCUE=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15958955/jbareham_190312_3286_0055.jpg", "publishedAt": "2019-03-15T13:00:00Z", "content": "What do you do if youre a computer manufacturer and the past few laptops youve released have been panned for cheap-looking designs and shoddy build quality? If youre Samsung, you do research. A lot of it.\r\nThats what the company claims it did for the new Note… [+7318 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Facebook promises new AI tool will proactively detect revenge porn", "description": "Facebook is launching a new AI tool that can proactively find images and videos posted without the subjects’ consent. The tool looks for “near-nude” imagery and flags it to human moderators.", "url": "https://www.theverge.com/2019/3/15/18266974/facebook-instagram-revenge-porn-ai-filter", "urlToImage": "https://cdn.vox-cdn.com/thumbor/0lyH5o6CS-1RwU5RSa0ro7sI0H4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948785/acastro_180720_1777_facebook_0001.jpg", "publishedAt": "2019-03-15T12:48:25Z", "content": "Facebook is launching a new AI tool today that it says can proactively detect and flag intimate images and videos of someone posted without their consent. The system will be active on Facebook and Instagram, and, unlike current filters, it can detect near-nud… [+2633 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Microsoft is doubling Skype group video chats to 50 participants", "description": "Microsoft is making it easier for small businesses to manage bigger groups for video calls on Skype. The service will now allow 50 people to chat in a video call, which is double the previous 25 participant limit.", "url": "https://www.theverge.com/2019/3/15/18266998/microsoft-skype-group-video-calls-50-participants", "urlToImage": "https://cdn.vox-cdn.com/thumbor/DYs8ZoPuSTTj10dwSe9M2HU2FqM=/0x142:1980x1179/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963898/skypevideocalls.jpg", "publishedAt": "2019-03-15T12:26:18Z", "content": "Microsoft is planning to double the number of people that can participate in a Skype group video call. The software maker is testing a new change to Skype that will raise the limit from 25 people all the way up to 50 participants. It’s a change that will like… [+551 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Elizabeth Lopatto", "title": "Elon Musk’s last two weeks have been a wild ride", "description": "Businesspeople usually like to imagine themselves as Stable Pillars of the Community Who Deserve Public Trust, Please Do Not Look Closely At Their Business Thanks. By comparison, Musk seems to consider himself a trickster figure, Bugs Bunnying his way through…", "url": "https://www.theverge.com/2019/3/15/18266841/elon-musks-tesla-spacex-model-y-sec-boring-company-tilt", "urlToImage": "https://cdn.vox-cdn.com/thumbor/I69QGl87kZlr4lvTjC9KNJyW3Fk=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963546/tesla_model_y_3374.jpg", "publishedAt": "2019-03-15T12:00:00Z", "content": "This Week in Elon\r\nThis Week in Elon was a limited-run newsletter that is occasionally revived when theres Too Much News. You can subscribe here.\r\nI said Id be back if Elon Musk Elonned again, and here we are. The last two weeks alone have included:\r\nSpaceXs … [+11041 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "My brief but familiar ride in Tesla’s brand new Model Y", "description": "The company’s new compact SUV is quick and sleek, and it’s also very similar to the Model 3. And the $47,000 electric car won’t hit the road until late 2020.", "url": "https://www.theverge.com/transportation/2019/3/15/18266881/tesla-model-y-suv-interior-controls-first-drive-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/H4YB2AzOfzm1n5kMFwW9bhZe-_4=/0x185:2040x1253/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963763/tesla_model_y_3597.jpg", "publishedAt": "2019-03-15T11:31:45Z", "content": "The first thing that struck me about Teslas new Model Y when it was unveiled on stage in Los Angeles Thursday night was how much it looks like the Model 3. A few minutes later when I got inside it for a quick ride, the similarities were undeniable. \r\nAs we zi… [+4686 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Google adds translations to its iOS keyboard", "description": "Google’s third-party iOS keyboard, Gboard, now supports Google Translate. The feature can be accessed either by tapping on the Google Translate icon in the suggestion bar, or via the Google button.", "url": "https://www.theverge.com/2019/3/15/18266947/google-translate-gboard-ios-keyboard-third-party", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RN5xT-jLz641NO8NmZTA6SpZAks=/0x157:4032x2268/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963836/IMG_20190315_110537.jpg", "publishedAt": "2019-03-15T11:21:21Z", "content": "Googles third-party iOS keyboard, Gboard, now supports Google Translate. The feature has been available in the Android version of the keyboard since 2017, and can be accessed either by tapping on the Google Translate icon in the suggestion bar, or via the Goo… [+598 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Robot valets are now parking cars in one of France’s busiest airports", "description": "French startup Stanley Robotics has started its first full time operation at France’s Lyon-Saint-Exupéry airport. The company’s robots pick up cars from specially-designed hangars and park them 50 percent more efficiently than humans.", "url": "https://www.theverge.com/2019/3/15/18200292/robot-valet-parking-airport-stanley-robotics-france-lyon", "urlToImage": "https://cdn.vox-cdn.com/thumbor/_eScD3w-HqCgC6X0hR1QivtG1u4=/0x519:7243x4311/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963817/04_SR__Fred_Margueron_2018.jpg", "publishedAt": "2019-03-15T11:14:17Z", "content": "Next time you head to the airport in France there might be a robot waiting to pick up your car. French firm Stanley Robotics has been trialling its self-driving robot valets for a few years, and this week started its first full-time service at France’s Lyon-S… [+500 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Casey Newton", "title": "Facebook’s News Feed era is now officially over", "description": "Chris Cox, a top lieutenant to CEO Mark Zuckerberg quit Facebook on Thursday. Here’s what it means for the company", "url": "https://www.theverge.com/2019/3/15/18266488/chris-cox-quits-facebook-news-feed-privacy-pivot", "urlToImage": "https://cdn.vox-cdn.com/thumbor/kyeGPXtDJOM7JRiMCkb7sMmKyck=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/4180272/DSC00956.0.jpg", "publishedAt": "2019-03-15T10:00:00Z", "content": "Last May, after a decade of uncommon stability in his executive ranks, Mark Zuckerberg announced a series of dramatic changes. He moved two top executives to create a new blockchain division, and installed new leaders at WhatsApp and the News Feed. (He also a… [+7768 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Everyone’s favorite farming game is now on Android", "description": "Stardew Valley, the laid back farming RPG that was originally released for Windows PCs back in 2016, is now available on Android. Until now, the game’s mobile version has been exclusive to iOS.", "url": "https://www.theverge.com/2019/3/15/18266920/stardew-valley-android-release-date-price-features-save-import", "urlToImage": "https://cdn.vox-cdn.com/thumbor/jjcXXfpDWoTLl3o1oZMI4EEisHM=/0x0:1243x651/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963785/ezgif_2_ce84931785ee.jpg", "publishedAt": "2019-03-15T09:51:32Z", "content": "Stardew Valley, the laid back farming RPG that was originally released for Windows PCs back in 2016, is now available on Android. Until now, the games mobile version has been exclusive to iOS, after coming to iPhone and iPad last October. For those keeping tr… [+1116 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sam Byford", "title": "Apple hits back against Spotify’s App Store ‘tax’ complaint", "description": "Apple has issued a press release hitting back at Spotify’s PR blitz against the company. Spotify has filed a complaint in Europe against what it describes as anti-competitive policies, including the App Store’s “Apple tax.”", "url": "https://www.theverge.com/2019/3/15/18266892/apple-spotify-addressing-claims-press-release", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Q_SUaKWAUZovetxN7cbhqqhxtno=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13959729/acastro_190218_1777_apple_streaming_0001.jpg", "publishedAt": "2019-03-15T09:24:41Z", "content": "Apple has fired back against Spotify in an unusual press release that argues the music streaming service wants all the benefits of a free app without being free. Spotify filed an antitrust complaint against Apple in Europe earlier this week, with CEO Daniel E… [+2916 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Elizabeth Lopatto", "title": "The mass shooting in New Zealand was designed to spread on social media", "description": "“Remember, lads, subscribe to Pewdiepie,” says the shooter as he prepares to terrorize two mosques in New Zealand, murdering dozens. A mass shooting designed to spread on social media.", "url": "https://www.theverge.com/2019/3/15/18266859/new-zealand-shooting-video-social-media-manipulation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vsqsQKpOwkU4UcWtSj7KuUI8aZo=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10158491/acastro_180202_1777_0003.jpg", "publishedAt": "2019-03-15T08:20:26Z", "content": "The horrific shooting at two mosques in Christchurch, New Zealand was designed from the start to get attention — leveraging social media to make sure as many people as possible would hear about the deaths and the hate underpinning them. Officials have reporte… [+5636 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Watch this supercut of Elon Musk unveiling Tesla’s new Model Y", "description": "Elon Musk took the stage at the Tesla Design Studio outside Los Angeles on Thursday evening to unveil the company’s fifth production car: a compact SUV called the Model Y. Here’s a supercut of the event.", "url": "https://www.theverge.com/2019/3/15/18264464/tesla-model-y-suv-announcement-elon-musk-video", "urlToImage": "https://cdn.vox-cdn.com/thumbor/WJL_BcW91kbmhMYQV5MOuJ97EgI=/1336x1101:7572x4366/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963516/Model_Y_Front_34_Blue.jpg", "publishedAt": "2019-03-15T04:37:26Z", "content": "Elon Musk took the stage at the Tesla Design Studio outside Los Angeles on Thursday evening to unveil the company’s fifth production car: a compact SUV called the Model Y. Musk padded the event with a walk down memory lane, spending over 40 minutes highlighti… [+458 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Tesla Model Y preorders are now live", "description": "Tesla is now taking preorders on its website for its newly unveiled Model Y, an all-electric crossover SUV and the company’s fifth electric car. You can preorder all versions of the Model Y except the standard range, which won’t be available until 2021.", "url": "https://www.theverge.com/2019/3/15/18266750/tesla-model-y-suv-preorders-live-how-to", "urlToImage": "https://cdn.vox-cdn.com/thumbor/n4nUAqR3kroAwoSfJm9DF2D0etc=/430x964:4693x3196/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963545/Model_Y_Rear_34_Red.jpg", "publishedAt": "2019-03-15T04:35:31Z", "content": "Tesla is now taking preorders on its website for its newly unveiled Model Y, an all-electric crossover SUV and the companys fifth electric car. The company unveiled the Model Y at an event outside Los Angeles Thursday evening. \r\nThe long range Model Y will co… [+1020 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Tesla Model Y announced: release set for 2020, price starts at $39,000", "description": "This is the Tesla Model Y, the electric carmaker’s new compact SUV due out in 2020. It has a range of 300 miles, seating for seven, is capable of sprinting from 0 to 60 mph in 3.5 seconds. It’s Elon Musk’s fifth car ever to hit the road, and the company’s sec…", "url": "https://www.theverge.com/2019/3/14/18264446/tesla-model-y-suv-compact-announcement-price-release-date-features-elon-musk", "urlToImage": "https://cdn.vox-cdn.com/thumbor/OUuqWFws20pGCknbeEFfn_4cyKI=/0x48:1877x1031/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963464/tesla_model_y_screen_1.jpg", "publishedAt": "2019-03-15T03:55:23Z", "content": "This is the Tesla Model Y, the electric carmakers new compact SUV due out in 2020. It has a range of 300 miles and seating for seven. Its capable of sprinting from 0 to 60 mph in 3.5 seconds, and will sell for $47,000. Its Elon Musks fifth car ever to hit the… [+2697 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Looks like Google’s thinking about a folding screen of its own", "description": "A recent patent application filed by Google suggests the search giant is experimenting with foldable display technology, similar to the panels seen on the Huawei Mate X and Samsung Galaxy Fold. The filing, spotted by Patently Mobile, describes a method for co…", "url": "https://www.theverge.com/2019/3/14/18266257/google-folding-bending-screen-display-patent", "urlToImage": "https://cdn.vox-cdn.com/thumbor/NxaW5thk58BqwaCcjgwCcDzPuYE=/0x57:782x466/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963039/google_screen_patent_2.0.jpg", "publishedAt": "2019-03-14T23:27:51Z", "content": "A recent patent application filed by Google suggests the search giant is experimenting with foldable display technology, similar to the panels seen on the Huawei Mate X and Samsung Galaxy Fold. The filing, spotted by Patently Mobile, describes a method for co… [+2101 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "‘Privacy matters’ in Apple’s latest iPhone ad", "description": "Privacy has always been a big part of Apple’s marketing pitch, and the company is bringing that point home once again in its latest iPhone ad, which boldly declares “Privacy. That’s iPhone.”", "url": "https://www.theverge.com/2019/3/14/18266276/apple-iphone-ad-privacy-facetime-bug", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lNcUcDAhcL9yhnoeO3jdrpfjDU8=/0x7:2506x1319/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15962764/Screen_Shot_2019_03_14_at_5.26.52_PM.png", "publishedAt": "2019-03-14T21:46:50Z", "content": "Privacy has always been a big part of Apple’s marketing pitch, and the company is bringing that point home once again in its latest iPhone ad, which boldly declares “Privacy. That’s iPhone,” via MacRumors. “If privacy matters in your life, it should matter to… [+503 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "New facial recognition bill would require consent before companies could share data", "description": "The bipartisan Commercial Facial Recognition Privacy Act is sponsored by Senators Brian Schatz (D-HI) and Roy Blunt (R-MO) and is the first of its kind when it comes to facial recognition (FR) technologies and the privacy concerns surrounding them. Under the …", "url": "https://www.theverge.com/2019/3/14/18266249/facial-recognition-bill-data-share-consent-senate-commercial-facial-recognition-privacy-act", "urlToImage": "https://cdn.vox-cdn.com/thumbor/0gqwMnH8VrJpEMsBYzr1RCtXIn0=/0x280:3905x2325/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15962796/956524662.jpg.jpg", "publishedAt": "2019-03-14T21:40:41Z", "content": "A new bill introduced in the Senate today would prohibit commercial companies using facial recognition technology from sharing peoples data without their explicit consent.\r\nThe bipartisan Commercial Facial Recognition Privacy Act is sponsored by Senators Bria… [+1922 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Turtle Beach is buying PC gaming accessory brand Roccat for $19.2 million", "description": "Turtle Beach is known for gaming headsets, but it’ll soon be adding an entirely new roster of PC gaming peripherals to its catalog: it’s purchasing Roccat, a fine purveyor of mice, keyboards, mouse pads, and headsets, for $19.2 million in cash, stock, and ear…", "url": "https://www.theverge.com/2019/3/14/18266156/turtle-beach-roccat-acquisition-pc-gaming-accessories", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RcKVbdTZhtI8_nvX2W3wDZrJZ8g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6881831/IMG_0977.0.jpg", "publishedAt": "2019-03-14T20:53:39Z", "content": "Turtle Beach is known for gaming headsets, but itll soon be adding an entirely new roster of PC gaming peripherals to its catalog: its purchasing Roccat, a fine purveyor of mice, keyboards, mouse pads, and headsets, for $19.2 million in cash, stock, and earn-… [+1338 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "After the porn ban, Tumblr users have ditched the platform as promised", "description": "Tumblr announced its porn ban in December, and users have reacted by explaining that they mainly used the site for browsing not-safe-for-work content. Many threatened to leave the platform if the ban was enforced. It now appears that many have made good on th…", "url": "https://www.theverge.com/2019/3/14/18266013/tumblr-porn-ban-lost-users-down-traffic", "urlToImage": "https://cdn.vox-cdn.com/thumbor/pLPq4FMftdrOESxD93N6xVksQGg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13598286/acastro_191203_177_tumblr_0001.jpg", "publishedAt": "2019-03-14T20:37:24Z", "content": "Since Tumblr announced its porn ban in December, many users reacted by explaining that they mainly used the site for browsing not-safe-for-work content, and they threatened to leave the platform if the ban were enforced. It now appears that many users have ma… [+1320 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "Facebook is losing two top executives after the company’s privacy pivot", "description": "Facebook is losing two of its top executives, Chris Cox and Chris Daniels, who served as the company’s chief product officer and the head of WhatsApp, respectively.", "url": "https://www.theverge.com/2019/3/14/18266141/facebook-whatsapp-head-chief-product-officer-chris-cox-daniels", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RKYjLazuTxjNs5ZezTDCT-j5kVA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12742497/acastro_180828_1777_facebook_0002.jpg", "publishedAt": "2019-03-14T20:32:21Z", "content": "Facebook is losing two of its top executives, Chris Cox and Chris Daniels, who served as the company’s chief product officer and the head of WhatsApp, respectively. The departures come just a week after Facebook CEO Mark Zuckerberg announced plans to reshape … [+7264 chars]"}]}