{"status": "ok", "totalResults": 3613, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Cory Booker says ‘racists think' Trump is 'racist' as the president faces backlash over tepid response to New Zealand shooting", "description": "Sen. Cory Booker on Monday said \"racists think\" President Donald Trump is a \"racist\" as the president faces criticism for not expressing concern about white nationalism following two terror shootings at mosques in New Zealand. \"His language is causing pain an…", "url": "https://www.businessinsider.com/cory-booker-racist-trump-new-zealand-backlash-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91237ce0575a25a738507b-2732-1366.jpg", "publishedAt": "2019-03-19T17:44:47Z", "content": "Sen. Cory Booker, a leading contender for the Democratic nomination in 2020, has been campaigning on a message of unity and has been less explicitly critical of President Donald Trump than some of the other candidates. \r\n During an interview with MSNBC's Chri… [+2791 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "New York's mayor wants to spend $10 billion to save Wall Street from disastrous flooding, but some people are skeptical", "description": "New York City Mayor Bill de Blasio just revealed a $10 billion plan to extend Manhattan's coastline by up to two city blocks. The mayor said the project will protect the Financial District — home to around 500,000 jobs — from flooding due to sea level rise. S…", "url": "https://www.businessinsider.com/new-york-mayor-climate-flooding-manhattan-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fffbc5b066e1199371cc3-2732-1366.jpg", "publishedAt": "2019-03-19T17:43:00Z", "content": "New York Mayor Bill de Blasio recently floated a $10 billion plan to extend Manhattan's coastline by up to two city blocks. The proposed extension would run from the Brooklyn Bridge to Battery Park, creating a barrier for the city's Financial District, which … [+4095 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "Microsoft Teams turns two years old and adds new features to take on $7.1 billion Slack (MSFT)", "description": "As Microsoft Teams turns two years old, it's adding new features designed to help front line workers and improve collaboration and security. Microsoft Teams is now used by over 500,000 organizations, although it does not report the number of daily active user…", "url": "https://www.businessinsider.com/microsoft-teams-users-new-features-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b2804f81ae66242008b531d-750-375.jpg", "publishedAt": "2019-03-19T17:26:17Z", "content": "Microsoft Teams just turned two years old, and this office messaging and collaboration app is adding an assortment of new features. \r\n Right now, Microsoft Teams is used by over 500,000 organizations, although it does not break out the number of daily active … [+2638 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "Google finally unveils its video game platform: Stadia", "description": "Google officially unveiled its first major video game initiative on Tuesday. It's called \"Stadia.\" Google's central point with its gaming initiative is to make gaming accessible for as many people as possible. Google unveiled a major new gaming initiative on …", "url": "https://www.businessinsider.com/google-console-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9123cc69bdec26ba653c3d-1920-960.jpg", "publishedAt": "2019-03-19T17:13:20Z", "content": "Google unveiled a major new gaming initiative on Tuesday, named \"Stadia.\" \r\n The service is built on Google's cloud network, and enables Netflix-like streamed video games to be played on various Chrome-powered devices: Chrome web browsers, Chromebooks, and ot… [+694 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Smith", "title": "LIVE: Google unveils its vision for ‘the future of gaming’ (GOOG, GOOGL)", "description": "Google is giving the keynote address at the annual Game Developers Conference (GDC) on Tuesday, which begins at 10 a.m. PT. Google is expected to unveil its big push into video games, including a streaming service, and even some hardware. Business Insider is …", "url": "https://www.businessinsider.com/google-gdc-keynote-live-blog-announcements-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5af3183818ad4118008b477e-1920-960.jpg", "publishedAt": "2019-03-19T16:50:56Z", "content": "Google is about to give the keynote address at the 2019 Game Developers Conference (GDC) in San Francisco on Tuesday, where the tech giant is expected to unveil what it calls its \"vision for the future of gaming.\" \r\n Business Insider will be in attendance for… [+211 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hillary Hoffower", "title": "Raising kids is so expensive in America that millennials are prioritizing their pets instead and dropping up to $400 on designer dog clothes", "description": "Millennials are spending more than $400 on designer dog clothes, according to Fashionista. As millennials delay traditional milestones, like getting married, buying a house, or having children, they're choosing to be pet owners instead. In a world where raisi…", "url": "https://www.businessinsider.com/millennials-buy-high-end-dog-clothes-prioritize-pets-over-kids-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c901276f73f5c0e8e70c02d-1920-960.jpg", "publishedAt": "2019-03-19T16:49:00Z", "content": "Millennials love their dogs — so much that they're willing to spend more than $400 on clothes for them. \r\n That's the price of a high-end dog puffer jacket from a collaboration between luxury brand Moncler Genius and Poldo Dog Couture, reported Maria Bobila f… [+2785 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Amir Ismael", "title": "Save $25 when you pre-order the new iPad Mini or iPad Air at Best Buy — and more of today's best deals from around the web", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/deal-of-the-day-apple-ipad-mini-air-pre-order-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fec08003f5c0d396acbe0-2732-1366.jpg", "publishedAt": "2019-03-19T16:49:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+4003 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "British Airways has a swanky new business class suite — here's what they look like", "description": "British Airways is preparing to introduce a new business class seat in July. The Club Suite seats will debut on Airbus A350 aircraft in July. The enclosed suites will feature their own doors, the ability to convert into beds, increased storage space, and 18.5…", "url": "https://www.businessinsider.com/british-airways-new-business-class-seat-suite-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9104d269e11c3a4f65a142-1920-960.jpg", "publishedAt": "2019-03-19T16:46:13Z", "content": "British Airways is showing off a brand new business class seat. \r\n The \"Club Suite\" seats will debut on Airbus A350 in July. The seats will feature their own doors, the ability to convert into beds, increased storage space, and 18.5-inch screens. \r\n \"The arri… [+915 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matthew DeBord", "title": "11 questions to ask when buying a new car", "description": "New-car buyers should ask themselves some basic questions. You'll want to consider the value of your trade-in, your financing options, and the way a new vehicle with fit into your life. The process might seem intimidating, but it's actually quite straightforw…", "url": "https://www.businessinsider.com/what-questions-ask-when-buying-new-car-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5900ff747522ca5b5f8b637d-960-480.jpg", "publishedAt": "2019-03-19T16:43:09Z", "content": "Money! Yes, you will have to spend it on a new car. \r\n You have four basic choices: \r\n 1. Pay cash. Almost nobody does this, but if you have the dough and you walk into a dealership with a lump sum, you might be able to strike good deal. \r\n 2. Arrange your ow… [+1188 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh and Becky Peterson", "title": "Buzzy AI software startup UiPath in talks to raise a mega funding round at possible $7 billion valuation", "description": "Buzzy software robots startup UiPath is in talks with investors about a major new funding round that could double its valuation from $3 billion to as much as $7 billion, sources told Business Insider. The round, which will likely close in early April, is led …", "url": "https://www.businessinsider.com/sources-uipath-raising-series-d-at-possible-7-billion-valuation-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a8179f73f5c353d392504-2732-1366.jpg", "publishedAt": "2019-03-19T16:33:42Z", "content": "Buzzy robotics software company UiPath is in talks with investors about a big new round of funding that could double its valuation from $3 billion to as much as $7 billion, multiple sources told Business Insider. \r\n The talks, which are ongoing, could infuse … [+2647 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sinéad Baker", "title": "Russia has banned fake news, while also being one of the world's prime exporters of fake news", "description": "Russian president Vladimir Putin signed a new law that heavily fines those who spread those who spread what the state decides is fake news. Russia is one of the world's largest sources of fake news, and it hosts campaigns that aim to spread misinformation aro…", "url": "https://www.businessinsider.com/russia-fake-news-exporter-bans-putin-bill-2019-3", "urlToImage": "https://amp.businessinsider.com/images/55b7bd002acae72d5f8ba1af-2732-1366.jpg", "publishedAt": "2019-03-19T16:30:19Z", "content": "Russia has passed a law banning the spread of fake news — even though the country has been linked to spreading more fake news abroad than anywhere else. \r\n Russian President Vladimir Putin signed a new law on Monday that introduces fines for people who spread… [+3372 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jeremy Berke", "title": "A hot marijuana startup fresh off a $75 million raise just scooped up an exec from ModCloth to lead its retail push and it's part of a growing trend", "description": "Caliva, a California marijuana startup, recently hired Elizabeth Cooksey, a former senior ModCloth executive. Cooksey will head up Caliva's retail expansion in California. Caliva recently raised $75 million from the likes of Carol Bartz, Yahoo's former CEO, a…", "url": "https://www.businessinsider.com/marijuana-startup-caliva-hires-modcloth-executive-as-head-of-retail-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91175c01df7230a54f1072-1920-960.jpg", "publishedAt": "2019-03-19T16:30:01Z", "content": "Caliva, a popular California marijuana brand, recently hired a senior ModCloth executive to head up their retail expansion, Business Insider has learned. \r\n Elizabeth Cooksey, who was hired by the women's fashion brand to build out their brick-and-mortar reta… [+3131 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Ciolli", "title": "JPMORGAN: Any of these 8 'wild cards' could shock markets out of their deepest slumber in 5 years", "description": "JPMorgan highlights a \"rolling bear market\" in cross-asset volatility, which it says represents a series of major mispricings in the market. The firm finds that cross-asset price swings are more underpriced than at any point since 2014, prior to when the Fede…", "url": "https://www.businessinsider.com/cross-asset-market-volatility-could-spike-on-8-wild-card-scenarios-jpmorgan-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5bf47d3f01b12d114c7f7907-1536-768.jpg", "publishedAt": "2019-03-19T16:22:28Z", "content": "If you've noticed subdued trading activity in everything from equities to commodities and currencies, you're not alone. \r\nJPMorgan is well aware that asset classes of all types are seeing muted price swings. The firm refers to the phenomenon as a \"rolling bea… [+2928 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jessica DeFino", "title": "I have sensitive, reactive skin, but this super-lightweight moisturizer has helped improve its condition for good", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/first-aid-beauty-ultra-repair-barriair-cream-review-skin-care", "urlToImage": "https://amp.businessinsider.com/images/5c8ff453124d040f2d5aef22-960-480.jpg", "publishedAt": "2019-03-19T16:20:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+6095 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "We went shopping at Victoria’s Secret and Aerie, and 4 key differences revealed why one is winning while the other is flailing (LB, AEO)", "description": "The women's underwear market is going through a period of rapid change in the United States. Longtime industry leader Victoria's Secret is increasingly finding itself under pressure as new brands enter the market and chip away at its market share. Its parent …", "url": "https://www.businessinsider.com/victorias-secet-aerie-differences-in-stores-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90fb4d401d581d8814ff10-1136-568.jpg", "publishedAt": "2019-03-19T16:17:59Z", "content": "Victoria's Secret is the longtime leader of the underwear market in the United States, but it is increasingly coming under pressure as new brands enter the market and chip away at its market share. \r\n This includes American Eagle's Aerie, which, since 2014, h… [+222 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Choi", "title": "Trump's border wall may strip money from a $65 million water treatment plant at a Marine Corps base with a history of contaminated water", "description": "The Defense Department published a list of hundreds of military projects that may lose funding to pay for President Trump's border barrier. It added that \"no military housing, barracks or dormitory projects will be impacted\" by the diverted funding. The list …", "url": "https://www.businessinsider.com/trumps-border-wall-camp-lejeune-water-treatment-national-emergency-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90373f124d041604055df6-1920-960.jpg", "publishedAt": "2019-03-19T16:10:53Z", "content": "President Donald Trump's plans for the US-Mexico border barrier may tap into unawarded funds that could have gone towards a water treatment plant at Camp Lejeune, a base near North Carolina's coast that struggled with contaminated water for decades, according… [+5366 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "15 shoe organization ideas that make the most of your space", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/shoe-storage-ideas", "urlToImage": "https://amp.businessinsider.com/images/5c8fff39124d0410d71955bc-750-375.jpg", "publishedAt": "2019-03-19T16:00:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+812 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Audrey Schomer", "title": "THE SOCIAL VIDEO REPORT: How social platforms are transforming their video distribution strategies and creating new opportunities for brands (FB, SNAP, GOOGL, AAPL)", "description": "This is a preview of a research report from Business Insider Intelligence. To learn more about Business Insider Intelligence, click here. Current subscribers can log in and read the report here. Social platforms are ramping up on emergent video formats to dri…", "url": "https://www.businessinsider.com/social-video-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c910d3601df722e6876485a-2732-1366.jpg", "publishedAt": "2019-03-19T15:51:00Z", "content": "This is a preview of a research report from Business Insider Intelligence. To learn more about Business Insider Intelligence, click here. Current subscribers can log in and read the report here.\r\nBusiness Insider Intelligence \r\nSocial platforms are ramping up… [+4622 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "19 celebrities, professional athletes, and politicians Trump has golfed with as president", "description": "President Donald Trump's well-documented golf habit has paired him with some famous names. In his first two years in office, Trump has played golf with dozens of athletes, celebrities, and politicians at his properties and golf clubs around the world. Here ar…", "url": "https://www.businessinsider.com/trump-golf-partners-while-president-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c910b3e124d0424dc395d82-1920-960.jpg", "publishedAt": "2019-03-19T15:50:25Z", "content": "In March 2019, President Donald Trump paid the 174th visit of his presidency to one of his golf courses, according to NBC's tracker. \r\n From visiting his course close to the White House in Sterling, Virginia to playing a diplomatic round in Japan, Trump has p… [+339 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matthew DeBord", "title": "A Waymo engineer reveals how the self-driving car company develops its robot brains (GOOGL)", "description": "Shilpa Gulati leads Waymo's Behavior Prediction team. The India-born engineer works on perfecting Waymo's robot brains. Her inspiration was reading Isaac Asimov's legendary robot stories when she was 12 years old. Editor's note: Business Insider has been talk…", "url": "https://www.businessinsider.com/waymo-engineer-reveals-self-driving-robot-brains-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8aa58e401d583b93047e3c-1920-960.jpg", "publishedAt": "2019-03-19T15:39:47Z", "content": "Editor's note: Business Insider has been talking with Waymo employees from different parts of the company to learn more about their work. What we discovered were some of the coolest jobs at Alphabet, Waymo's parent company. This is the latest profile in the s… [+5422 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "MoviePass has officially launched its new unlimited plan — here are the details", "description": "MoviePass released details of its new unlimited plan, \"MoviePass Uncapped,\" on Tuesday. It will offer two price points for the unlimited plan: $119.40 up front for a year subscription or $14.95 month to month (increasing to $19.95 after an unspecified promo p…", "url": "https://www.businessinsider.com/moviepass-unlimited-plan-uncapped-details-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b6883b7e199f327008b4be2-1536-768.jpg", "publishedAt": "2019-03-19T15:39:41Z", "content": "On Tuesday, MoviePass released details of its new unlimited plan, \"MoviePass Uncapped.\" \r\n MoviePass says there will be \"no cap on the number of 2D movies subscribers can see in MoviePass' theater network,\" but that it can throttle a subscriber's access at it… [+2031 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Elizabeth Warren wants to eliminate the Electoral College and let the popular vote decide presidential elections", "description": "Sen. Elizabeth Warren announced on Monday that she supports eliminating the Electoral College. Two Democrats, Hillary Clinton and Al Gore, recently won the popular vote in their bids for the presidency, but were denied the White House after losing the Elector…", "url": "https://www.businessinsider.com/elizabeth-warren-end-electoral-college-for-presidential-elections-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f2d469e11c35c434a736-750-375.jpg", "publishedAt": "2019-03-19T15:37:36Z", "content": "Sen. Elizabeth Warren announced on Monday night that she supports eliminating the Electoral College. \r\n Warren is among the first 2020 presidential candidates to call for a fundamental restructuring of US presidential elections. She argued during a CNN town h… [+2591 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Avery Hartmans", "title": "The way Theranos reportedly reacted to the suicide of its chief scientist was unbelievably cold", "description": "While dealing with the death of an employee is likely an incredibly difficult task, Theranos CEO Elizabeth Holmes' reported reaction to the suicide of one of her first hires was particularly unusual. That's according to an October 2016 feature story by Vanity…", "url": "https://www.businessinsider.com/theranos-ceo-elizabeth-holmes-employee-death-2016-9", "urlToImage": "https://amp.businessinsider.com/images/57cecc21b996ebf6088b623d-2732-1366.jpg", "publishedAt": "2019-03-19T15:35:00Z", "content": "Elizabeth Holmes, founder and CEO of Theranos.\r\n REUTERS/Brendan McDermid \r\nWhile dealing with the death of an employee is likely an incredibly difficult task, Theranos CEO Elizabeth Holmes' reported reaction to the suicide of one of her first hires was parti… [+1465 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "We give our child at least half an hour of playtime before school, and it's made all our mornings better", "description": "Children thrive on routine, which is why my family gives our 5-and-a-half-year-old son at least 30 minutes of playtime before school. Scheduling playtime for him has made him more motivated to go through his morning routine each day. Adding that to his day ha…", "url": "https://www.businessinsider.com/children-playtime-before-school-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5addf84219ee8653008b463c-1136-568.jpg", "publishedAt": "2019-03-19T15:34:00Z", "content": "The author, his wife, and their 5-year-old son.\r\n Steven John \r\n Children thrive on routine, as years of research has shown. \r\n But I don't need an expert to tell me that — I just need to ask my son if he wants to skip his nighttime snack because he ate such … [+2949 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "Exploding Kittens is the most-backed project on Kickstarter to date — here's how a $20 card game became an internet phenomenon", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/exploding-kittens-kickstarter-card-game", "urlToImage": "https://amp.businessinsider.com/images/5c8fd8e6e0575a08c44fa984-750-375.jpg", "publishedAt": "2019-03-19T15:32:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+5129 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Audrey Schomer", "title": "WarnerMedia will refocus its workforce on streaming (T, NFLX)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here. Serious layoffs are expected as AT&T integrates WarnerMedia and …", "url": "https://www.businessinsider.com/warnermedia-layoffs-streaming-refocus-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9109095dfa992b404fe216-1920-960.jpg", "publishedAt": "2019-03-19T15:31:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here. Serious layoffs are expected as AT&amp;T integrates WarnerMedia … [+1687 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mekebeb Tesfaye", "title": "Citibank is abandoning its crypto ambitions (C, JPM, NDAQ, HSBC)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here. Citibank has abandoned its plans to launch a crypto, dubbed CitiCoin, …", "url": "https://www.businessinsider.com/citibank-abandons-citicoin-crypto-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91032f4f07ae310e54c004-750-375.jpg", "publishedAt": "2019-03-19T15:25:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Citibank has abandoned its plans to launch a crypto, dubbed CitiCoin… [+3589 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christopher Woody and Reuters", "title": "The Air Force had to evacuate one of its 'Doomsday' planes from its base, and it highlights a growing problem for the Pentagon", "description": "The US Air Force evacuated nine planes from Offutt Air Force Base in Nebraska because of flooding this week. One of those planes was an E-4B, an airborne command-and-control aircraft vital to national defense. The flooding and the evacuations illustrate the c…", "url": "https://www.businessinsider.com/flooded-us-air-force-base-underscores-climate-risk-to-security-experts-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9106e6124d0423be596d50-1334-667.jpg", "publishedAt": "2019-03-19T15:24:00Z", "content": "Flooding at a US Air Force base in Nebraska that damaged buildings and forced the removal of a plane integral to US nuclear-attack response highlights the risks climate change poses to national security, experts said Monday. \r\n US President Donald Trump has r… [+423 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Megan Foster", "title": "9 products and at-home treatments we use to save money on salon services", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/diy-gel-manicure-waxing-shaving-treatments-home-alternatives-salon-services", "urlToImage": "https://amp.businessinsider.com/images/5c75655f2628980a442a9c43-750-375.jpg", "publishedAt": "2019-03-19T15:20:00Z", "content": "Overtone Color-Depositing Conditioner, $40, Available at Amazon\r\n When I had my hair dyed red, one of the fastest-fading colors, I was dreading having to go back to the salon for necessary color touch-ups. For context, I go to the salon about once a year, max… [+1167 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matthew DeBord", "title": "Here's what you should do if you feel drowsy while driving, according to a Chevy safety engineer who saw the danger of tired driving firsthand when serving in Iraq (GM)", "description": "Maureen Short is a West Pointer and former US Army Captain who learned about drowsy driving firsthand when she was a company commander in Iraq. She now studies drowsy driving as a safety engineer at GM's Chevrolet brand. Her advice is to get adequate rest or …", "url": "https://www.businessinsider.com/what-to-do-if-you-feel-tired-while-driving-chevy-safety-engineer-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8804df262898724e1af4e3-1920-960.jpg", "publishedAt": "2019-03-19T15:14:46Z", "content": "Maureen Short joined Chevrolet three years ago as a safety engineer, but her career was already something of a professional highlight reel. \r\n The US Military Academy graduate followed up her West Point engineering studies with a deployment to Iraq in 2003 an… [+3906 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "The top 9 movies at the US box office in 2019, so far", "description": "\"Captain Marvel\" is dominating the box office, flying past $200 million domestic and $760 million worldwide over the weekend. Other movies topping the box office so far this year include \"Glass\" and \"The Upside.\" \"Captain Marvel\" continued its box-office domi…", "url": "https://www.businessinsider.com/highest-grossing-movies-at-us-box-office-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fdd01124d040ba50824c5-960-480.jpg", "publishedAt": "2019-03-19T15:11:32Z", "content": "\"Captain Marvel\" continued its box-office dominance over the weekend, raking in another $69 million to bring its domestic total past $200 million. It's also inching closer to the coveted $1 billion mark worldwide, and has made $760 million globally so far. \r\n… [+1434 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Irene Kim", "title": "I tried to cook like a Benihana chef and it was harder than I expected", "description": "Benihana is famous for their chefs' teppanyaki cooking tricks like bouncing eggs, tossing shrimp, and creating a flaming onion volcano. We visited their flagship location to learn what it takes to be a Benihana chef. We learned how to make signature dishes li…", "url": "https://www.businessinsider.com/benihana-chef-teppanyaki-cooking-tricks-how-to-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c7feb212628984275743b83-1920-960.jpg", "publishedAt": "2019-03-19T15:02:00Z", "content": "Following is a transcript of the video.\r\nIrene: If you've been to a Benihana, you know that the chef is the star of the show. We decided to find out just how hard it is to be a teppanyaki cooking master. I mean, what could go wrong? \r\n Irene: I'm here today a… [+3969 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "Joe Biden is trouncing the rest of the Democratic field in crucial early voting states", "description": "Former Vice President Joe Biden is leading the entire Democratic field, according to a new poll of early voting states. Biden has near universal name recognition among voters as well. Democratic candidates will need to achieve at least 1% in three separate po…", "url": "https://www.businessinsider.com/biden-polls-above-democratic-field-in-early-voting-states-iowa-south-carolina-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f28a124d041fd471dbe8-1920-960.jpg", "publishedAt": "2019-03-19T15:01:38Z", "content": "Former Vice President Joe Biden has yet to announce a 2020 presidential run, but he is still polling far ahead of the rest of the Democratic field, putting him in prime position if he jumps in the race. \r\n According to a new poll of early voting states releas… [+1892 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Real-estate brokerage HFF sells itself to Jones Lang LaSalle for $2 billion (JLL)", "description": "Real-estate brokerage HFF announced it is selling itself to Jones Lang LaSalle. JLL will acquire all the outstanding shares of HFF with a combination of cash and stock at an equity value of approximately $2 billion. HFF shareholders will receive $24.63 in cas…", "url": "https://markets.businessinsider.com/news/stocks/jll-hff-agree-to-2-billion-deal-2019-3-1028042285", "urlToImage": "https://images.markets.businessinsider.com/image/591db11b34911b21008b490d-900/jll-office.jpg", "publishedAt": "2019-03-19T14:55:00Z", "content": "Glassdoor\r\nReal-estate brokerage HFF announced it is selling itself to Jones Lang LaSalle.\r\nJLL will acquire all the outstanding shares of HFF with a combination of cash and stock at an equity value of approximately $2 billion.\r\nHFF shareholders will receive … [+1136 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Real-estate brokerage HFF sells itself to Jones Lang LaSalle for $2 billion (JLL)", "description": "Real-estate brokerage HFF announced it is selling itself to Jones Lang LaSalle. JLL will acquire all the outstanding shares of HFF with a combination of cash and stock at an equity value of approximately $2 billion. HFF shareholders will receive $24.63 in cas…", "url": "https://www.businessinsider.com/jll-hff-agree-to-2-billion-deal-2019-3", "urlToImage": "https://amp.businessinsider.com/images/591db12034911b1a008b4905-750-375.jpg", "publishedAt": "2019-03-19T14:55:00Z", "content": "The real-estate brokerage HFF announced it is selling itself to Jones Lang LaSalle, a provider of real estate and investment management services. \r\n Under the terms of the deal, JLL will acquire all the outstanding shares of HFF in a combination of cash and s… [+803 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Charlie Wood", "title": "Bird celebrates after Britain signals it is ready to trash a 184-year-old law banning electric scooters", "description": "Electric scooter firms could finally enter the British market after the UK government announced a review of some of its oldest transport laws. Electric scooters are currently illegal in Britain due to 1835 legislation, originally aimed at restricting the use …", "url": "https://www.businessinsider.com/electric-scooter-firm-bird-celebrating-britain-repeal-law-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b1ff0cb1ae66250008b4ca1-1920-960.jpg", "publishedAt": "2019-03-19T14:54:28Z", "content": "Bird, the $2 billion electric scooter startup, has welcomed a British government review of the country's transport laws, which could see an array of electric vehicles allowed on British roads for the first time. \r\n Electric scooters are one of many so-called … [+2578 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "Trump reportedly has a $50,000 golf simulator in the White House, but that's just the starting price for these luxury setups", "description": "Virtual golf simulators briefly became a hot topic last month when the Washington Post reported that President Donald Trump had his own full-room golf simulator installed in the White House. Professionals use golf simulators to track their swing data and impr…", "url": "https://www.businessinsider.com/golf-simulators-like-trumps-details-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fe084daa5070aac367a94-2732-1366.jpg", "publishedAt": "2019-03-19T14:50:58Z", "content": "Last month, the Washington Post reported that President Donald Trump had installed a $50,000 golf simulator in the White House for personal use. While the president's golf habits have fueled political debate for years, the report sparked two new questions for… [+964 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "Alamo Drafthouse's movie-ticket subscription plan will launch in all its theaters by the end of the year", "description": "Alamo Drafthouse's movie-ticket subscription service, Alamo Season Pass, will launch nationwide at all Drafthouse theaters by the end of the year. It will be an unlimited plan and cost $20 a month in most regions of the country. You will also be able to reser…", "url": "https://www.businessinsider.com/alamo-drafthouse-movie-ticket-subscription-plan-will-launch-this-year-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f9744f07ae2ede40ea02-1136-568.jpg", "publishedAt": "2019-03-19T14:50:43Z", "content": "The wait for the Alamo Drafthouse movie-ticket subscription plan is almost over. \r\n The popular chain will launch Alamo Season Pass by the end of the year across all its theaters, the company's founder and CEO Tim League told Business Insider. \r\n Since July, … [+3045 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "Mike Trout reportedly set to sign record-shattering 12-year, $430 million extension with Angels", "description": "Mike Trout is reportedly set to sign a 12-year extension with the Los Angeles Angels worth $430 million. The deal shatters the previous record for American sports contracts, set by Bryce Harper's $330 million deal with the Phillies. Trout was set to enter fre…", "url": "https://www.businessinsider.com/mike-trout-contract-extension-430-million-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90fba96123ca29df3c8ce2-1334-667.jpg", "publishedAt": "2019-03-19T14:48:23Z", "content": "After the MLB offseason saw two massive contracts dealt to free agents Bryce Harper and Manny Machado, Angels outfielder Mike Trout is reportedly set to get paid. \r\nAccording to ESPN's Jeff Passan, Trout is reportedly closing in on a 12-year extension with th… [+927 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Nvidia is gaining ground ahead of its investor day (NVDA)", "description": "Nvidia is set to hold its annual investor event set at 11:30 AM ET on Tuesday. Nvidia 's stock shed nearly half of its value from November to January after the chipmaker delivered disappointing third-quarter results and later cut its fourth-quarter revenue gu…", "url": "https://www.businessinsider.com/nvidia-stock-price-gaining-ground-ahead-of-its-investor-day-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f9c54f07ae2ef223db92-2732-1366.jpg", "publishedAt": "2019-03-19T14:41:48Z", "content": "Nvidia jumped 3.44% to $174.73 apiece early Tuesday, ahead of its annual investor event set at 11:30 AM ET. \r\n Nvidia has a tendency to put out \"pretty gaudy targets,\" Abhinav Davuluri, an analyst at Morningstar and Wall Street's biggest Nvidia bear, told Mar… [+1303 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Nvidia is gaining ground ahead of its investor day (NVDA)", "description": "Nvidia is set to hold its annual investor event set at 11:30 AM ET on Tuesday. Nvidia 's stock shed nearly half of its value from November to January after the chipmaker delivered disappointing third-quarter results and later cut its fourth-quarter revenue gu…", "url": "https://markets.businessinsider.com/news/stocks/nvidia-stock-price-gaining-ground-ahead-of-its-investor-day-2019-3-1028042262", "urlToImage": "https://images.markets.businessinsider.com/image/59d5040f351ccf83028b7eb3-2400/ap090108021362.jpg", "publishedAt": "2019-03-19T14:41:48Z", "content": "AP Photo / Paul Sakuma\r\nNvidia jumped 3.44% to $174.73 apiece early Tuesday, ahead of its annual investor event set at 11:30 AM ET.\r\nNvidia has a tendency to put out \"pretty gaudy targets,\" Abhinav Davuluri, an analyst at Morningstar and Wall Street's biggest… [+1316 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Antonio Villas-Boas", "title": "Two winning photos from Apple’s 2019 photography competition were shot with iPhones that launched almost three years ago (AAPL)", "description": "Two of the winners of Apple's recent \"Shot on iPhone\" challenge came from an iPhone 7. The iPhone 7 was released in 2016, proving that even older iPhones can still take fantastic photos. Six of the photos were taken with Apple's latest iPhone XS phones that w…", "url": "https://www.businessinsider.com/apple-iphone-7-shot-on-iphone-photography-competition-winning-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90fc3b5dfa99281108d0e8-1920-960.jpg", "publishedAt": "2019-03-19T14:41:42Z", "content": "Apple announced the winners of its \"Shot on iPhone\" competition earlier this month, and two of the winners came from an unlikely iPhone model. \r\n Two photos taken with the 2016 iPhone 7 were chosen by Apple and its panel of international judges, ranging from … [+1679 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Mueller was investigating Michael Cohen's emails and phone records for nearly a year before the FBI raided his home", "description": "Special counsel Robert Mueller obtained court-approved warrants to search Michael Cohen's emails in July 2017. This means Mueller was investigating Cohen much earlier than was previously known, and a little less than a year before an FBI raid on Cohen's home.…", "url": "https://www.businessinsider.com/mueller-investigation-michael-cohen-search-warrant-emails-fbi-raid-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90fbe56123ca29d75e9e82-2732-1366.jpg", "publishedAt": "2019-03-19T14:38:02Z", "content": "Special counsel Robert Mueller was investigating Michael Cohen for nearly a year prior to an FBI raid Cohen's home, accordingly to documents released on Tuesday. \r\n The documents show that Mueller obtained warrants to investigate Cohen's emails in July 2017, … [+2232 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Daniel McMahon", "title": "Trek unveils WaveCel, a new bike-helmet technology that the company says makes it '48 times less likely' you'll get a concussion compared to standard foam helmets", "description": "Trek on Tuesday unveiled the Bontrager WaveCel, a new helmet that the company says represents the biggest advancement in the protection against cycling concussions. Trek says a rider wearing a Bontrager helmet with WaveCel technology is up to 48 times less li…", "url": "https://www.businessinsider.com/trek-bontrager-wavecel-helmet-48x-less-likely-get-concussion-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f70d6123ca28a9428844-750-375.jpg", "publishedAt": "2019-03-19T14:37:39Z", "content": "Good news, bike riders: There's a new helmet on the market that's not only sleek and lightweight but proven to help protect you from getting a concussion far better than the standard foam helmets. \r\n That's according to Trek, which on Tuesday introduced the B… [+9269 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "Tesla is delaying a 3% price increase until Wednesday (TSLA)", "description": "Tesla is delaying a 3% price increase on its vehicles until Wednesday, the automaker said on Tuesday. The delay resulted from \"unusually high volume,\" Tesla said. The price increase will take place at midnight on Wednesday. The price increase applies to all v…", "url": "https://www.businessinsider.com/tesla-delays-3-price-increase-for-cars-until-wednesday-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c6efc200d15f51034228ca3-1536-768.jpg", "publishedAt": "2019-03-19T14:34:55Z", "content": "Tesla is delaying a 3% price increase on its vehicles until Wednesday, the automaker said on Tuesday. \r\n The delay resulted from \"unusually high volume,\" Tesla said. The price increase will take place at midnight on Wednesday. \r\nRead more: SEC rebukes Elon Mu… [+922 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nisha Stickles, Marisa Palmer and Sydney Kramer", "title": "Fake meat may be the sustainable solution to the food industry", "description": "Companies are creating \" fake meat\" to help dial back on meat consumption. Increased fake meat sales can be traced to flexitarians, people who seek protein alternatives. In the US, about 6% of people consider themselves vegan. Sustainability is another reason…", "url": "https://www.businessinsider.com/what-is-fake-meat-alternative-meat-companies-competing-burger-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c891c35e0575a11e4116155-1920-960.jpg", "publishedAt": "2019-03-19T14:31:56Z", "content": "Following is a transcript of the video.\r\n There's a burger fight going on in the supermarkets, and cows are watching from the sidelines. \r\n Alternative meat sales have increased across the globe. The market is set to reach $6.3 billion in revenue by 2023. Big… [+1764 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "Netflix loves 10-episode TV seasons and reportedly doesn't see the value in longer original shows", "description": "Netflix is increasingly favoring 10-episode seasons for its original series. Deadline reported that Netflix sees little value in shows that exceed 10-episode seasons and 30 episodes overall, which is one reason many Netflix shows get canceled after two or thr…", "url": "https://www.businessinsider.com/netflix-favors-tv-shows-with-10-episode-seasons-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f346113a5020e638db52-960-480.jpg", "publishedAt": "2019-03-19T14:26:43Z", "content": "There's a reason you're seeing TV shows with shorter seasons on Netflix. \r\n When Netflix seriously made the leap into original programming with \"House of Cards\" and \"Orange Is the New Black\" in 2013, the seasons were 13 episodes. But recently, Netflix's origi… [+2475 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "The federal government just confirmed what America's 1.8 million truck drivers have been saying for years — the truck driver shortage doesn’t really exist", "description": "The truck driver shortage has been a hot topic over the past year. But dozens of truckers have told Business Insider it doesn't really exist. A new study from the Bureau of Labor Statistics confirms what truck drivers have long said — and says the trucker lab…", "url": "https://www.businessinsider.com/truck-driver-shortage-not-real-bls-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8be87fe0575a577a1b00f2-2732-1366.jpg", "publishedAt": "2019-03-19T14:19:48Z", "content": "Mainstream publications ranging from The Washington Post to CNN or NPR, powered by findings from America's foremost trucking trade group, have been sounding the warning bells on the \"truck driver shortage.\" \r\n The American Trucking Associations, which represe… [+4410 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jaime Toplin", "title": "The 3 most pressing questions surrounding FIS' acquisition of Worldpay", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence subscribers. To receive the full story plus other insights each morning, click here. FIS’ $43 billion acquisition of processing giant Worldpay is the latest in a series of …", "url": "https://www.businessinsider.com/fis-worldpay-acquisition-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f99e113a5021b665bd0b-1334-667.jpg", "publishedAt": "2019-03-19T14:19:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence subscribers. To receive the full story plus other insights each morning, click here.\r\n FIS' $43 billion acquisition of processing giant Worldpay is the latest in a series o… [+5428 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "You can now shop from brands including Kylie Cosmetics, Nike, and Zara on Instagram — here's the list (FB)", "description": "Instagram launched a checkout button this week, allowing users to shop without ever leaving the platform. Checkout on Instagram is currently being beta-tested with 23 brands. Instagram has partnered with some of the buzziest names in retail, including Kylie C…", "url": "https://www.businessinsider.com/instagram-shop-hm-zara-kylie-cosmetics-and-more-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f32d5b066e1fd025497b-1136-568.jpg", "publishedAt": "2019-03-19T14:07:02Z", "content": "You can now shop on Instagram without ever leaving the app. \r\n On Tuesday, Instagram announced it had launched \"Checkout on Instagram.\" Shoppers can tap an Instagram photo to see a \"Checkout on Instagram\" button, which lists the price of the item. Tapping the… [+595 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Mayer", "title": "The best places to buy vegan leather shoes", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-vegan-leather-shoes", "urlToImage": "https://amp.businessinsider.com/images/5c8fc21e003f5c06710ba804-750-375.jpg", "publishedAt": "2019-03-19T14:00:00Z", "content": "Why you'll love it: Amazon has a fantastic selection from top vegan leather brands like Matt &amp; Nat, Native Shoes, and Doc Martens. \r\n You really can buy everything on Amazon, can't you? The online retailer has been upping its game in terms of fashion offe… [+970 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "From Silicon Valley superstar to facing jail time on fraud charges, here's where Theranos founder Elizabeth Holmes is now", "description": "Theranos founder Elizabeth Holmes and former Theranos president Sunny Balwani have been charged with nine counts of wire fraud and two counts of conspiracy to commit wire fraud. The charges stem from allegations that the two engaged in a scheme to defraud inv…", "url": "https://www.businessinsider.com/theranos-founder-elizabeth-holmes-and-sunny-balwani-charged-with-wire-fraud-2018-6", "urlToImage": "https://amp.businessinsider.com/images/5c90ec7ff73f5c198800d763-2732-1366.jpg", "publishedAt": "2019-03-19T13:56:00Z", "content": "Former Theranos founder and CEO Elizabeth Holmes (L) leaves the Robert F. Peckham U.S. Federal Court on January 14, 2019 in San Jose, California.\r\n Justin Sullivan/Getty Images \r\n In 2018, a final reckoning came for the blood-testing company Theranos, its fou… [+2659 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "A new game set in the ruins of Washington D.C. is a best-in-class shooter than puts 'Anthem' to shame", "description": "\"The Division 2\" is available now on Xbox One, PlayStation 4, and PC. The third-person loot-shooter is set in Washington D.C., in the wake of a pandemic wiping out much of society. From storytelling to gameplay, \"The Division 2\" distinguishes itself from the …", "url": "https://www.businessinsider.com/the-division-2-review-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f11201df7228b01a9ac8-2732-1366.jpg", "publishedAt": "2019-03-19T13:55:49Z", "content": "At its heart, just like the \"Destiny\" franchise and the recently released \"Anthem,\" \"The Division 2\" is a game about shooting enemies and collecting loot. It's a kind of hybrid combination of the shooter genre with the loot gathering mechanics typically found… [+590 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sinéad Baker", "title": "Vladimir Putin signed a restrictive new law that makes it illegal to insult government officials — including him", "description": "Vladimir Putin signed a new law that can fine and even jail citizens for insulting the Russia state, its flag, or Putin himself. People who show \"blatant disrespect\" can be fined up to to 100,000 rubles ($1,550) and repeat offenders can be jailed for up to 15…", "url": "https://www.businessinsider.com/vladimir-putin-law-illegal-insult-him-government-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90dba701df7226190e8833-1536-768.jpg", "publishedAt": "2019-03-19T13:55:21Z", "content": "Russian President Vladimir Putin has signed a new law that can jail citizens for insulting government officials — including him. \r\n People who show \"blatant disrespect\" for the state, the government, the Russian flag, or the constitution can be fined up to 10… [+1981 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Slotnick", "title": "Chase has increased the sign-up bonus for the Sapphire Preferred credit card for the first time since 2015", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/chase-sapphire-preferred-60k-sign-up-bonus", "urlToImage": "https://amp.businessinsider.com/images/5c90f44ae0575a1d3b1efdab-960-480.jpg", "publishedAt": "2019-03-19T13:54:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+5220 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "Here are the most common reasons planes crash", "description": "Investigators are currently pouring over black box data to figure what caused Ethiopian Airlines Flight ET302 to crash last week. The cause of the is yet unknown. According to IATA Safety Report 2017, the most common contributing factor was flight crew error.…", "url": "https://www.businessinsider.com/why-planes-crash-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ff4546123ca16d46d569c-2732-1366.jpg", "publishedAt": "2019-03-19T13:53:00Z", "content": "Ethiopian Airlines Flight ET302 crashed last week, killing all 157 passengers and crew on board the Boeing 737 Max 8 jetliner. Investigators are currently digging through data from the doomed plane's black boxes to determine the cause of the crash. \r\n Even th… [+2595 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Jeff Bezos tweeted a video of himself playing with a swooping robot dragonfly at his invite-only robotics conference", "description": "Jeff Bezos tweeted footage of himself playing with a robot dragonfly. The footage appears to be from Bezos' exclusive robotics conference, MARS. It is the first time the Amazon CEO has tweeted since locking horns with the National Enquirer. Jeff Bezos has twe…", "url": "https://www.businessinsider.com/jeff-bezos-tweets-video-robotic-dragonfly-test-from-mars-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90edd0e0575a1c59531b62-1334-667.jpg", "publishedAt": "2019-03-19T13:46:55Z", "content": "Jeff Bezos has tweeted a glimpse behind the curtain of his exclusive annual robotics conference — and it looks like he's loving life. \r\n In a post on Tuesday, Bezos posted a video of himself playing with what appears to be a robotic dragonfly. He credited Fes… [+1254 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Greg Magana", "title": "AmazonBasics dwarfs Amazon’s other private labels in popularity (AMZN)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here. Amazon’s top 10 private labels get the lion’s share of the exposure…", "url": "https://www.businessinsider.com/amazonbasics-amazon-top-private-label-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90eddc003f5c1e270484fc-1136-568.jpg", "publishedAt": "2019-03-19T13:46:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Amazon's top 10 private labels get the lion's share of the exposu… [+3634 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "How Elizabeth Holmes convinced powerful men like Henry Kissinger, James Mattis, and George Shultz to sit on the board of now-disgraced blood-testing startup Theranos", "description": "Theranos at one point had a star-studded board of directors, including military leaders and former secretaries of state. In HBO's \"The Inventor: Out For Blood In Silicon Valley,\" director Alex Gibney spoke to reporters who wrote the first major profiles of th…", "url": "https://www.businessinsider.com/theranos-former-board-members-henry-kissinger-george-shultz-james-mattis-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ba05569bdec4b753ec094-2732-1366.jpg", "publishedAt": "2019-03-19T13:44:00Z", "content": "Theranos founder Elizabeth Holmes had a knack for getting powerful people on her side. \r\n From politicians to celebrities, over a little more than a decade she created a blood testing company that was worth $9 billion on its promise to test for a number of co… [+4929 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "These are the 15 European fintechs VCs think will blow up in 2019", "description": "We asked several major venture-capital investors to tell us which European fintechs will boom in 2019. The companies cover a wide variety of products and services across the financial industry as digital disruption re-shapes everything from banking to insuran…", "url": "https://www.businessinsider.com/these-are-the-15-european-fintechs-vcs-think-will-blow-up-in-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90d6c0113a501da552a333-2732-1366.jpg", "publishedAt": "2019-03-19T13:38:57Z", "content": "Business Insider spoke with some of the most prominent voices in venture capital to pick out the most exciting companies in European financial technology industry this year. \r\n The experts also highlighted what to look out for going forward. \r\n Major fintech … [+676 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanza Loudenback", "title": "I made a mental shift to start saving more money and I'd recommend it to just about anyone", "description": "One-fifth of Americans aren't saving any money, according to a Bankrate survey, and most say it's because they have too many expenses. I make saving money a priority by treating it as an expense, just like rent, food, and insurance. I make regular, automatic …", "url": "https://www.businessinsider.com/money-saving-tip-treat-as-expense-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9003786123ca196f0e36d6-1920-960.jpg", "publishedAt": "2019-03-19T13:37:00Z", "content": "One-fifth of working Americans revealed in a recent Bankrate survey that they aren't saving a dime. Thirty-eight percent said it's because they have too many expenses. \r\n What's worse, 16% of respondents who aren't saving money said they just \"haven't gotten … [+2621 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "'Call of Duty' is going mobile with a brand-new game coming to Android and iOS later this year", "description": "\"Call of Duty: Mobile\" will launch for free on iOS and Android later this year, with a public beta arriving in the summer. The game will be focused on online multiplayer, incorporating popular weapons, maps, and characters from past \"Call of Duty\" games like …", "url": "https://www.businessinsider.com/call-of-duty-mobile-ios-android-announcement-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90e9c269e11c34116c8334-480-240.jpg", "publishedAt": "2019-03-19T13:26:20Z", "content": "Activision recently announced \"Call of Duty: Mobile,\" a new game in the best-selling franchise designed for Android and iOS. \r\n The game will be released for free in the Apple App Store and Google Play Store later this year; a beta test is planned for the sum… [+441 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Snapchat admits its age verification safeguards are effectively useless", "description": "Snap executives Stephen Collins and Will Scougal were grilled by UK lawmakers on Snapchat's age-verification process. Collins admitted that the system is effectively useless in stopping underage users from signing up to the Snapchat app. He said the systems m…", "url": "https://www.businessinsider.com/snapchat-says-its-age-verification-safeguards-are-effectively-useless-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90e77d5dfa99246a3a2bb2-1334-667.jpg", "publishedAt": "2019-03-19T13:23:04Z", "content": "Two top Snap executives were grilled by a UK parliamentary committee on Tuesday about failures in Snapchat's age-verification system, with one admitting that it does not work. \r\n Snap's senior director of international public policy, Stephen Collins, and EMEA… [+1838 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Ocasio-Cortez blames her poor approval rating numbers among New York state voters on Fox News", "description": "Rep. Alexandria Ocasio-Cortez is underwater with New York State voters, a poll released Monday found. While 31% of registered New York voters had a favorable opinion of the 29-year-old democratic socialist, 44% of voters had an unfavorable view of her. Ocasio…", "url": "https://www.businessinsider.com/ocasio-cortez-blames-poor-approval-rating-numbers-fox-news-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9008ea4f07ae1eec5acf37-1536-768.jpg", "publishedAt": "2019-03-19T13:20:11Z", "content": "Rep. Alexandria Ocasio-Cortez is underwater with New York State voters, according to a new Siena College poll of New York registered voters released Monday. \r\n While 31% of registered New York State voters had a favorable opinion of the 29-year-old democratic… [+2645 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Peter Newman", "title": "Sprint has opened a demo space to showcase its 5G tools (S)", "description": "Softbank-owned US telecom Sprint opened a 5G experience center at its Kansas City, Kansas, headquarters that could give it an outlet to highlight the potential of its enterprise 5G offering. A dedicated space to showcase a number of 5G applications could be a…", "url": "https://www.businessinsider.com/sprint-5g-experience-center-enterprise-tools-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c6eeb4070a61e7dac785c2a-1334-667.jpg", "publishedAt": "2019-03-19T13:19:27Z", "content": "Softbank-owned US telecom Sprint opened a 5G experience center at its Kansas City, Kansas, headquarters that could give it an outlet to highlight the potential of its enterprise 5G offering. \r\nBusiness Insider Intelligence \r\nA dedicated space to showcase a nu… [+2816 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Boeing’s CEO wrote an open letter about the 737 Max plane groundings — here’s what he says the company is doing after two deadly crashes (BA)", "description": "Boeing's CEO responded to growing questions about its 737 Max plane on Monday. In an open letter to passengers and airlines, Dennis Muilenburg said the hotly awaited software update for the model should be available by the end of the month. Read the full text…", "url": "https://www.businessinsider.com/boeing-ceo-writes-open-letter-about-737-max-crashes-full-text-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90e3c44f07ae2b3646d739-960-480.jpg", "publishedAt": "2019-03-19T13:05:10Z", "content": "Amid growing scrutiny surrounding the second crash of its 737 Max plane, Boeing's CEO on Monday released an open letter to airlines and passengers about the ongoing investigation. \r\n \"We're united with our airline customers, international regulators and gover… [+4843 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Slotnick", "title": "Capital One has a new partnership with ticket reseller Vivid Seats — Savor cardholders can earn 8% cash back", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/capital-one-savor-vivid-seats-tickets", "urlToImage": "https://amp.businessinsider.com/images/5c900817e0575a10225db674-1920-960.jpg", "publishedAt": "2019-03-19T13:00:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+1210 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "App Annie, one of Silicon Valley's most popular tools for measuring an app's success, crosses a $100 million milestone and unveils a product to launch another wave of growth", "description": "On Tuesday, app data platform App Annie announced it crossed $100 million in annual recurring revenue. It also launched a new product called Mobile Web intelligence, which allows customers to see mobile web and app metrics side by side. App Annie plans to con…", "url": "https://www.businessinsider.com/app-annie-crosses-100-million-arr-launches-mobile-web-intelligence-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c5b40b9dfa1e70ead2cd6c5-2732-1366.jpg", "publishedAt": "2019-03-19T13:00:00Z", "content": "After some internal changes to the company culture, App Annie, a quickly-growing app platform that is often cited in Apple's announcements, just launched its first new product of the year, and it also announced it hit a $100 million milestone. \r\n On Tuesday, … [+2748 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "The cannabis producer Tilray is deploying a 'risky strategy' to expand globally (TLRY)", "description": "Tilray on Monday beat on sales but missed on the bottom line. The cannabis producer pointed to a lack of supply in Canada and high international expansion costs. Tilray's argument is that Canada will soon see oversupply and that it will be an insignificant ma…", "url": "https://www.businessinsider.com/weed-tilray-stock-price-deploying-risky-strategy-global-expansion-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c1abaf8d4beaf1c9b100a37-2732-1366.jpg", "publishedAt": "2019-03-19T12:56:00Z", "content": "Tilray's strategy to focus on international expansion while dismissing Canada is very risky, Jefferies says. The Canadian cannabis producer on Monday reported better-than-expected sales, but missed on the bottom line due to a lack of supply in Canada and high… [+1752 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "The cannabis producer Tilray is deploying a 'risky strategy' to expand globally (TLRY)", "description": "Tilray on Monday beat on sales but missed on the bottom line. The cannabis producer pointed to a lack of supply in Canada and high international expansion costs. Tilray's argument is that Canada will soon see oversupply and that it will be an insignificant ma…", "url": "http://markets.businessinsider.com/news/stocks/The-cannabis-producer-Tilray-is-deploying-a-risky-strategy-to-expand-globally-TLRY-1028041607", "urlToImage": "https://images.markets.businessinsider.com/image/5c1abaaee04d621b9a7e357f-2400/gettyimages-1059190276.jpg", "publishedAt": "2019-03-19T12:56:00Z", "content": "\"The company's argument is that Canada will soon see oversupply and Canada will be insignificant anyway compared to the EU and US opportunity,\" Jefferies analyst Owen Bennett said in a note out Tuesday, citing comments from Tilray's management during the comp… [+1450 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andy Kiersz", "title": "While top CEOs make a median salary of $1 million a month, an average worker in Mississippi pulls in $3,138. Here's the median monthly earning of full-time workers in every state", "description": "An analysis of top CEO pay by The Wall Street Journal shows that the typical S&P 500 CEO earned over $1 million per month last year. That works out to about 256 times the typical full-time American worker's monthly paycheck. Median monthly pay varies across t…", "url": "https://www.businessinsider.com/typical-salary-full-time-year-round-workers-state-map-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ffd52e0575a0e1a3e3355-1536-768.png", "publishedAt": "2019-03-19T12:52:00Z", "content": "Pay for top executives at big US companies is vastly higher than what everyday workers make, and a new report from The Wall Street Journal shows that CEOs have hit an eye-popping milestone in the size of their monthly paychecks. \r\n The Wall Street Journal rec… [+1277 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "11 cities with the worst tap water in the US", "description": "Millions of people are exposed to unsafe drinking water every year in the US. Industrial towns like Pittsburgh and Detroit have discovered unsafe levels of lead in their water, which can lead to permanent brain damage in children. Other cities are reeling fro…", "url": "https://www.businessinsider.com/cities-worst-tap-water-us-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c1f7ee0575a5f8e6cc24e-2732-1366.jpg", "publishedAt": "2019-03-19T12:45:00Z", "content": "Imagine turning on the tap in the morning to find an unpleasant brown sludge that tastes like metal. Then imagine that state officials told you that water was safe to drink. \r\n That was the reality for residents of Flint, Michigan in 2014, when lead from agin… [+762 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Anna Baluch", "title": "I hustled to pay off my mortgage years before I had to, because there's something even more important than the math", "description": "In 2017, Anna Baluch and her husband decided to buy a house in Ohio. They were able to find the right place for $190,000, at a 4% interest rate. They decided they wanted to pay if off right away, even though they aren't sure whether it's their forever home. P…", "url": "https://www.businessinsider.com/paid-off-mortgage-early-freedom-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c869bd92628983f9d59b467-1136-568.jpg", "publishedAt": "2019-03-19T12:45:00Z", "content": "Right after my husband and I got engaged, we decided it was time to upgrade from our two-bedroom apartment to a house. In early 2017, we started attending open houses and stalking Zillow 24/7 in hopes that we'd find the perfect house. \r\n While our search for … [+3608 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "We picked March Madness favorites, sleepers, and Cinderellas for every region in the bracket", "description": "March Madness is back! For those filling out brackets, you have until noon on Thursday to finalize your picks. Below we break down the bracket region-by-region, covering the favorites, contenders, and sleepers to represent the Final Four. Check out the rest o…", "url": "https://www.businessinsider.com/march-madness-picks-2019-final-four-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9013584f07ae20537bd995-1536-768.jpg", "publishedAt": "2019-03-19T12:32:00Z", "content": "March Madness has once again taken over the sports world, with 68 teams contending for the NCAA national championship. \r\nFilling out a bracket can be a daunting task, and while it's fun to fuss over a first-round upset, the picks that will make or break your … [+707 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "Apple just updated the iMac for the first time since 2017 with a big performance boost (AAPL)", "description": "Apple just refreshed its 21.5-inch and 27-inch iMac models with more powerful processors and faster graphics. It's the first time Apple has updated the iMac since 2017. Both new models are available online immediately and arrive in Apple Stores next week. App…", "url": "https://www.businessinsider.com/apple-imac-update-specs-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ff6955dfa9914e36ee2e2-1920-960.jpg", "publishedAt": "2019-03-19T12:30:00Z", "content": "Apple has introduced upgraded models of its 21.5-inch and 27-inch iMacs that bring speedier performance and faster graphics, marking the first time Apple has refreshed its iMac line of all-in-one desktops since 2017. \r\n The new 21.5-inch Retina 4K iMac starts… [+2578 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alison Millington", "title": "The 20 most unhealthy countries on earth, ranked", "description": "A new global health ranking has identified the most unhealthy countries in the world. The ranking is based on 10 measures: healthy life expectancy, blood pressure, blood glucose (diabetes risk), obesity, depression, happiness, alcohol use, tobacco use, inacti…", "url": "https://www.businessinsider.com/most-unhealthy-countries-in-the-world-ranked-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8b889a6123ca4f6b649240-1136-568.jpg", "publishedAt": "2019-03-19T12:29:00Z", "content": "A new global health ranking has identified the world's healthiest — and most unhealthy — countries in 2019. \r\n The Indigo Wellness Index, compiled and led by Richard Davies at economics consultancy Bloomsbury Economics and published by investment business Let… [+1559 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "'If you get this done, you’ll all be my guests at Mar-a-Lago' — The highlights of Trump's $2 billion in debts to Deutsche Bank", "description": "Trump allegedly received around $2 billion in loans from Deutsche Bank during their two-decade history, according to The New York Times. Trump's business practices are drawing more scrutiny amid investigations into the relationship between the president and t…", "url": "https://www.businessinsider.com/trump-deutsche-bank-loans-mar-a-lago-promise-before-bond-default-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90c458f73f5c167254ff53-2732-1366.jpg", "publishedAt": "2019-03-19T12:11:06Z", "content": "The New York Times just reported an explosive piece about Donald Trump's history with Deutsche Bank, saying that over the course of their relationship the German bank lent around $2 billion to the former real-estate mogul. \r\n The president's association with … [+3532 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "PewDiePie's huge campaign to swat away T-Series and keep his YouTube crown is slowing down", "description": "PewDiePie is back as the number one YouTuber after briefly losing the spot to Indian music channel T-Series. PewDiePie keeps trading places with T-Series, in part thanks to a sustained campaign by his fans to keep him at the top. But a closer look at the stat…", "url": "https://www.businessinsider.com/pewdiepie-tseries-campaign-top-youtuber-slowing-down-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90d7595b066e1d0d086625-1536-768.jpg", "publishedAt": "2019-03-19T12:00:36Z", "content": "Felix Kjellberg, the YouTube star better known by his online moniker PewDiePie, has done well to claw back his slot as the most popular YouTuber. \r\n Kjellberg has briefly lost the top spot on a number of occasions in recent days to Indian YouTube channel T-Se… [+3106 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanya Dua", "title": "'It helps Facebook further fortify its walled garden': Instagram is testing in-app checkout to make shopping more seamless, but experts say it has a bigger agenda", "description": "Instagram is rolling out a checkout button to make it easier for people to shop from the platform. The function is being beta-tested with 20 brands, including Adidas, Burberry, MAC Cosmetics, Michael Kors, Nike, Warby Parker, and Zara. It shows how Instagram …", "url": "https://www.businessinsider.com/instagram-is-testing-in-app-checkout-but-experts-see-a-bigger-agenda-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fe87a401d580a096e8dbf-750-375.jpg", "publishedAt": "2019-03-19T12:00:00Z", "content": "Instagram wants to be a place where people not only discover new products, but buy them. \r\n The Facebook-owned platform is rolling out a checkout button to let people easily buy products in its feed without leaving the app. It's Instagram's biggest attempt to… [+3912 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Meghan Morris", "title": "Wall Street banks are taking tech into the tougher corners of fixed income, and it could lead to a re-imagining of how trading desks are organized", "description": "Fixed income is catching up to other asset classes, with new technology platforms enabling faster transactions and more liquidity. One former T. Rowe Price executive imagines a trading desk of the future, split into three levels of technological engagement ba…", "url": "https://www.businessinsider.com/the-trading-desk-of-the-future-could-be-divided-into-three-groups-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c10b5e0575a5da77b87b5-2732-1366.jpg", "publishedAt": "2019-03-19T12:00:00Z", "content": "Just a decade ago, a mid-sized fixed income dealer's options for finding new clients in different cities were the same as they had been for decades: cold calls, and perhaps a steak dinner to build the relationship. \r\n Now, lower technology costs and easier im… [+3914 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Will Martin", "title": "White House says Trump will drive a US economic boom lasting 10 years, a prediction virtually no serious economists agree with", "description": "President Trump's closest economic advisors are predicting a long term boom in the US economy as a direct result of his policies, a forecast wildly out of sync with most economists. The Council of Economic Advisers predicts growth over the next decade of arou…", "url": "https://www.businessinsider.com/white-house-us-economy-growth-forecasts-are-wildly-optimistic-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c7e00ca2628981c106b1d42-1136-568.jpg", "publishedAt": "2019-03-19T11:50:33Z", "content": "President Trump's closest economic advisors are predicting a US economic boom lasting at least a decade, as a direct result of his policies. \r\n The forecast goes against the majority of mainstream economic forecasters, who instead expect slowing growth in the… [+2633 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "New Yorkers have blamed 'villain' Alexandria Ocasio-Cortez after Amazon abandoned its HQ2 plans", "description": "A poll of New Yorkers shows the majority think Amazon cancelling its HQ2 plans for Long Island City was bad for the city. More than a third blamed Rep. Alexandria Ocasio-Cortez, who represents the neighboring district spanning the Bronx and Queens. Ocasio-Cor…", "url": "https://www.businessinsider.com/alexandria-ocasio-cortez-the-villain-after-amazon-abandons-hq2-plans-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c7d75352628981259650415-1136-568.jpg", "publishedAt": "2019-03-19T11:19:58Z", "content": "A poll of registered voters in New York shows more than a third blame Rep. Alexandra Ocasio-Cortez for the cancellation of Amazon's HQ2 plans in Long Island City. \r\n When Amazon announced on February 14 that it was abandoning its Long Island City plans, it la… [+2155 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lucia Moses", "title": "Apple is pitching its new subscription service as a savior to journalism, but publishers say its logic is flawed", "description": "Apple is set to launch a new all-you-can-read news subscription service along with other services at a big event next week. Critics of the plan say while Apple is pitching itself as a savior to the publishing industry with the new service, its logic is flawed…", "url": "https://www.businessinsider.com/apple-is-pitching-its-new-subscription-news-service-as-a-savior-to-the-news-business-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ffcf501df7218c137ec4a-1920-960.jpg", "publishedAt": "2019-03-19T11:00:00Z", "content": "Apple is set to launch a new all-you-can-read news subscription service along with other services at a big event March 25, and it's causing major angst among some of the biggest publishers, even those that are sitting it out. \r\n The name of the service hasn't… [+8020 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Abby Jackson", "title": "A product Comcast launched 2 years ago was supposed to disrupt AT&T and Verizon's business — now experts see it as something totally different", "description": "Comcast's cell phone service got off to a fast start, but doesn't pose a threat to the wireless market, Cowen analysts say. The service, Xfinity Mobile, launched in 2017 and had 1.2 million customers by the end of 2018. It turns out Comcast is using the servi…", "url": "https://www.businessinsider.com/comcasts-mobile-service-hasnt-turned-out-as-big-as-expected-2019-3", "urlToImage": "https://amp.businessinsider.com/images/567ee0b4e6183e591e8b4d47-1536-768.jpg", "publishedAt": "2019-03-19T11:00:00Z", "content": "When Comcast launched its Xfinity Mobile cellular service in 2017, Wall Street analysts predicted its customer base would soon skyrocket, adding more than 2 million customers a year and stealing market share from wireless providers. \r\n Two years later, that p… [+2296 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "10 things you need to know before the opening bell (SPY, SPX, QQQ, DIA, TSLA, TLRY)", "description": "Here is what you need to know. The ECB doesn't like the idea of Deutsche Bank merging with Commerzbank. \"I do not particularly like the idea of national champions, of European champions; especially when you are a supervisor, you should not promote any particu…", "url": "https://www.businessinsider.com/stock-market-news-opening-bell-march-19-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90cb4b5dfa99221769ca05-2732-1366.jpg", "publishedAt": "2019-03-19T11:00:00Z", "content": "Here is what you need to know. \r\n The ECB doesn't like the idea of Deutsche Bank merging with Commerzbank. \"I do not particularly like the idea of national champions, of European champions; especially when you are a supervisor, you should not promote any part… [+1899 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dan DeFrancesco", "title": "Brex, the billion-dollar startup backed by Peter Thiel and Y Combinator, plans to launch a new card for more mature fintechs", "description": "Brex, a startup that issues corporate credit cards to early-stage companies, plans to launch a new offering in April with more mature accounting features. The new card, which has yet to be named, will allow companies' financial departments to review and appro…", "url": "https://www.businessinsider.com/brex-to-release-new-card-in-april-for-mature-fintechs-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90222569bdec12891458f9-2732-1366.jpg", "publishedAt": "2019-03-19T11:00:00Z", "content": "Startups' needs evolve quickly. \r\n Brex understands that better than most. The San Francisco-based startup built a $1.1 billion business in just over two years catering specifically towards young companies. \r\n Brex offers corporate credit cards to startups wi… [+2465 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tom Murray", "title": "Cristiano Ronaldo has been charged with improper conduct by UEFA after his Champions League crotch-grabbing celebration", "description": "Cristiano Ronaldo has been charged with improper conduct by UEFA after his crotch-grabbing celebration in a Champions League match last week. The second-leg tie between Juventus and Atletico Madrid saw Ronaldo bring the Italian side back from the brink of def…", "url": "https://www.businessinsider.com/cristiano-ronaldo-charged-by-uefa-for-crotch-grabbing-celebration-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90b87b69bdec18d9217604-1536-768.jpg", "publishedAt": "2019-03-19T10:50:00Z", "content": "Cristiano Ronaldo single-handedly brought Juventus back from the brink of defeat in a stunning Champions League win over Atletico Madrid on Tuesday last week. \r\n The soccer star wrenched the Italian side back from a 2-0 deficit via a masterful hattrick, sendi… [+1485 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Stocks are up as traders shift focus to see just how 'patient' the Fed will be", "description": "US futures and European stocks are up in anticipation of the Federal Reserve cutting its forecast for interest-rate hikes this year. However, the Fed is likely to reduce its economic growth forecasts. Traders drove US futures and European stocks higher on Tue…", "url": "https://www.businessinsider.com/stocks-are-up-as-traders-bet-fed-wont-raise-rates-twice-this-year-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90b4d56123ca231e0ffba3-2732-1366.jpg", "publishedAt": "2019-03-19T10:20:37Z", "content": "Traders drove US futures and European stocks higher on Tuesday as they anticipated the Federal Reserve would commit to just one or even zero interest-rate hikes this year. \r\n Weak inflation, signs of a global economic slowdown, and stock market volatility at … [+2109 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Facebook says no one reported the New Zealand mosque shootings live video. But a reporter says he raised the alarm mid-attack.", "description": "Facebook said no users reported the video of the New Zealand mosque shootings while it was still live. This was disputed by a reporter for Right Wing Watch, who said he was alerted to the live video and raised the alarm immediately. The shooter streamed the a…", "url": "https://www.businessinsider.com/facebook-says-no-one-reported-new-zealand-mosque-shootings-live-video-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c80eac02628981bf2332c14-2560-1280.jpg", "publishedAt": "2019-03-19T10:13:22Z", "content": "Facebook has provided further details of its response to the video of the mosque shooting which left 50 people dead in Christchurch, New Zealand, on Friday. \r\n The attack was streamed live on Facebook via what is thought to be a body-mounted camera. A link to… [+1216 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Adam Payne", "title": "What does John Bercow's explosive intervention mean for Brexit?", "description": "Theresa May's government is reeling from John Bercow's bombshell announcement. The House of Commons Speaker said on Monday that the prime minister cannot put her Brexit deal to another vote as planned until there are substantial changes to it. The UK governme…", "url": "https://www.businessinsider.com/what-john-bercows-intervention-means-for-theresa-may-and-brexit-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90a908e0575a17eb1f1dc3-960-480.jpg", "publishedAt": "2019-03-19T10:05:33Z", "content": "LONDON — House of Commons Speaker John Bercow on Monday delivered a hammer blow to Theresa May's Brexit plan, announcing that she cannot hold another vote on her deal until there are significant changes to it. \r\n In a move that came to a surprise to virtually… [+5828 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marley Jay", "title": "The last time corporate profits plunged into a recession, stocks kept rallying — but Morgan Stanley says there are now 8 big differences that could send the market tumbling", "description": "Mike Wilson, the chief US equity strategist at Morgan Stanley, has been calling for a corporate earnings recession all year. While stocks stayed resilient during the last S&P 500 earnings recession in 2016, Wilson lays out several key differences between that…", "url": "https://www.businessinsider.com/stock-market-earnings-recession-8-major-risks-morgan-stanley-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fcc4cf73f5c047a0ae6a4-2732-1366.jpg", "publishedAt": "2019-03-19T09:58:00Z", "content": "Mike Wilson, the chief US equity strategist at Morgan Stanley, has been warning about an earnings recession all year. \r\n His forecast stands in contrast to the rest of Wall Street, which has a consensus profit-growth estimate of 5.1%. Wilson says that optimis… [+5278 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "One of the world's largest aluminium companies just got hit by a massive cyber attack", "description": "Norsk Hydro, one of the world's largest aluminium producers, was the subject of a massive cyber attack in the early hours of Tuesday, the company said in a statement. The Norwegian company said that it didn't know the full extent of the attack but said it was…", "url": "https://www.businessinsider.com/norsk-hydro-just-got-cyber-attacked-sending-its-shares-tumbling-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90ab1669bdec1852600024-2732-1366.jpg", "publishedAt": "2019-03-19T09:54:08Z", "content": "Norwegian aluminium producer and renewable energy provider Norsk Hydro has been hit by a major cyber attack which has partially shut down the company's operations. \r\n The company, which is one of the largest aluminium producers in the world, said that it didn… [+1310 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson", "title": "Conor McGregor praised 'inspiring' Cristiano Ronaldo, saying: 'We are both disciplined athletes at the top of our game'", "description": "Cristiano Ronaldo inspires Conor McGregor. The UFC fighter marveled at the way the Juventus striker pulled his team back from the brink of defeat against Atletico Madrid, to eliminate the Spanish side by scoring all three goals in the 3-2 aggregate win last w…", "url": "https://www.businessinsider.com/conor-mcgregor-praises-cristiano-ronaldo-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90a1bdf73f5c14b7429953-1920-960.jpg", "publishedAt": "2019-03-19T09:37:00Z", "content": "Cristiano Ronaldo has been praised by UFC fighter Conor McGregor for the way he scored a hat trick for Juventus when the \"pressure was on for all the marbles\" in the UEFA Champions League last week. \r\n The Juventus striker met McGregor at Jennifer Lopez's bir… [+2138 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Trista Kelley", "title": "Europe's central bank just flashed a warning for any potential Deutsche Bank-Commerzbank merger (DB)", "description": "The European Central Bank is adding its criticism to the potential tie-up of Deutsche Bank and Commerzbank Chair of the ECB’s Single Supervisory Mechanism told the Financial Times: \"I do not particularly like the idea of national champions.\" Berlin \"has becom…", "url": "https://www.businessinsider.com/ecb-warns-on-deutsche-bank-and-commerzbank-merger-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90b0cef73f5c158c66c603-1920-960.jpg", "publishedAt": "2019-03-19T09:24:25Z", "content": "When Deutsche Bank and Commerzbank confirmed they are holding formal talks about a merger, critics were quick to question a tie-up that may lead to tens of thousands of job losses and the potential failure of a plan that may do little to address underlying pr… [+2935 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "10 things in tech you need to know today", "description": "Good morning! This is the tech news you need to know this Tuesday. Tesla is asking employees to volunteer and help deliver 30,000 cars before the end of the quarter. Sanjay Shah, a senior vice president at Tesla, asked employees to help deliver 30,000 cars ov…", "url": "https://www.businessinsider.com/10-things-in-tech-you-need-to-know-today-march-19-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90a09edaa50719087f16d4-1920-960.jpg", "publishedAt": "2019-03-19T07:57:06Z", "content": "Elon Musk.\r\n Joshua Lott/Getty Images \r\nGood morning! This is the tech news you need to know this Tuesday. \r\n Tesla is asking employees to volunteer and help deliver 30,000 cars before the end of the quarter. Sanjay Shah, a senior vice president at Tesla, ask… [+2762 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sarah Gray", "title": "New report claims Trump received around $2 billion in loans from Deutsche Bank", "description": "President Donald Trump was loaned more than a cumulative $2 billion over several decades by Deutsche Bank, according to a new report from The New York Times published on Monday. The Times spoke to more than 20 people who who either currently or previously wor…", "url": "https://www.businessinsider.com/trump-and-deutsche-bank-loans-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f5c04daa507798c246405-2732-1366.jpg", "publishedAt": "2019-03-19T06:11:05Z", "content": "Deutsche Bank cumulatively loaned Donald Trump more than $2 billion over two decades when he was in real estate, according to a new report from The New York Times. \r\n While Trump's relationship with Deutsche Bank — which dates back to the 1990s — is not entir… [+2919 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Reuters", "title": "Netflix says it won't be joining Apple's coming TV service - Business Insider", "description": "Netflix says it won't be joining Apple's coming TV service Business Insider Netflix, the world's dominant streaming *service*, said it will not make its TV shows and movies available through Apple's upcoming video offering.", "url": "https://www.businessinsider.com/netflix-apple-tv-service-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c906759daa50716c976a8e3-1920-960.jpg", "publishedAt": "2019-03-19T03:57:32Z", "content": "LOS ANGELES (Reuters) - Netflix, the world's dominant streaming service, will not make its TV shows and movies available through Apple's upcoming video offering, Netflix Chief Executive Reed Hastings said on Monday. \r\n \"We prefer to let our customers watch ou… [+1481 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "The most shocking part of HBO's Theranos documentary, 'The Inventor,' according to director Alex Gibney", "description": "HBO's \"The Inventor\" takes a look inside the rise and fall of the blood-testing startup Theranos. Director Alex Gibney talked to Business Insider about the things he was most shocked by while making the movie. Though Oscar-winning filmmaker Alex Gibney has sp…", "url": "https://www.businessinsider.com/hbo-theranos-doc-the-inventor-director-alex-gibney-explains-what-shocked-him-most-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5595ae626bb3f7c96fa73318-1136-568.jpg", "publishedAt": "2019-03-19T03:12:54Z", "content": "Though Oscar-winning filmmaker Alex Gibney has spent a lot of his career exploring stories that focus on the dishonest (\"Enron: The Smartest Guys in the Room\") and the controversial (\"Going Clear: Scientology &amp; the Prison of Belief\"), there are still thin… [+2552 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Choi", "title": "Elizabeth Warren says it's time for Mississippi to adopt a new state flag", "description": "Democratic Sen. Elizabeth Warren of Massachusetts said she believes it is time for Mississippi to disavow its Confederate icons — namely on its state flag. \"I would support removing Confederate celebrations from federal lands and putting them in museums where…", "url": "https://www.businessinsider.com/elizabeth-warren-mississippi-new-state-flag-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c905ad569e11c2c3e5df123-1920-960.jpg", "publishedAt": "2019-03-19T03:00:15Z", "content": "Democratic Sen. Elizabeth Warren of Massachusetts said she believes it is time for Mississippi to disavow its Confederate icons — namely on its state flag. \r\n \"I would support removing Confederate celebrations from federal lands and putting them in museums wh… [+1273 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "Why Theranos founder Elizabeth Holmes wasn't interviewed for HBO's 'The Inventor' documentary", "description": "The disgraced founder of Theranos, Elizabeth Holmes, is not interviewed in the HBO documentary, \"The Inventor: Out for Blood in Silicon Valley\" (which premiered Monday night). Director Alex Gibney told Business Insider about the process of trying to get her t…", "url": "https://www.businessinsider.com/why-theranos-founder-elizabeth-holmes-not-interviewed-in-inventor-hbo-documentary-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bb1f8401d584d6a69b7d9-1136-568.jpg", "publishedAt": "2019-03-19T02:58:00Z", "content": "Though there's a lot of footage of Elizabeth Holmes in Alex Gibney's latest HBO documentary, \"The Inventor: Out for Blood in Silicon Valley,\" which looks at the rise and fall of Holmes' company Theranos, the director never interviewed her on camera. But it wa… [+2930 chars]"}]}