{"status": "ok", "totalResults": 3613, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "The NBA draft stock of one of the top prospects is soaring after he shredded an opponent in one of the biggest upsets of March Madness so far", "description": "Murray State sophomore guard Ja Morant put on a show in the first round of the NCAA Tournament to help the Racers beat No. 5 Marquette. Morant notched the first triple-double in the tournament since Draymond Green in 2012 while showing off his elite athletici…", "url": "https://www.businessinsider.com/ja-morant-nba-soaring-murray-state-march-madness-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94e8f20cf91311900485c2-1334-667.jpg", "publishedAt": "2019-03-22T13:59:27Z", "content": "Ja Morant was already considered a top NBA draft prospect going into the NCAA Tournament, but his stock is now soaring after an impressive first performance. \r\n The sophomore guard notched the first March Madness triple-double since 2012 on Thursday, scoring … [+2316 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Tesla quietly deleted the standard range Model S option from its website (TSLA)", "description": "Tesla has removed the standard range Model S from its website. The company cut prices on the Model S and X this month before raising them again. Tesla has quietly removed the standard range option of a Model S vehicle from its online ordering portal. Previous…", "url": "https://www.businessinsider.com/tesla-removes-standard-range-model-s-from-website-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94e0ef09b60313bc0ebe18-2732-1366.jpg", "publishedAt": "2019-03-22T13:57:38Z", "content": "Tesla has quietly removed the standard range option of a Model S vehicle from its online ordering portal. \r\n Previously, the standard range battery sold for $79,000 as recently as Thursday. Now, the cheapest option, the long range model, begins at $89,500 bef… [+941 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matt Weinberger", "title": "The CEO behind 'Fortnite' used to be one of Microsoft's fiercest critics. Now, he explains why he thinks it's a 'new company' under CEO Satya Nadella. (MSFT)", "description": "Epic Games CEO Tim Sweeney used to be one of Microsoft's harshest critics — in 2016, he penned an op-ed in the Guardian lambasting Microsoft for what he saw as a power grab to take full control of the PC. Now, he's singing the praises of Microsoft, which he c…", "url": "https://www.businessinsider.com/epic-games-ceo-tim-sweeney-microsoft-satya-nadella-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94695c7563b00a25270052-1536-768.jpg", "publishedAt": "2019-03-22T13:52:26Z", "content": "Back in 2016 — well before \"Fortnite: Battle Royale\" hit the scene — Epic Games CEO Tim Sweeney lambasted Microsoft in an op-ed in The Guardian, slamming the Windows 10 app store as \"the most aggressive move Microsoft has ever made.\" \r\n \"With its new Universa… [+4354 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Amir Ismael", "title": "Adidas has launched 'Game of Thrones' Ultra Boosts — here's where to buy them before they sell out for good", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/game-of-thrones-adidas-ultra-boost-price-release-date", "urlToImage": "https://amp.businessinsider.com/images/5c93b8d3daa50703ea061784-960-480.jpg", "publishedAt": "2019-03-22T13:44:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+1220 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andy Kiersz", "title": "The 30 highest-paying jobs in California", "description": "California has an economy bigger than that of most countries. Using data from the Bureau of Labor Statistics, we found the 30 occupations with the highest average salaries in the Golden State. California is one of the largest economies in the world, with a gr…", "url": "https://www.businessinsider.com/the-30-highest-paying-jobs-in-california-2019-3", "urlToImage": "https://amp.businessinsider.com/images/588b66d0475752a0328b4a0f-1920-960.jpg", "publishedAt": "2019-03-22T13:43:18Z", "content": "California is one of the largest economies in the world, with a gross domestic product bigger than that of most countries. The home of Silicon Valley and Hollywood has a booming job market to match. \r\n Using data from the Bureau of Labor Statistics' Occupatio… [+814 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Greg Magana", "title": "Amazon is nixing ads for unprofitable products on its site (AMZN)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here. Amazon has been telling a growing number of third-party sellers on …", "url": "https://www.businessinsider.com/amazon-nixing-unprofitable-product-ads-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c94e53c6b52650f8f654938-750.jpg", "publishedAt": "2019-03-22T13:40:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Amazon has been telling a growing number of third-party sellers o… [+3363 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "George Paul", "title": "Google is relinquishing browser and search engine control in Europe (GOOGL)", "description": "Google announced that it will now prompt Android users in Europe to notify them of their browser and search engine alternatives outside of Google's products, per a company blog post. While Chrome and Google Search will likely remain pre-installed on Android p…", "url": "https://www.businessinsider.com/google-antitrust-concessions-europe-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94dd1509b603137d0f0962-2732-1366.jpg", "publishedAt": "2019-03-22T13:38:17Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Apps and Platforms Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Google announced that it will now prompt Android users in… [+3217 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Green", "title": "Square is making a slew of updates across its product offering (SQ)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Payments Briefing subscribers. To receive the full story plus other insights each morning, click here. Square announced several updates to its offerings that will impact pr…", "url": "https://www.businessinsider.com/square-makes-updates-across-segments-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94deba569b550fb118ecdb-2732-1366.jpg", "publishedAt": "2019-03-22T13:17:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Payments Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Square announced several updates to its offerings that will impact … [+3131 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "These machines pull clean drinking water out of thin air, and they might be a solution to the global water crisis", "description": "March 22 marks World Water Day, a United Nations campaign to raise awareness of the global water crisis. One in four people will face a recurring water shortage by 2050, according to UN estimates. To tackle this crisis, an Israeli company called Watergen has …", "url": "https://www.businessinsider.com/watergen-drinking-water-out-of-thin-air-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93fea0ffcb2703e006b8eb-2732-1366.jpg", "publishedAt": "2019-03-22T13:17:00Z", "content": "World Water Day aims to raise awareness of the global water crisis, which could leave one in four people with a recurring water shortage by 2050. As the global population continues to climb, that means more than 2 billion people could soon be starved for worl… [+4507 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "I tried Betterment, the robo-advisor that made it easy to save money and build wealth", "description": "Betterment is an online financial adviser that helps you invest your money, plan for retirement, start a college fund, and tackle other important financial manners. It costs an annual fee of 0.25% of your investment. I recently tried Betterment and found it e…", "url": "https://www.businessinsider.com/betterment-review-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5ada3c4f19ee8644008b464d-750-375.jpg", "publishedAt": "2019-03-22T13:15:00Z", "content": "Betterment made investing easier for the author.\r\n Brendan McDermid/Reuters \r\n Planning for retirement can be outright daunting. \r\n It can seem like a harrowing challenge to set up an investment account or roll over a 401(k), especially if you're new to the w… [+954 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lucia Moses", "title": "Samsung fires marketing staff following internal audit — sources", "description": "Samsung Electronics America has fired staff following an internal audit over gifting practices, according to two people familiar with the situation. Two people said the cuts represented most of the US marketing staff, although another person put the number at…", "url": "https://www.businessinsider.com/samsung-fires-marketing-staff-following-internal-audit-sources-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94d31386291310a21edbe3-2732-1366.jpg", "publishedAt": "2019-03-22T13:00:15Z", "content": "Samsung Electronics America, one of the world's biggest marketers, has fired most of its US marketing staff following an audit over gifting practices, according to two people familiar with the situation. \r\n It's unclear exactly how many people were impacted. … [+2795 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "Nintendo's lineup of independent games for the Switch is full of welcome surprises — including a 'Stranger Things' game (NTDOY)", "description": "Nintendo recently announced nearly 20 independent games coming to the Nintendo Switch later this year. \"Cuphead,\" \"Stranger Things 3,\" and an unexpected music game based on \"The Legend of Zelda\" lead an interesting list of upcoming releases. The Switch has be…", "url": "https://www.businessinsider.com/upcoming-nintendo-switch-indie-games-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94056577584e05221b1ff8-2732-1366.jpg", "publishedAt": "2019-03-22T13:00:00Z", "content": "Nintendo has bolstered the lineup of the Switch with a healthy slate of indie games in its first two years, and independent developers are finding new opportunities with the portable hybrid console. \r\n During a special \"Nindies\" presentation on Wednesday, Nin… [+847 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Clancy Morgan", "title": "7 sneaky ways fast food restaurants get you to spend more money", "description": "Do you ever find yourself spending more on fast food than you expected to? Fast food is getting more expensive, outpacing fine dining and fast casual restaurants. Combos, add-ons, and multiple size options are just a few of the tricks used by fast food restau…", "url": "https://www.businessinsider.com/fast-food-mcdonalds-burger-king-restaurants-spend-more-money-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8aa751113a503cca75bf55-1920-960.png", "publishedAt": "2019-03-22T13:00:00Z", "content": "Following is a transcript of the video.\r\nNarrator: This is a Number 3 from McDonald's: a burger, fries, and a drink. It costs $11 in New York City. Fast food is supposed to be cheap and convenient, but do you ever find yourself spending more on fast food than… [+6333 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Anna Baluch", "title": "4 money lessons my parents taught me as a kid that made me good with money today", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, but our reporting and recommendations are always independent and objective. Anna Baluch…", "url": "https://www.businessinsider.com/money-lessons-from-my-parents-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c87ce7526289868986cf57f-2732-1366.jpg", "publishedAt": "2019-03-22T12:45:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, but our reporting and recommendations are always independent and objective. My parents … [+3684 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "Shaq is investing in 9 Papa John's locations and joining the pizza chain's board (PZAA)", "description": "Shaquille O'Neal is joining Papa John's board of directors and investing in nine Atlanta area locations. Papa John's shares were up more than 3% following the news. Watch Papa John's trade live. The NBA Hall of Famer Shaquille O'Neal is joining Papa John's bo…", "url": "https://markets.businessinsider.com/news/stocks/papa-johns-pizza-shaquille-oneal-investment-joining-board-2019-3-1028051965", "urlToImage": "https://images.markets.businessinsider.com/image/5acbaaf06898752c008b4cc9-1992/ap01061505289.jpg", "publishedAt": "2019-03-22T12:41:00Z", "content": "Mark J. Terrill/AP\r\nShaquille O'Neal is joining the Papa John's board of directors and is investing in nine Atlanta-area locations, the company said Friday.\r\nPapa John's shares were up more than 3% after the news.\r\nWatch Papa John's trade live.\r\nThe NBA Hall … [+1749 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "Shaq is investing in 9 Papa John's locations and joining the pizza chain's board (PZAA)", "description": "Shaquille O'Neal is joining Papa John's board of directors and investing in nine Atlanta area locations. Papa John's shares were up more than 3% following the news. Watch Papa John's trade live. The NBA Hall of Famer Shaquille O'Neal is joining Papa John's bo…", "url": "https://www.businessinsider.com/papa-johns-pizza-shaquille-oneal-investment-joining-board-2019-3", "urlToImage": "https://images.markets.businessinsider.com/image/5acbaaf06898752c008b4cc9-1992/ap01061505289.jpg", "publishedAt": "2019-03-22T12:41:00Z", "content": "Mark J. Terrill/AP\r\nThe NBA Hall of Famer Shaquille O'Neal is joining Papa John's board of directors and investing in nine locations in the Atlanta area, the company said Friday. He will also become  a brand ambassador for the pizza chain. \r\n\"We are thrilled … [+313 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Charlie Wood", "title": "Google is refusing to shut down a gay conversion therapy app that has already been banned by Apple, Amazon, and Microsoft", "description": "Google is resisting calls to remove what appears to be a gay conversion therapy app from the Play Store. Apple, Amazon, and Microsoft have all banned the app, created by US Christian group Living Hope Ministries. A petition on change.org calling for the app's…", "url": "https://www.businessinsider.com/google-refuses-to-shut-down-gay-conversion-app-living-hope-ministries-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94b64909b603106d5b5812-2732-1366.jpg", "publishedAt": "2019-03-22T12:34:23Z", "content": "Google is resisting pressure to remove what appears to be a gay conversion therapy app from the Play Store after Apple, Amazon, and Microsoft all banned the service. \r\n The app in question is the creation of US Christian group, Living Hope Ministries. It is e… [+1910 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Beatrice Christofaro", "title": "North and South Korea's peace process takes a major backward step as Pyongyang pulls out of DMZ liaison office", "description": "North Korea abruptly pulled out of a liaison office set up to improve inter-Korean relations, South Korea said on Friday. The joint office was established last September to improve relations and allow regular communication between the rivals. Pyongyang's with…", "url": "https://www.businessinsider.com/north-korea-pulls-out-of-dmz-liasion-office-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94d3438e436a109b254aa4-1536-768.jpg", "publishedAt": "2019-03-22T12:32:45Z", "content": "North Korea abruptly withdrew from a liaison office that allowed it to communicate with South Korea, marking a major setback to the ongoing peace talks between the historic rivals. \r\n South Korea's Unification Ministry announced Pyongyang's decision on Friday… [+3737 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jake Kanter", "title": "Mark Zuckerberg's big vision for Facebook could have hugely damaging consequences — and he knows it", "description": "Facebook CEO Mark Zuckerberg wants to recast himself as the guardian of people's privacy — but it could come at a cost to safety on his platform. The shift to encrypted messaging will make it much harder to detect the spread of hideous videos, like the one of…", "url": "https://www.businessinsider.com/facebook-privacy-pivot-safety-concerns-new-zealand-attack-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c6e667d2628987fa91107e2-1334-667.jpg", "publishedAt": "2019-03-22T12:24:36Z", "content": "It's almost a year to the day since the revelation that the data of millions of Facebook users made its way into the hands of Cambridge Analytica, which weaponized the information to Donald Trump's benefit in 2016. \r\n The fallout from the scandal continues to… [+6193 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Slotnick", "title": "AmEx Platinum cardholders get up to $200 in Uber credits every year — here's how the perk works", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/how-to-use-amex-platinum-uber-credit", "urlToImage": "https://amp.businessinsider.com/images/5c94cadfee52ef1025494772-1920-960.jpg", "publishedAt": "2019-03-22T11:51:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+1617 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tom Murray", "title": "Priyanka Chopra says she had a 'freakout moment' before walking down the aisle, and that Nick Jonas cried more than her at their wedding", "description": "Priyanka Chopra had a bit of a wobble before her marriage to Nick Jonas in December, the actress told Andy Cohen on \"Watch What Happens Live\" on Thursday night. \"I was about 40 minutes late because I was just like: '... do I even know what I'm doing?'\" She to…", "url": "https://www.businessinsider.com/priyanka-chopra-had-freakout-moment-before-marrying-nick-jonas-2019-3", "urlToImage": null, "publishedAt": "2019-03-22T11:50:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson", "title": "There's a theory that Drake stops the athletes and teams he supports from winning, but unbeaten boxer Anthony Joshua thinks he can break the curse forever", "description": "Anthony Joshua says he will KO the Drake curse forever. The smash hit rapper seemingly has a habit of lending his support to a team or athlete, only for them to end up losing. Drake famously draped himself in the Irish flag next to the UFC fighter Conor McGre…", "url": "https://www.businessinsider.com/anthony-joshua-confident-he-can-break-drake-curse-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94c7d1ee52ef0faf42b81d-1136-568.jpg", "publishedAt": "2019-03-22T11:36:00Z", "content": "Anthony Joshua is confident he can break the Drake curse. \r\n The Drake jinx is apparently a very real thing in sports as the popular rapper, renowned for his smash hit singles like \"Back to Back,\" \"In My Feelings,\" and \"Nonstop,\" seemingly has a habit of back… [+2709 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "Tiffany misses on sales, shares slump 5% (TIF)", "description": "Tiffany reported fourth-quarter sales that fell short of Wall Street estimates. Shares fell 5% early Friday. Watch Tiffany trade live. The luxury retailer Tiffany on Friday reported fourth-quarter sales that fell short of Wall Street estimates, sending shares…", "url": "https://www.businessinsider.com/tiffany-and-co-earnings-sales-miss-expectations-stock-slides-2019-3", "urlToImage": "https://amp.businessinsider.com/images/57befba309d2935f0f8b45b7-2732-1366.jpg", "publishedAt": "2019-03-22T11:35:00Z", "content": "The luxury retailer Tiffany on Friday reported fourth-quarter sales that fell short of Wall Street estimates, sending shares down 4% ahead of the opening bell. \r\n Tiffany said revenue totaled $1.32 billion, just missing the $1.33 billion that analysts surveye… [+1159 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "Tiffany misses on sales, shares slump 5% (TIF)", "description": "Tiffany reported fourth-quarter sales that fell short of Wall Street estimates. Shares fell 5% early Friday. Watch Tiffany trade live. The luxury retailer Tiffany on Friday reported fourth-quarter sales that fell short of Wall Street estimates, sending shares…", "url": "https://markets.businessinsider.com/news/stocks/tiffany-and-co-earnings-sales-miss-expectations-stock-slides-2019-3-1028051740", "urlToImage": "https://images.markets.businessinsider.com/image/57befb8d09d29323008b464a-2400/ap_080530044819.jpg", "publishedAt": "2019-03-22T11:35:00Z", "content": "AP Images/Paul Sakuma\r\nThe luxury retailer Tiffany on Friday reported fourth-quarter sales that fell short of Wall Street estimates, sending shares down 4% ahead of the opening bell. \r\nTiffany said revenue totaled $1.32 billion, just missing the $1.33 billion… [+1175 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "How Salt Bae's debt-laden steakhouse is highlighting major issues in Turkey's economy", "description": "Viral meme sensation and chef Nusret Gökçe, more commonly known as Salt Bae, has some serious issues piling up at his restaurant in Dubai frequented by celebrities and sports stars. The steakhouse chain's owner, Turkish firm Dogus Holdings, is struggling to r…", "url": "https://www.businessinsider.com/turkish-economy-salt-bae-is-having-debt-troubles-with-his-steakhouse-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94b33909b603103a6c2423-1920-960.jpg", "publishedAt": "2019-03-22T11:21:00Z", "content": "The company which owns the steakhouse chain popularized by viral meme sensation and chef Nusret Gökçe, aka Salt Bae, is struggling to repay its debts amid a major restructuring. \r\n Nusr-Et, a restaurant famed for its videos of celebrities eating there, is own… [+1246 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanya Dua", "title": "Big brands including Mastercard, Visa, and Pandora are all trying to conquer sonic branding, the latest frontier in digital advertising", "description": "Major brands including Visa, Mastercard and Pandora are increasingly using sound to reinforce their brand identities and positioning, just as they would use certain colors, designs or words. While sonic branding isn't new, the rise of smartphones, voice techn…", "url": "https://www.businessinsider.com/big-brands-mastercard-pandora-are-trying-to-conquer-sonic-branding-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93f5b07563b0022319d0c3-2732-1366.jpg", "publishedAt": "2019-03-22T11:00:00Z", "content": "Last month, Linkin Park's Mike Shinoda collaborated with other artists and musicians around the world on a new project. It wasn't an album or a concert — but rather, a sonic melody for Mastercard. \r\n The resulting tune — which Mastercard plans to use everywhe… [+4753 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "German manufacturing just slumped to the lowest level since the financial crisis — and it's a major warning sign for the global economy", "description": "US and European stock markets fell after a survey of German manufacturers delivered its lowest reading since the financial crisis. The German PMI fell from 47.6 in February to 44.7 in March due to sharp declines in new orders, lower work backlogs, and firings…", "url": "https://markets.businessinsider.com/news/stocks/german-pmi-manufacturing-data-worst-since-the-financial-crisis-2019-3-1028051605", "urlToImage": "https://images.markets.businessinsider.com/image/5c94b80316c9580d0838a4d4-2009/rtxpsug.jpg", "publishedAt": "2019-03-22T10:58:35Z", "content": "US and European stock markets fell after a survey of German manufacturers delivered its lowest reading since the financial crisis.\r\nThe German PMI fell from 47.6 in February to 44.7 in March due to sharp declines in new orders, lower work backlogs, and firing… [+2773 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "German manufacturing just slumped to the lowest level since the financial crisis — and it's a major warning sign for the global economy", "description": "US and European stock markets fell after a survey of German manufacturers delivered its lowest reading since the financial crisis. The German PMI fell from 47.6 in February to 44.7 in March due to sharp declines in new orders, lower work backlogs, and firings…", "url": "https://www.businessinsider.com/german-pmi-manufacturing-data-worst-since-the-financial-crisis-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94b82916c9580d0838a4d5-1920-960.jpg", "publishedAt": "2019-03-22T10:58:35Z", "content": "Stocks tumbled on Friday after a closely watched survey of German manufacturers delivered its lowest reading since the financial crisis. \r\n Germany's manufacturing Purchasing Managers' Index (PMI) plunged from 47.6 in February to 44.7 in March. A survey readi… [+2320 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "10 things you need to know before the opening bell (SPY, SPX, QQQ, DIA, TSLA, BA, NKE, LEVI)", "description": "Here is what you need to know. Brexit gets a short delay. The EU has agreed to delay Brexit until April 12 if MPs don't vote for Prime Minister Theresa May's deal and until May 22 if they do. Indonesia's flagship airline cancels its Boeing 737-Max orders. Gar…", "url": "https://www.businessinsider.com/stock-market-news-opening-bell-march-22-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94bdbe16c9580d423b06a7-2732-1366.jpg", "publishedAt": "2019-03-22T10:52:00Z", "content": "Here is what you need to know. \r\n Brexit gets a short delay. The EU has agreed to delay Brexit until April 12 if MPs don't vote for Prime Minister Theresa May's deal and until May 22 if they do. \r\n Indonesia's flagship airline cancels its Boeing 737-Max order… [+1715 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "10 things you need to know before the opening bell (SPY, SPX, QQQ, DIA, TSLA, BA, NKE, LEVI)", "description": "Here is what you need to know. Brexit gets a short delay. The EU has agreed to delay Brexit until April 12 if MPs don't vote for Prime Minister Theresa May's deal and until May 22 if they do. Indonesia's flagship airline cancels its Boeing 737-Max orders. Gar…", "url": "https://markets.businessinsider.com/news/stocks/stock-market-news-opening-bell-march-22-2019-2019-3-1028051576", "urlToImage": "https://images.markets.businessinsider.com/image/5c94bda90cf9130d6612503d-2400/ap19080843343962.jpg", "publishedAt": "2019-03-22T10:52:00Z", "content": "AP/Frank Augstein\r\nHere is what you need to know. \r\nBrexit gets a short delay. The EU has agreed to delay Brexit until April 12 if MPs don't vote for Prime Minister Theresa May's deal and until May 22 if they do.  \r\nIndonesia's flagship airline cancels its Bo… [+1726 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "The star investor in 'The Big Short' is betting against Canadian banks", "description": "Steve Eisman, the hedge fund manager famous for betting against the US housing market ahead of the 2008 crash, is sounding the alarm on the Canadian housing market. Eisman, a portfolio manager at Neuberger Berman, was played by Steve Carell in the movie \"The …", "url": "https://www.businessinsider.com/the-star-investor-in-the-big-short-is-betting-against-canadian-banks-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b1155c71ae6624f008b471f-1136-568.jpg", "publishedAt": "2019-03-22T10:35:19Z", "content": "Steve Eisman, the hedge-fund manager famous for betting against the US housing market ahead of the 2008 crash, is sounding the alarm on the Canadian market. \r\n In an interview with the Financial Times, Eisman said: \"I'm calling for a simple normalization of c… [+1697 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Trista Kelley", "title": "Tyson is recalling 69,000 pounds of chicken strips after customers complained they contained metal", "description": "Tyson Foods recalled 69,000 pounds of chicken strips that may be contaminated with metal. The USDA's food safety unit announced the recall on its website. In January, Tyson recalled 18 tons of chicken nuggets. Tyson Foods is recalling about 69,000 pounds of c…", "url": "https://www.businessinsider.com/tyson-recalls-69000-pounds-of-chicken-strips-customers-found-metal-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94b344dc67670c213b7245-2732-1366.jpg", "publishedAt": "2019-03-22T10:35:10Z", "content": "Tyson Foods is recalling about 69,000 pounds of chicken strips that may be contaminated with pieces of metal. \r\n US Department of Agriculture's Food Safety and Inspection Service announced the recall on its website late Thursday, saying that it affects the Ar… [+1147 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alexandra Ma", "title": "Indonesia's flagship airline cancels $5 billion order for 49 Boeing 737 Max 8 jets after deadly crashes (BA)", "description": "Garuda, Indonesia's flagship airline, asked to cancel a $5 billion order for 49 Boeing 737 Max 8 jets in light of two deadly crashes involving the aircraft in five months. \"Garuda passengers in Indonesia have lost trust and no longer have the confidence\" in t…", "url": "https://www.businessinsider.com/indonesia-garuda-airline-cancels-5bn-boeing-737-max-8-order-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94a9d22cc7400cc07063e2-1136-568.jpg", "publishedAt": "2019-03-22T09:57:44Z", "content": "Indonesia's flagship airline has asked to cancel a $5 billion order of 49 Boeing 737 Max 8 jets, saying it's customers had \"lost trust\" in the plane after two of them crashed within five months of each other. \r\n Ikhsan Rosan, a spokesman for Garuda airline, t… [+3049 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosie Perper", "title": "Mike Pompeo says it's 'certainly' possible that Trump may be the modern-day savior of the Jewish people", "description": "Secretary of State Mike Pompeo said it is \"certainly\" possible that President Donald Trump may be the modern-day savior of the Jewish people. Speaking to the Christian Broadcasting Network in Jerusalem on Thursday, Pompeo said Trump may be poised to defend ag…", "url": "https://www.businessinsider.com/pompeo-says-trump-may-be-modern-day-jewish-savior-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a27fe88f914c347018b82f8-750-375.jpg", "publishedAt": "2019-03-22T08:29:34Z", "content": "Secretary of State Mike Pompeo said it is \"certainly\" possible that President Donald Trump may be the modern-day savior of the Jewish people. \r\n Speaking to the Christian Broadcasting Network in Jerusalem on Thursday, Pompeo said Trump may be poised to defend… [+1879 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "10 things in tech you need to know today", "description": "Good morning! This is the tech news you need to know this Friday. Weeks before an Amazon Air plane crashed in February killing all 3 people on board, several pilots said they thought an accident was inevitable. Business Insider spoke with 13 pilots who work o…", "url": "https://www.businessinsider.com/10-things-in-tech-you-need-to-know-today-march-22-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c948e05dc67670ac70e79f5-1536-768.jpg", "publishedAt": "2019-03-22T07:36:49Z", "content": "Pilots who fly or have flown planes for Amazon air told Business Insider an accident was inevitable.\r\n Ted S. Warren/AP \r\nGood morning! This is the tech news you need to know this Friday. \r\n Weeks before an Amazon Air plane crashed in February killing all 3 p… [+2634 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Associated Press", "title": "President Jimmy Carter reaches new milestone: longest-lived US president - Business Insider", "description": "President Jimmy Carter reaches new milestone: longest-lived US president Business Insider Nearly four decades after voters unceremoniously rejected then-President Jimmy Carter's bid for a second term, the 39th president has reached a milestone that...", "url": "https://www.businessinsider.com/jimmy-carter-longest-lived-us-president-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9477e209b6030dbb065832-1920-960.jpg", "publishedAt": "2019-03-22T06:01:15Z", "content": "ATLANTA (AP) — Nearly four decades after voters unceremoniously rejected then-President Jimmy Carter's bid for a second term, the 39th president has reached a milestone that electoral math cannot dispute: He is now the longest-living chief executive in Americ… [+4247 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sarah Gray", "title": "Jared Kushner is under the microscope again, accused of using WhatsApp for official White House duties", "description": "Jared Kushner, President Donald Trump's son-in-law and White House senior adviser, is under scrutiny from the House Oversight and Reform Committee, over his alleged use of the encrypted messaging app WhatsApp for official White House communication. Trump's da…", "url": "https://www.businessinsider.com/jared-kushner-using-whatsapp-for-official-white-house-work-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c945342569b550993244d53-1334-667.jpg", "publishedAt": "2019-03-22T03:15:27Z", "content": "Jared Kushner, President Donald Trump's son-in-law and White House senior adviser, is under scrutiny from the House Oversight and Reform Committee, over his alleged use of the encrypted messaging app WhatsApp for official White House communication. \r\n Trump's… [+5709 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Choi", "title": "Trump reportedly thinks he won't get much blowback for his repeated insults toward John McCain", "description": "President Donald Trump is confident the late Republican Sen. John McCain was not as admired among his supporters, and believes there will be no lasting consequences for his repeated attacks, according to a senior official cited in a Washington Post report. Du…", "url": "https://www.businessinsider.com/trump-and-john-mccain-feud-comments-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9417eeee52ef0703362523-1920-960.jpg", "publishedAt": "2019-03-22T00:37:11Z", "content": "President Donald Trump is confident the late Republican Sen. John McCain was not as admired among his supporters, and believes there will be no lasting consequences for his repeated attacks, according to a senior official cited in a Washington Post report pub… [+3610 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "Someone is selling a Silicon Valley investor 'starter kit' as a joke about how venture capitalists all dress the same", "description": "Silicon Valley investors are known for their business savvy, but not necessarily their fashion sense. A new site, called VC Starter Kit, lampoons what's seen as the tech investor uniform: You can buy a Patagonia sweater, Allbirds sneakers, and a handful of ot…", "url": "https://www.businessinsider.com/vc-starter-kit-patagonia-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93fa0009b603034c3cc108-960-480.jpg", "publishedAt": "2019-03-22T00:34:37Z", "content": "The best venture capitalists are known for their ability to look at all the very many tech startups out there and pick out winners like Facebook or Uber. \r\n They are not necessarily known for their unique fashion sense. \r\n Enter VC Starter Pack, a gentle sati… [+2679 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julie Bort", "title": "Oracle quietly held a round of layoffs this week (ORCL)", "description": "Oracle laid off an unspecified number of people this week. The cuts happened across the company but they also occurred in a segment of Oracle's cloud business, according to online chatter. This is not unusual for Oracle, which has held major layoffs every yea…", "url": "https://www.businessinsider.com/oracle-layoffs-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c2626a5bd773051cc581552-1920-960.jpg", "publishedAt": "2019-03-21T23:41:33Z", "content": "Oracle laid off an unspecified number of people this week. The company did not formally announce its restructuring plans, including any indication how many jobs it would peel, and made no mention of the planned cuts when it reported earnings last week. \r\n The… [+4277 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Becky Peterson", "title": "Uber reportedly chooses the NYSE for IPO as competitor Lyft gears up to list on NASDAQ", "description": "Uber has chosen the New York Stock Exchange for its upcoming IPO, according to Bloomberg. The ride-hailing company is expected to publicly file for an IPO in April at a valuation that could hit as high as $120 billion. Meanwhile, Uber's rival Lyft is revving …", "url": "https://www.businessinsider.com/uber-listing-nyse-ipo-as-lyft-gears-up-for-nasdaq-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b1552531ae66219008b4824-1920-960.jpg", "publishedAt": "2019-03-21T23:36:51Z", "content": "The competition between Uber and Lyft has no bounds. \r\n Just days before Lyft is set to go public on the Nasdaq, Uber has chosen the rival New York Stock Exchange (NYSE) for its own forthcoming initial public offering (IPO), according to Bloomberg. \r\n Uber, w… [+927 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matt Weinberger", "title": "The new CEO of Intuit says the rise of artificial intelligence will be as big of a challenge as the company's shift to cloud computing (INTU)", "description": "Sasan Goodarzi stepped up as CEO of Intuit — the company behind products like Intuit and TurboTax — in January, replacing 11-year chief exec Brad Smith. Smith gets a ton of credit from parties inside and outside Intuit for helping the company successfully nav…", "url": "https://www.businessinsider.com/intuit-ceo-sasan-goodarzi-ai-microsoft-ceo-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92864a5b066e4cbc4cf0b3-2732-1366.jpg", "publishedAt": "2019-03-21T22:49:38Z", "content": "Sasan Goodarzi has some big shoes to fill, three months or so into his reign as CEO of $66.5 billion Intuit. \r\n His predecessor, Brad Smith, successfully shepherded Intuit into the cloud computing era during an 11-year tenure, delivering huge growth in the su… [+8177 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lauren Johnson", "title": "Amazon is finally letting brands track traffic from Facebook in its latest effort to cozy up to big marketers", "description": "Amazon is letting marketers measure store traffic that comes from Facebook, which advertisers have been clamoring for. The e-commerce giant is also rolling out autoplay video features for stores and new metrics. As Amazon's ad business grows, it's been on a m…", "url": "https://www.businessinsider.com/amazon-is-letting-brands-track-facebook-traffic-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c940d26862913061933e8a4-960-480.jpg", "publishedAt": "2019-03-21T22:43:00Z", "content": "As part of its ongoing effort to show brand marketers it can do more than crank out conversions, Amazon is starting to let brands track traffic that comes to their pages from Facebook. \r\n Amazon said in a blog post that it's rolling out new metrics and featur… [+2480 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Trump says it's time for the US to recognize Israel's annexation of Golan Heights, something 9 previous presidents refused to do", "description": "President Donald Trump on Thursday said it's time for the US to recognize the Golan Heights, one of the globe's most disputed territories, as part of Israel. Trump tweeted, \"After 52 years it is time for the United States to fully recognize Israel’s Sovereign…", "url": "https://www.businessinsider.com/trump-says-us-should-recognize-israeli-annexation-of-golan-heights-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c940afc569b55051936ad95-1920-960.jpg", "publishedAt": "2019-03-21T22:37:10Z", "content": "President Donald Trump on Thursday said it's time for the US to \"fully recognize\" Israel's annexation of the Golan Heights, breaking a precedent set by nine previous administrations. \r\n Trump tweeted, \"After 52 years it is time for the United States to fully … [+1654 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ashlyn Gentry, Contributor", "title": "The attention economy is breeding addiction, fraud, and hate — and this is what we need to do to save it", "description": "Ashlyn Gentry is a managing director at Human Ventures Co. In this op-ed, she says that whether we want to or not, we're living in an \"attention economy\" — and that it's damaging us as a global community. To fix this, business must prove that it’s possible to…", "url": "https://www.businessinsider.com/broken-attention-economy-op-ed-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93bdef5b066e6339072210-1136-568.jpg", "publishedAt": "2019-03-21T22:16:20Z", "content": "You are worth trillions. \r\n Got your attention yet? \r\n Every time you pick up your phone, turn on a screen, or open an app, you are for sale. It's perhaps the most influential economic force on the planet, yet few have been able to define its importance. \r\n W… [+6531 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Owen Burke", "title": "11 smarter buys that can help curb your plastic bottle use — from a $32 reusable water bottle to a $210 filtration system", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/how-to-stop-using-plastic-water-bottles", "urlToImage": "https://amp.businessinsider.com/images/5c93d449daa50706af115da8-2732-1366.jpg", "publishedAt": "2019-03-21T22:10:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1760 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Askinasi", "title": "The worst fashion trends everyone was obsessed with the year you were born, according to experts", "description": "New fashion trends come out with the turn of every season — they then walk off the runway into stores and finally our closets. But just because something is on the runway doesn't mean it should be in your wardrobe. There have been countless fashion mishaps th…", "url": "https://www.businessinsider.com/worst-fashion-trends-from-every-decade-2019-3", "urlToImage": null, "publishedAt": "2019-03-21T22:02:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Elon Musk just emailed every single Tesla employee that car deliveries should be their 'primary priority' in what he's calling the biggest wave in company history (TSLA)", "description": "Tesla is racing to deliver cars before the end of the first quarter on March 31. Elon Musk told all employees in an email seen by Business Insider that deliveries should be their \"top priority.\" As the company ramps up sales in Europe and China in addition to…", "url": "https://www.businessinsider.com/elon-musk-tesla-workers-car-deliveries-should-primary-priority-leaked-email-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c940575ffcb2704a01f3559-750.jpg", "publishedAt": "2019-03-21T21:49:07Z", "content": "Elon Musk sent an email to all Tesla employees on Thursday afternoon informing them that car deliveries should be everyone's top priority until the end of the quarter on March 31. \r\n Business Insider viewed a copy of the email, which was sent under the subjec… [+2529 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nisha Stickles", "title": "An attorney explains why she thinks the students involved in the college admissions scandal probably knew about it", "description": "Thirty-three parents were indicted for paying up to $6.5 million in bribes to get their children admitted into top colleges in the recent college admissions scandal. Rick Singer, the alleged ringleader of the $25 million scam, claims the students involved did…", "url": "https://www.businessinsider.com/college-admissions-scandal-attorney-explains-why-students-probably-knew-opinion-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fed386123ca16000c78c3-1136-568.jpg", "publishedAt": "2019-03-21T21:26:19Z", "content": "The wealth and fraud at display in the college-admissions controversy has stirred conversations about privilege and the flaws within the application process. Thirty-three parents have been indicted for paying to fabricate their children's credentials to bypas… [+3600 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bob Bryan", "title": "Alexandria Ocasio-Cortez suggested members of Congress should get paid more, but a majority of Americans want the complete opposite", "description": "Rep. Alexandria Ocasio-Cortez suggested that the salaries for members of Congress should be increased to ease the financial burden on members and decrease the incentive to cheat. But according to an INSIDER poll, 55% of Americans actually think Congress shoul…", "url": "https://www.businessinsider.com/americans-disagree-alexandria-ocasio-cortez-congress-pay-increase-poll-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93f0f777584e019c1cb044-1536-768.jpg", "publishedAt": "2019-03-21T21:18:56Z", "content": "Rep. Alexandria Ocasio-Cortez, the freshman Democrat who has taken Congress by storm, recently advocated for a salary bump for Congress. But a majority of Americans actually want to see lawmakers pay get cut. \r\n Ocasio-Cortez first brought attention to the fi… [+4339 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matt Weinberger", "title": "The CEO behind 'Fortnite' says the entire video game industry is missing the 'inevitable' trend as the barriers between consoles and smartphones get obliterated", "description": "Tim Sweeney, the CEO of Epic Games, tells Business Insider that the success of \"Fortnite\" shows that there's no such thing as a \"mobile gamer\" or a \"console gamer\" anymore — there's just gamers. That's a big part of why the company this week launched Epic Onl…", "url": "https://www.businessinsider.com/epic-games-ceo-tim-sweeney-cross-play-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c27a713bd7730708b2afe93-2560-1280.jpg", "publishedAt": "2019-03-21T21:12:16Z", "content": "Last year, Epic Games successfully convinced Sony to allow players of its smash-hit game \"Fortnite\" to battle each other across PlayStation and Xbox— a big win, given that Sony had publicly resisted this so-called cross-play. \r\n At this week's GDC, Epic doubl… [+6316 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christopher Woody, Samantha Lee and Skye Gould", "title": "'El Chapo' Guzman's reign is finally at an end — here's how he compares to Colombian kingpin Pablo Escobar", "description": "Over the past 50 years, two criminal groups have dominated the global drug trade: the Medellin and Sinaloa cartels. Each has been led by a commanding figure: Medellin's Pablo Escobar and Sinaloa's Joaquin \"El Chapo\" Guzman. Their reigns have come to an end, b…", "url": "https://www.businessinsider.com/how-pablo-escobar-and-el-chapo-guzman-compare-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93dc7de0575a60b26ccb04-1136-568.jpg", "publishedAt": "2019-03-21T21:00:38Z", "content": "Since the late 1970s, two men have emerged as the most powerful and most dangerous drug lords in the world. \r\n Pablo Escobar, a farmer's son from rural Colombia, and Joaquin \"El Chapo\" Guzman, a product of Mexico's rugged Sierra Madre mountains, delivered imm… [+12510 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "A baseball coach struggled to hide his smile after his son hit a huge home run for the opposing team", "description": "Arizona Diamondbacks prospect Alek Thomas hit a massive three-run home run against the Chicago White Sox in a spring training game on Wednesday night. Thomas' father, who works for the White Sox, tried and failed to hide his smile at his son's success at his …", "url": "https://www.businessinsider.com/white-sox-coach-smiles-son-hits-home-run-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93ebe17563b0008863be63-1920-960.jpg", "publishedAt": "2019-03-21T20:44:39Z", "content": "The spring training game between the Arizona Diamondbacks and Chicago White Sox turned into a family affair on Wednesday night, with 18-year-old Diamondbacks prospect Alek Thomas in one dugout and his father, White Sox director of conditioning Allen Thomas, i… [+1249 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Slotnick", "title": "Having a Delta credit card gets you priority boarding every time you fly the airline — here's what you need to know", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/how-to-get-priority-boarding-delta-amex", "urlToImage": "https://amp.businessinsider.com/images/5c93e447daa50707d6035978-1920-960.jpg", "publishedAt": "2019-03-21T20:36:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+2515 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ryan Pickrell", "title": "The Marine Corps' top general says Trump's deployments to US-Mexico border are hurting combat readiness", "description": "The head of the Marine Corps told the acting secretary of defense and the secretary of the Navy that border deployments and other unplanned expenses were hurting combat readiness. Marine Corps Commandant Gen. Robert Neller stressed that these unplanned costs …", "url": "https://www.businessinsider.com/top-marine-warns-trump-border-deployments-put-readiness-at-risk-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93eda4569b5500bc4f1e02-960-480.jpg", "publishedAt": "2019-03-21T20:35:07Z", "content": "President Donald Trump's decision to send troops to the southern border and funding transfers following the declaration of a national emergency pose an \"unacceptable risk to Marine Corps combat readiness and solvency,\" the Marine Corps commandant warned this … [+3142 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Slotnick", "title": "I hate flying in basic economy — but there's an easy hack to get around some of the restrictions on American, Delta, and United flights", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/airline-credit-card-hack-for-basic-economy-flights-2018-5", "urlToImage": "https://amp.businessinsider.com/images/5b105b991ae6624e008b499b-750-375.jpg", "publishedAt": "2019-03-21T20:31:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+1846 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "How to remove the SIM card from your iPhone", "description": "Remove a SIM card from one iPhone and move it to another device in order to make and receive calls there to your existing phone number. iPhone SIM cards only store small amounts of customer data, including your phone number and billing information. They do no…", "url": "https://www.businessinsider.com/how-to-remove-sim-card-from-iphone", "urlToImage": "https://amp.businessinsider.com/images/5c93e4d0daa50708ab533356-2732-1366.jpg", "publishedAt": "2019-03-21T20:28:00Z", "content": "Whether you're selling your old iPhone, trading it in for a new model, or sending it away for repairs, it's important that you remove the phone's SIM card. \r\n A SIM card — or Subscriber Identity Module card — is both a phone's ID tag and its key. SIM cards st… [+2405 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "New Mexico State loses in March Madness after player passes up wide-open, game-tying layup in the final seconds in wild finish", "description": "The Auburn Tigers beat the New Mexico State Aggies in the first round of March Madness in a wild finish. With six seconds remaining, trailing by two, Aggies guard AJ Harris went the length of the court and appeared to have a wide-open layup, only to pass the …", "url": "https://www.businessinsider.com/new-mexico-state-loses-auburn-march-madness-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c93f006862913015a2cf894-750.jpg", "publishedAt": "2019-03-21T20:14:08Z", "content": "New Mexico State nearly gave us the first big upset of March Madness, if not for a player's baffling decision. \r\n With six seconds remain, the New Mexico State Aggies trailed the Auburn Tigers, 76-78. \r\n New Mexico guard AJ Harris went the length of the court… [+985 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Bernie Sanders starts a fight with the NRA, says US should 'follow New Zealand's lead' and ban assault weapons", "description": "Sen. Bernie Sanders sparked ire from the NRA after calling for the US to follow New Zealand's leader and ban assault weapons. \"This is what real action to stop gun violence looks like,\" Sanders said in a tweet on Wednesday. \"We must follow New Zealand's lead,…", "url": "https://www.businessinsider.com/bernie-sanders-says-us-should-follow-new-zealand-ban-assault-weapons-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93e731daa5070907359c34-2732-1366.jpg", "publishedAt": "2019-03-21T20:04:45Z", "content": "Sen. Bernie Sanders called for the US to \"take on the NRA\" and follow New Zealand's example by banning assault weapons, which drew blowback from the National Rifle Association (NRA). \r\n \"This is what real action to stop gun violence looks like,\" Sanders said … [+1926 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Thomas Colson", "title": "UK will be forced to accept US food standards in a Brexit trade deal with Trump, warns former trade chief", "description": "The UK would have to bend to US demands in any post-Brexit trade deal, the former boss of Liam Fox’s international trade department has warned in an interview with Business Insider. Agricultural goods will form a major part of any UK-US deal. US trade rules a…", "url": "https://www.businessinsider.com/uk-will-accept-us-food-standards-in-post-brexit-trade-deal-with-trump-sir-martin-donnelly-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c4b5a032bdd7f203d1e93b6-750-375.jpg", "publishedAt": "2019-03-21T20:00:00Z", "content": "LONDON — The UK will be forced to accept US demands for the UK changes its food safety standards if it enters into a post-Brexit trade deal with the Trump administration, the former head of the UK's International Trade Department has told Business Insider. \r\n… [+3851 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katya Kupelian and Irene Kim", "title": "Kylie Jenner is the 'youngest self-made billionaire' and the wealthiest member of her family. Here's how she makes and spends her fortune.", "description": "Kylie Jenner is the wealthiest member of the Kardashian-Jenner family, with a net worth of $1 billion. This month, she was named the youngest self-made billionaire ever by Forbes magazine, though many critics argue she's not self-made because she was born int…", "url": "https://www.businessinsider.com/kylie-jenner-kardashian-youngest-self-made-billionaire-forbes-net-worth-fortune-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93e517daa507082a0b5da8-2732-1366.jpg", "publishedAt": "2019-03-21T20:00:00Z", "content": "Following is a transcript of the video.\r\n Kylie Jenner was recently named the youngest self-made billionaire ever by Forbes magazine much to the chagrin of many critics, including Dictionary.com. At just 21, Jenner is worth $1 billion, and her cosmetics compa… [+5930 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Áine Cain", "title": "How much a bottle of beer costs in the world's 9 cheapest cities", "description": "You can get a bottle of beer for mere cents in some places around the globe. The Economist Intelligence Unit's 2019 global cost of living survey identified the cheapest cities in the world. The report also noted how much an average bottle of beer goes for in …", "url": "https://www.businessinsider.com/beer-cost-cheapest-cities-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93c464daa507055e09d5ff-1920-960.jpg", "publishedAt": "2019-03-21T19:45:05Z", "content": "Bangalore, also called Bengaluru, cracked down on alcohol sales at bars and restaurants in 2017, CNN reported. The News Minute, an Indian digital outlet, reported in 2018 that the government has also considered looking into banning local online delivery compa… [+334 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Here comes Nike... (NKE)", "description": "Nike is scheduled to report its third-quarter results after the market's close on Thursday. Shares have been on a tear in recent months, up 19% gain so far in 2019. Watch Nike trade in live. As Nike was set to report quarterly earnings after the closing bell …", "url": "https://markets.businessinsider.com/news/stocks/nike-earnings-q3-stock-price-2019-3-1028050251", "urlToImage": "https://images.markets.businessinsider.com/image/5b3a68264e04d369038b468f-1024/gettyimages-5454978981.jpg", "publishedAt": "2019-03-21T19:39:00Z", "content": "Julian Finney/Getty Images\r\nNike is scheduled to report its third-quarter results after the market's close on Thursday.\r\nShares have been on a tear in recent months, up 19% gain so far in 2019.\r\nWatch Nike trade in live.\r\nAs Nike was set to report quarterly e… [+1429 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Here comes Nike... (NKE)", "description": "Nike is scheduled to report its third-quarter results after the market's close on Thursday. Shares have been on a tear in recent months, up 19% gain so far in 2019. Watch Nike trade in live. As Nike was set to report quarterly earnings after the closing bell …", "url": "https://www.businessinsider.com/nike-earnings-q3-stock-price-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93e7a2daa507091d3675f5-960-480.jpg", "publishedAt": "2019-03-21T19:39:00Z", "content": "As Nike was set to report quarterly earnings after the closing bell on Thursday, its shares were poised to close at a record high. Here's what Wall Street is expecting from the sneaker giant's third-quarter results, according to analysts surveyed by Bloomberg… [+1233 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Remi Rosmarin", "title": "The fan I rely on to keep me cool in my overheated NYC apartment is only $35", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/vornado-air-circulator-fan-review", "urlToImage": "https://amp.businessinsider.com/images/5c92a8dc003f5c4fc82f6fc3-1136-568.jpg", "publishedAt": "2019-03-21T19:28:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+3072 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sonam Sheth", "title": "The Steele dossier's most damning allegation against Michael Cohen is back in the spotlight after a new Czech media report", "description": "The Steele dossier's most damning allegation against Michael Cohen is back in the spotlight this week following new reporting. The dossier claims Cohen went to Prague in the summer of 2016, in part, to discuss paying off hackers working \"under Kremlin directi…", "url": "https://www.businessinsider.com/michael-cohen-steele-dossier-hacking-operation-prague-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c0b14d8c6117f2b0d72dd25-2732-1366.jpg", "publishedAt": "2019-03-21T19:13:12Z", "content": "One of the most hotly-contested allegations in the Steele dossier is back in the spotlight this week following new reporting that bolsters some of its allegations. \r\n The dossier was compiled by the former British spy Christopher Steele and consists of an exp… [+4871 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kylie Joyner", "title": "I slept on Casper's new adjustable bed frame with a built-in massage function — here's what it was like", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/casper-adjustable-pro-bed-frame-review", "urlToImage": "https://amp.businessinsider.com/images/5c93bd5b003f5c61fd3e9be0-750-375.jpg", "publishedAt": "2019-03-21T19:04:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+7805 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "Boeing will start including a safety feature that customers previously had to pay for on all 737 Max aircraft (BA)", "description": "Boeing will start including a safety feature customers previously had to pay for on all of its 737 Max aircraft, The New York Times reports. The feature, called a disagree light, will alert pilots if two sensors are giving different readings of the angle at w…", "url": "https://www.businessinsider.com/boeing-to-make-737-max-safety-feature-standard-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93d5f9daa507062c175563-2732-1366.jpg", "publishedAt": "2019-03-21T19:03:21Z", "content": "Boeing will start including a safety feature customers previously had to pay for on all of its 737 Max aircraft, The New York Times reports. \r\n The feature, called a disagree light, will alert pilots if two sensors are giving different readings of the angle a… [+1265 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "I spent a day in one of America's richest cities, a town an hour from NYC where hedge fund managers live in multimillion-dollar homes. It was immediately clear why it's a haven for Wall Street types", "description": "Greenwich is a town on Connecticut's coast, an hour outside of New York City. In its 2019 ranking, Bloomberg ranked Old Greenwich as one of the wealthiest towns in the US. The town is home to several hedge funds and is known for drawing wealthy Wall Street bu…", "url": "https://www.businessinsider.com/living-in-greenwich-connecticut-houses-cars-wall-street-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c913a18401d58285e20cde4-2732-1366.jpg", "publishedAt": "2019-03-21T18:53:00Z", "content": "On an unseasonably cold March morning, I got on the Metro North from Grand Central Station in New York City. My destination: Greenwich, a town on Connecticut's coast about an hour from the city. \r\n Greenwich is consistently ranked as one of the richest towns … [+1705 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier and Bradley Saacks", "title": "Investors packed the penthouse of a $1,000 a night hotel for Lyft's IPO roadshow stop in NYC (LYFT)", "description": "Lyft executives met with 400 investors at New York's St. Regis hotel on Thursday for its pre-IPO roadshow. The company would not provide a timeline for reaching profitability, but stressed that it would not engaged in a price war with rival Uber, attendees to…", "url": "https://www.businessinsider.com/inside-lyft-ipo-roadshow-stop-in-nyc-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93c5a5daa507051522015b-2732-1366.jpg", "publishedAt": "2019-03-21T18:51:14Z", "content": "NEW YORK — Nearly 400 money managers and Wall Street bankers crowded into the penthouse ballroom of New York's St. Regis hotel on Thursday to hear the co-founders of ride-hailing giant Lyft make a sales pitch for what's expected to be the largest IPO in sever… [+3029 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "Best Buy's Tax Day sale is going on right now — save $400 on a 15-inch MacBook Pro and up to $150 on the iPhone XS and XS Max", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/macbook-pro-sale-iphone-xs-deal-best-buy-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93d51301df7270ed02dec2-1920-960.jpg", "publishedAt": "2019-03-21T18:44:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1633 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Donald Trump takes cue from young conservative firebrand Charlie Kirk, signs an executive order for free speech on college campuses", "description": "President Donald Trump on Wednesday will sign an executive order designed to protect free speech on college campuses. Trump was urged to do this by conservative youth advocacy group Turning Point USA and its leader Charlie Kirk, who's made this issue TPUSA's …", "url": "https://www.businessinsider.com/trump-signs-free-speech-executive-order-urged-tpusa-charlie-kirk-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93d091daa50705fc662eb5-2732-1366.jpg", "publishedAt": "2019-03-21T18:40:49Z", "content": "President Donald Trump on Wednesday will sign an executive order designed to protect free speech on college campuses after being urged to do so by Turning Point USA's president and founder Charlie Kirk, an outspoken conservative and rising star on the politic… [+6408 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matthew DeBord", "title": "I drove a $42,000 VW Golf R to see if the 'performance hatch' is worth the price — here's the verdict", "description": "The VW Golf R is a performance hatchback that adds premium touches and tech to the VW Golf GTI. The Golf R is a bit expensive, but it's a versatile vehicle that's bliss to drive. The best part is that a driver can access all the power the Golf R's 288-horsepo…", "url": "https://www.businessinsider.com/vw-golf-r-review-pictures-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92ad355b066e52d56be53a-1920-960.jpg", "publishedAt": "2019-03-21T18:40:18Z", "content": "The 2018 VW Golf R is perhaps a tad pricey at almost $42,ooo, but my tester was loaded. The only extra on the whole car was ... well, there wasn't one. The $40,885 MSRP closed in on 42 grand thanks only to an $850 destination charge. (The base Golf, by the wa… [+2670 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "Colin Kaepernick's collusion settlement was reportedly less than $10 million — far less than what people believed", "description": "Colin Kaepernick's collusion grievance settlement with the NFL was for less than $10 million, according to The Wall Street Journal. The settlement, which includes Carolina Panthers safety Eric Reid, was for much less than anticipated. Previous reports suggest…", "url": "https://www.businessinsider.com/colin-kaepernick-collusion-settlement-less-10-million-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b75d6302154a389328b45d3-1334-667.jpg", "publishedAt": "2019-03-21T18:35:21Z", "content": "Colin Kaepernick and Eric Reid's collusion grievance settlement with the NFL was for much less than many expected. \r\n According to The Wall Street Journal's Andrew Beaton, Kaepernick and Reid will receive less than $10 million from the NFL to settle their col… [+511 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Abby Jackson", "title": "Comcast just announced a $5-a-month streaming service called 'Flex'", "description": "Comcast announced it would launch a $5-a-month aggregation service for its broadband customers. Xfinity Flex works similarly to Roku and will let customers integrate other streaming services they pay for, like Netflix or Amazon Prime, into one device. Flex se…", "url": "https://www.businessinsider.com/comcast-just-announced-a-5-a-month-streaming-service-called-flex-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93d358daa507063346bc5c-1136-568.jpg", "publishedAt": "2019-03-21T18:35:02Z", "content": "Comcast announced Thursday that it would launch a $5-a-month aggregation service for its broadband customers March 26. \r\n Named Xfinity Flex, the service will essentially offer the same capabilities as Roku, which costs about $40 a month. \r\n The way it works … [+1504 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "AMD soars to a 5-month high (AMD)", "description": "AMD shares on Thursday spiked to their best level in over five months. They have gained about 20% since Google on Tuesday said it would use the chipmaker's graphics processing units for its new streaming-video-game service. Watch AMD trade live. AMD shares on…", "url": "https://markets.businessinsider.com/news/stocks/amd-stock-price-soars-to-5-month-high-2019-3-1028050145", "urlToImage": "https://images.markets.businessinsider.com/image/5bd08d39d2e648504714217c-2400/2006-10-24t000000z368155717bm2dtudiiyaartrmadp3germany.jpg", "publishedAt": "2019-03-21T18:31:00Z", "content": "Fabrizio Bensch/REUTERS\r\nAMD shares on Thursday spiked to their best level in over five months.\r\nThey have gained about 20% since Google on Tuesday said it would use the chipmaker's graphics processing units for its new streaming-video-game service. \r\nWatch A… [+1551 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "AMD soars to a 5-month high", "description": "AMD shares on Thursday spiked to their best level in over five months. They have gained about 20% since Google on Tuesday said it would use the chipmaker's graphics processing units for its new streaming-video-game service. Watch AMD trade live. AMD shares on…", "url": "https://www.businessinsider.com/amd-stock-price-soars-to-5-month-high-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5bd08de2d2e64853ef1f1365-2732-1366.jpg", "publishedAt": "2019-03-21T18:31:00Z", "content": "AMD shares on Thursday soared over 8% to their best level in more than five months as traders continued to pile in following Tuesday's announcement that Google would be using the chipmaker's graphics processing units for its streaming-video-game service Stadi… [+1286 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Adrian Shepherd, Contributor", "title": "I lived in Japan for 20 years and saw business there change in 7 big ways that we'd be remiss to ignore", "description": "Adrian Shepherd is a British productivity consultant who's lived and worked in Japan for the past 24 years. Over that time he's had a front row seat to how business has changed over time — and says other countries should learn from it. For instance, more and …", "url": "https://www.businessinsider.com/japan-business-change-learn-from-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93d6b8daa50707860d7cb2-960-480.jpg", "publishedAt": "2019-03-21T18:28:48Z", "content": "I first stepped off the plane into Japan back in 1994 into Osaka airport, back when Kansai International Airport was still being built. I had no idea what to expect. I didn't speak the language and while I'd lived in other Asian countries before, this was the… [+4021 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "The first huge update to 2019's biggest game is worth every penny (EA)", "description": "The first major addition has arrived in \" Apex Legends,\" the wildly popular new Battle Royale game. The \"Wild Frontier\" expansion includes the first new character, Octane, and the game's first Battle Pass — a massive set of unlockable items tied to your level…", "url": "https://www.businessinsider.com/apex-legends-battle-pass-review-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fcb2969bdec05f85af3d3-2732-1366.jpg", "publishedAt": "2019-03-21T18:25:19Z", "content": "Just in case you're not familiar with the concept, a Battle Pass like this one offers a level-based set of unlockable items that you earn through playing. When you reach a new level in the Battle Pass, various items unlock and you permanently own them — but i… [+980 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Michelle Greenlee", "title": "How to clear the cache on your Android phone to make it run faster", "description": "If you clear the cache on your Android phone periodically, you could help eliminate performance issues on the device. Your Android phone's cache comprises stores of small bits of information that your apps and web browser use to speed up performance. But cach…", "url": "https://www.businessinsider.com/how-to-clear-cache-on-android-phone", "urlToImage": "https://amp.businessinsider.com/images/5ada1cc319ee8644008b4613-1920-960.jpg", "publishedAt": "2019-03-21T18:19:00Z", "content": "Your apps and web browser store bits of information to speed up your experience using them. \r\n Over time, your phone may collect a lot of files you don't really need. You can clear out the files to free up a little storage space on your device. Clearing cache… [+2546 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "Walmart is reportedly considering taking on Google and Microsoft with a video game streaming service (WMT, GOOG, GOOGL, MSFT)", "description": "Walmart is considering creating its own video game streaming service, according to a new report from US Gamer. The report comes just days after Google announced Stadia, an upcoming video game streaming service that aims to remove the need for expensive video …", "url": "https://www.businessinsider.com/walmart-video-game-streaming-google-stadia-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93c9436123ca707c6969a0-1536-768.jpg", "publishedAt": "2019-03-21T18:05:53Z", "content": "Walmart is the latest company to consider a video game streaming service, according to a new report from US Gamer. The news comes just days after Google announced its upcoming video game streaming service, Stadia, at the Game Developers Conference (GDC) in Sa… [+1912 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Chris Snyder and Ian Phillips", "title": "All the details you missed in the 'Stranger Things' season 3 trailer", "description": "\" Stranger Things \" just released the trailer for the third season of the hit Netflix show. It gives us a glimpse of where some of TV's favorite characters, now entering their teenage years, are heading next, including Eleven (Millie Bobby Brown), Mike (Finn …", "url": "https://www.businessinsider.com/stranger-things-trailer-season-3-details-missed-netflix-easter-eggs-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92af485dfa995ce87fa62a-1920-960.jpg", "publishedAt": "2019-03-21T18:00:00Z", "content": "Following is a transcript of the video.\r\nNarrator: The kids from \"Stranger Things\" may be going through some changes. Eleven and the gang are now teenagers, but Hawkins seems to be stuck in the midst of a never-ending monster infestation. \r\n Netflix released … [+4534 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "These are the 10 most innovative states in the U.S.", "description": "Innovation is not just found at big tech companies operating out of California's Silicon Valley. WalletHub recently compiled a ranking of the most innovative and least innovative states in the U.S., based on numerous metrics of human capital and innovation en…", "url": "https://www.businessinsider.com/most-innovative-states-in-united-states-dc-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93b9f669e11c05ef7698ff-1536-768.jpg", "publishedAt": "2019-03-21T17:58:26Z", "content": "The U.S. is often credited as one of the most innovative countries in the world, but that doesn't mean its innovation and technological pursuits are divided equally around the country. \r\n Innovative concepts and burgeoning tech often finds its start in major … [+1076 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "Pilots who fly for Amazon Air earn 33% less than their colleagues at UPS and FedEx for flying the exact same planes (AMZN)", "description": "More than a dozen current and former pilots who fly for Amazon Air told Business Insider about a culture of overwork and underpay at their employers, which contract air services to Amazon. ABX, ATI, and Atlas pilots, who fly your Amazon Prime packages, all ma…", "url": "https://www.businessinsider.com/amazon-air-pilots-earn-less-fedex-ups-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93b0135dfa996d4a03462c-2732-1366.jpg", "publishedAt": "2019-03-21T17:57:48Z", "content": "The pilots who deliver your Amazon Prime packages are paid considerably less than their peers at other air cargo carriers. \r\n Business Insider interviewed 13 current and former pilots who worked with third-party airfreight companies that fly Amazon Air-brande… [+5040 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "These are the 10 least innovative states in the U.S.", "description": "Innovation is often centered in the U.S. in big cities located on the coasts, such as Silicon Valley and New York. WalletHub recently compiled a ranking of the most innovative and least innovative states in the U.S., based on numerous metrics of human capital…", "url": "https://www.businessinsider.com/least-innovative-states-in-united-states-dc-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93c13fdaa507047f34fa42-1536-768.jpg", "publishedAt": "2019-03-21T17:47:26Z", "content": "The U.S. is often credited as one of the most innovative countries in the world, but that doesn't mean its innovation and technological pursuits are divided equally around the country. \r\n Innovative concepts and burgeoning tech often find their start in major… [+1105 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "President Obama has released his March Madness bracket, and like everyone else, he's picking Duke to win it all", "description": "President Barack Obama released his March Madness brackets. The presidential bracket was a tradition for sometimes, but has fallen out of favor under the Trump administration. Obama is picking Duke to defeat UNC in the men's championship game, and the UConn H…", "url": "https://www.businessinsider.com/obama-march-madness-bracket-picks-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93b86a69e11c0641521ccf-1334-667.jpg", "publishedAt": "2019-03-21T17:44:52Z", "content": "Former president Barack Obama has released his predictions for the 2019 NCAA men's and women's basketball tournaments, keeping alive a tradition that has fallen out of favor in President Donald Trump's White House. \r\n This year Obama made a few jarring picks … [+1862 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "The DOJ has reportedly subpoenaed Boeing as part of a criminal investigation involving the 737 Max (BA)", "description": "The United States Department of Justice (DOJ) has subpoenaed Boeing as part of a criminal investigation into the certification and marketing processes for the aerospace manufacturer's 737 Max aircraft, CNN reports. The investigation reportedly concerns the pr…", "url": "https://www.businessinsider.com/doj-reportedly-subpoenas-boeing-as-part-of-criminal-investigation-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c89558469e11c20693a794d-1920-960.jpg", "publishedAt": "2019-03-21T17:36:41Z", "content": "The United States Department of Justice (DOJ) has subpoenaed Boeing as part of a criminal investigation into the certification and marketing processes for the aerospace manufacturer's 737 Max aircraft, CNN reports. \r\n The investigation reportedly concerns the… [+2393 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "Rent the Runway is now a $1 billion company in its quest to become 'the Amazon Prime of rental'", "description": "Clothing rental service Rent the Runway announced Thursday that it had raised $125 million in a round of funding. The company is now valued at $1 billion. According to The New York Times, Rent the Runway plans to use the funding to expand into more product ca…", "url": "https://www.businessinsider.com/rent-the-runway-billion-amazon-of-rental-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93c159daa507054b4667b2-1136-568.jpg", "publishedAt": "2019-03-21T17:24:55Z", "content": "Renting is the new owning. \r\n On Thursday, Rent the Runway, a clothing rental service that allows customers to rent designer pieces one-off or sign up for a monthly subscription service, announced that it raised $125 million in a round of funding and is now v… [+3195 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "John Hickenlooper is ridiculed after saying women presidential candidates should be asked whether they'd pick a male running mate", "description": "John Hickenlooper, the former Colorado governor and recently announced 2020 presidential candidate, said he would \"of course\" choose a female running mate if he became the Democratic nominee. But Hickenlooper had another question: Why not ask the female candi…", "url": "https://www.businessinsider.com/john-hickenlooper-pick-woman-running-mate-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93b65ddaa50702d700fe3b-1136-568.jpg", "publishedAt": "2019-03-21T17:23:08Z", "content": "John Hickenlooper, the former Colorado governor and recently announced 2020 presidential candidate, said he would \"of course\" choose a woman vice presidential running mate during a Wednesday night town hall. \r\n But, he added, women candidates should also be a… [+2276 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "Netflix's original TV shows and movies still only represent 11% of its catalog, but are dominating its new spending", "description": "Netflix's original programming in the US increased from 4% of the service's content in December 2016 to 11% in December 2018. Netflix has been focusing more on original content and less on licensing deals as more companies jump into the streaming war. Amazon …", "url": "https://www.businessinsider.com/netflix-percentage-of-originals-vs-licensed-tv-and-movies-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93c115daa50704a606a6fb-1536-768.jpg", "publishedAt": "2019-03-21T17:20:00Z", "content": "As the streaming wars heat up and more companies set plans for their own platforms, Netflix has focused more on original content. \r\n The streaming giant's original movies and TV shows increased from 4% of the service's entire US catalog in December 2016 to 11… [+2305 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alex Morrell", "title": "American auto delinquencies are piling up, revealing the pains of the millions left behind by the US economic recovery", "description": "Last month, investors got spooked over a a spike in auto delinquencies reported by the Federal Reserve. The Fed and other Wall Street analysts found the results surprising given the robust state of the economy and the job market. The puzzling phenomenon is in…", "url": "https://www.businessinsider.com/why-american-auto-delinquencies-are-piling-up-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c89485101df721c41168506-2732-1366.jpg", "publishedAt": "2019-03-21T17:13:59Z", "content": "Ten years into a bull market, Americans are getting jittery about when the music will stop and the next recession will tear through the economy. \r\n While bad economic omens are being spotted in a variety of places, last month it was a spike in auto delinquenc… [+9502 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "Here are the Final Four picks of 17 Wall Street titans", "description": "March Madness 2019 tipped off on Thursday. Each year Bloomberg runs a celebrity bracket challenge where participants donate $10,000 to charity and play for the cause of their choice. Business Insider highlighted the Final Four picks of 17 Wall Street titans. …", "url": "https://www.businessinsider.com/march-madness-bracket-picks-wall-street-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c7831212628983b831d832d-1334-667.jpg", "publishedAt": "2019-03-21T17:11:00Z", "content": "The road to the Final Four began on Thursday, and each year Bloomberg holds a bracket challenge where celebrity contestants each donate $10,000 for charity and play for a cause of their choice. This year's challenge has 52 contestants playing for a total of $… [+520 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "Celebrities have flocked to see Duke's 18-year-old superstar Zion Williamson — here's why he's been dubbed one of the 'most impressive collegiate prospects' ever", "description": "Zion Williamson is the biggest star in college basketball and considered one of the best prospects ever. Williamson became a high school basketball star thanks to his highlight-reel dunks and incredible athleticism, and he has taken it to a new level during h…", "url": "https://www.businessinsider.com/zion-williamson-duke-star-nba-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93c0a7daa50704cd0fb784-1136-568.jpg", "publishedAt": "2019-03-21T17:04:06Z", "content": "If you aren't already familiar with Zion Williamson, now is the time. \r\n With March Madness kicking off, no player will receive as much attention as the 18-year-old Duke star trying to lead the Blue Devils to the national title. \r\n Williamson's fame has explo… [+396 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Madeline Shi", "title": "Wells Fargo board members are reportedly in talks to hire former Goldman Sachs exec Harvey Schwartz as its next CEO", "description": "Wells Fargo board members are in discussions with Harvey Schwartz, former president and co-chief operating officer of Goldman Sachs, to hire him as the bank's next chief executive officer, the New York Post reported. Schwartz has one serious competitor, but t…", "url": "https://www.businessinsider.com/wells-fargo-board-in-talks-to-hire-goldman-sachs-exec-harvey-schwartz-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93bfecdaa5070515609a22-1334-667.jpg", "publishedAt": "2019-03-21T17:03:38Z", "content": "Wells Fargo's board members are in discussions with Harvey Schwartz, former president and co-chief operating officer of Goldman Sachs, to hire him as the bank's next chief executive officer, the New York Post reported, citing two anonymous sources briefed on … [+937 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lucas Coll", "title": "Apple sells many different iPad models — here's how much they all cost", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/ipad-price", "urlToImage": "https://amp.businessinsider.com/images/5c93b15ff73f5c5b914881fe-1920-960.jpg", "publishedAt": "2019-03-21T17:00:00Z", "content": "The Apple Pencil officially works with every iPad Apple currently sells. The first-generation Apple Pencil works with the new iPad Mini and iPad Air, as well as the older 10.5-inch iPad Pro and the 2018 standard iPad. \r\n If you buy the new 11- or 12.5-inch iP… [+1243 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sponsor Post", "title": "5 marketing emails every publisher should be sending", "description": "Triggered messages, direct responses to a customer’s specific behavior, are a must for retail marketers. And why wouldn’t they be? Often consisting of flows, these emails enable true one-to-one personalization and generate more than three-quarters of email RO…", "url": "https://www.businessinsider.com/sc/publisher-marketing-triggered-messages-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90ff955dfa9928f34889ca-1920-960.jpg", "publishedAt": "2019-03-21T17:00:00Z", "content": "Triggered messages, direct responses to a customer's specific behavior, are a must for retail marketers. And why wouldn't they be? Often consisting of flows, these emails enable true one-to-one personalization and generate more than three-quarters of email RO… [+3605 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Adam Payne and Adam Bienkov", "title": "The EU agrees to delay Brexit until May 22 if MPs back Theresa May's deal", "description": "The EU offers to delay Brexit until May 22 if the UK parliament backs the Brexit deal next week. The offer falls short of prime minister Theresa May's request for a delay until June 30. A majority of British MPs have yet to signal their support for the deal. …", "url": "https://www.businessinsider.com/brexit-delay-eu-may-if-mps-vote-for-theresa-may-deal-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93b85d69bdec5dbb23b55c-1136-568.jpg", "publishedAt": "2019-03-21T16:50:52Z", "content": "LONDON — The European Union has agreed to give the United Kingdom a short delay to Brexit — but only if Members of Parliament vote for Theresa May's deal next week. \r\n Leaders of the 27 other EU member states said on Thursday that they were prepared to extend… [+1535 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanza Loudenback and Andy Kiersz", "title": "Here's how big tax refunds could be this year for people earning between $21,000 and $266,000", "description": "It's the first tax season under the new tax law President Donald Trump enacted in late 2017. While a majority of Americans saw a decrease in their overall tax bill for 2018, many complained about smaller refunds during the first few weeks of the tax-filing se…", "url": "https://www.businessinsider.com/tax-refund-size-after-tax-reform-math-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92be15f73f5c4e6c1056b5-1334-667.jpg", "publishedAt": "2019-03-21T16:49:00Z", "content": "Americans love tax refunds— they're a form of forced savings and often act as a reset button for a family's finances. \r\n After weeks of worry about smaller tax refunds, the average refund size by mid-March was up to about $3,000 — nearly the same as this time… [+2506 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "Inspire Brands CEO reveals his plans for Buffalo Wild Wings' comeback, Sonic's expansion, and more acquisitions", "description": "Paul Brown cofounded Inspire Brands, the parent company of Arby's, Buffalo Wild Wings, and Sonic, just over one year ago. This week, Buffalo Wild Wings kicked off its first round of changes to turn around the chain, including new menu items, recipes, uniforms…", "url": "https://www.businessinsider.com/buffalo-wild-wings-arbys-sonic-inspire-brands-ceo-interview-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92644edaa50743d40887a7-1920-960.jpg", "publishedAt": "2019-03-21T16:47:41Z", "content": "One year after the creation of Inspire Brands, Paul Brown has gone from an executive known for turning around one chain to a CEO juggling four. \r\n There is Arby's, a chain that saw a massive comeback after Brown joined as CEO in 2013. Buffalo Wild Wings, whic… [+37380 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Melina Seiler, Ruqayyah Moynihan, Business Insider Deutschland", "title": "Harvard scientists want to 'dim the sun' to curb global warming - Business Insider", "description": "Harvard scientists want to 'dim the sun' to curb global warming Business Insider Researchers at Harvard are proposing a solution to climate change that sounds almost too simple to be true — they want to dim the sun.", "url": "https://www.businessinsider.com/harvard-scientists-want-to-dim-the-sun-to-curb-global-warming-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9375c9003f5c5a1a696482-2732-1366.jpg", "publishedAt": "2019-03-21T16:46:45Z", "content": "Climate change is one of the greatest challenges mankind has faced up until now. \r\n How we'll be able to curtail global warming and its devastating consequences is still very much a hot potato among politicians and scientists alike — and so far, the outcome o… [+4023 chars]"}]}