{"status": "ok", "totalResults": 3613, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Olivia Oran", "title": "Ariana Grande is getting into private equity; Citigroup is considering working with pot companies", "description": "Dear Readers, Like most of you this week, I was captivated by the college admissions scandal. Some of the details that emerged were stunning: for example, wealthy parents Photoshopping their kids heads to make it appear like they were lightweight crew stars. …", "url": "https://www.businessinsider.com/wall-street-insider-today-march-16-2019", "urlToImage": "https://amp.businessinsider.com/images/5c26779cbd773058fa5c6087-1920-960.jpg", "publishedAt": "2019-03-16T14:51:00Z", "content": "Dear Readers, \r\n Like most of you this week, I was captivated by the college admissions scandal. Some of the details that emerged were stunning: for example, wealthy parents Photoshopping their kids heads to make it appear like they were lightweight crew star… [+11413 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nathan McAlone", "title": "'Billions' star Asia Kate Dillon on how the show led to a revelation about the actor's own gender identity, and an emotional moment with a fan", "description": "Showtime's hit show \"Billions,\" which explores finance, power, and morality, returns for season 4 Sunday at 9 p.m. Business Insider spoke to Asia Kate Dillon, who plays fan-favorite Taylor Mason, about gender identity, fan reactions, and the star's artistic a…", "url": "https://www.businessinsider.com/billions-star-asia-kate-dillon-on-gender-identity-and-fan-reactions-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bd166124d045578363172-960-480.jpg", "publishedAt": "2019-03-16T14:45:00Z", "content": "The world of Showtime's \"Billions\" — which returns for its season 4 on Sunday at 9 p.m. — is filled with charmingly devious characters. \r\n You can't help but smile at them even when they are being wicked. It's one reason why, though the show's critique of Wal… [+9205 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "We shopped with a buzzy bra startup that's taking on Victoria's Secret with an experience it says is better than shopping in-store. Here's the verdict.", "description": "ThirdLove is an online bra startup that launched in 2013. In the past year, it has been more public about its quest to shake up the lingerie industry and disrupt longtime leader Victoria's Secret. The company recently announced that it had raised $55 million …", "url": "https://www.businessinsider.com/victorias-secret-rival-thirdlove-review-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c6329b2598e231ecc4b8193-960-480.jpg", "publishedAt": "2019-03-16T14:42:00Z", "content": "I could probably count the number of times that I have ordered an item of clothing online and actually kept it on one hand. So, when I first heard about a startup that promises to find your perfect size and shape bra (a product that is famously hard to shop f… [+1537 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "The 8 best cars for millennials to buy, according to the experts", "description": "We asked experts what the best cars were for millennials to buy. While millennials have expensive taste in rental vehicles, their buying habits are a little more pragmatic. Some of the best cars for millennials to buy include models from Toyota, Hyundai, and …", "url": "https://www.businessinsider.com/best-cars-millennials-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bd65ce0575a54ac27203c-1920-960.jpg", "publishedAt": "2019-03-16T14:21:00Z", "content": "Aside from the purchase of a home, a car is the most expensive item most people will buy. \r\n For the youngest members of the millennial generation— the group between the ages of 22 and 38 in 2019 — the time to buy that first car has arrived. On the other hand… [+769 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Goggin", "title": "Chelsea Clinton went to a vigil for the New Zealand shooting victims and was berated for her tweets on Ilhan Omar. One activist blamed her for the violence.", "description": "Chelsea Clinton attended a vigil for New Zealand shooting victims Friday at New York University. A student activist berated Clinton for her tweets criticizing Ilhan Omar's tweets about the pro-Israel lobby, saying they stoked Islamophobia. The activist said C…", "url": "https://www.businessinsider.com/chelsea-clinton-video-blamed-for-new-zealand-shooting-at-vigil-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ce7b3113a5068f75d3793-1920-960.jpg", "publishedAt": "2019-03-16T14:16:43Z", "content": "Chelsea Clinton, a former first daughter and frequent commentator on Twitter, attended a vigil at NYU Friday evening to publically mourn victims of the shooting that took at least 49 lives at two mosques in New Zealand. \r\n Clinton, who attended and worked at … [+2770 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jeremy Berke", "title": "A Canadian investment bank is quietly pursuing a critical regulatory approval that would solve one of the biggest pain points for the US marijuana industry", "description": "Canadian bank Canaccord Genuity is seeking approval from FINRA to act as a custodian for US investors. If approved, the move could solve one of the biggest pain points preventing institutional investors from pouring billions into the US cannabis industry. Can…", "url": "https://www.businessinsider.com/canaccord-genuity-pursuing-finra-approval-to-custody-us-stocks-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c04da113a505d86494c44-1536-768.jpg", "publishedAt": "2019-03-16T14:00:00Z", "content": "One of the biggest pain points preventing multibillion-dollar institutions from investing in the US cannabis industry may soon be solved. \r\n Canaccord Genuity, a mid-size Canadian investment bank, is seeking approval from the Financial Industry Regulatory Aut… [+2843 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Meghan Morris", "title": "As asset management growth grinds to a halt, firms have to get creative. Here are the 3 avenues analysts say will best boost revenue.", "description": "Asset managers are set to struggle with barely increasing revenue, according to a new report from Morgan Stanley and consultancy Oliver Wyman. As investors continue to flee active products in favor of lower-revenue options, managers need to be more creative a…", "url": "https://www.businessinsider.com/morgan-stanley-asset-managers-growth-to-come-from-three-areas-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8be8d3003f5c588c76416a-960-480.jpg", "publishedAt": "2019-03-16T14:00:00Z", "content": "Asset managers face a dismal outlook, as investors turn to lower-fee products and shareholders demand bottom-line growth and lower costs. \r\n Industry revenues are only set to grow 1% annually for the next five years, compared to 4% for the last five years, ac… [+3226 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Brodwin", "title": "Stanford scientists just gave us an unprecedented look at how well the Apple Watch detects heart problems (AAPL)", "description": "Two months ago, Apple CEO Tim Cook said his company's \"greatest contribution to mankind\" would be in health. A new study led by Stanford researchers provides a glimpse at how that vision is beginning to take shape. The preliminary analysis suggests that the A…", "url": "https://www.businessinsider.com/can-apple-watch-detect-afib-irregular-heart-rate-stanford-study-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ad3b3e0575a428a0b3929-1920-960.jpg", "publishedAt": "2019-03-16T14:00:00Z", "content": "Roughly two months after Apple CEO Tim Cook said his company's \"greatest contribution to mankind\" would be in health, a new study provides the first glimpse at how that vision is beginning to take shape. \r\n The unprecedented analysis, known as the Apple Heart… [+8031 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "The luxury real-estate market in Vietnam is heating up — and it's luring foreign buyers in with 'sky mansions' at a fraction of what their cost would be in NYC or Hong Kong", "description": "Vietnam is the next luxury real-estate hotspot, Bloomberg reported. An explosion of new luxe developments, fueled by a strong economy and legislation that made it easier for foreigners to buy property, is attracting wealthy international buyers. These swanky …", "url": "https://www.businessinsider.com/vietnam-luxury-real-estate-market-sky-mansion-prices-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8821a4f73f5c00fb441e28-2732-1366.jpg", "publishedAt": "2019-03-16T14:00:00Z", "content": "Forget New York City or Hong Kong. The newest hotspot for luxury real estate is Vietnam. \r\n The Southeast Asian country has been seeing a surge in luxury real estate development, Bloomberg reported, thanks to a booming economy and laws making it easier for fo… [+3394 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "Costco has a brilliant strategy that allows it to get great press, save money, and pay workers $15 per hour (COST)", "description": "Costco is one of the most beloved brands in America, celebrated by customers and employees alike. However, the retailer manages to get incredible press without a public relations team and spends no money on advertising. Costco reallocates these funds towards …", "url": "https://www.businessinsider.com/costco-keeps-costs-low-pay-high-no-pr-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c813e7d26289823cf5b0ddc-1536-768.jpg", "publishedAt": "2019-03-16T13:35:00Z", "content": "Costco gets some of the best press in America. \r\n \"12 Reasons To Love Costco, As If You Needed More,\" HuffPost reports. \"Costco Was Named The Best Company To Work For, Because Duh,\" reads a Delish headline. Chef Samin Nosrat name-dropped Kirkland Signature or… [+3804 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "An Uber Eats executive reveals the company's surprising strategy for moving beyond taxi rides", "description": "Uber Eats is aggressively targeting areas outside of urban cores, especially suburbs, as it expands. The business is one of Uber's fastest-growing areas, and its first that's not for taxi rides. Ana Mahoney, head of US cities for Uber Eats, sat down for an in…", "url": "https://www.businessinsider.com/uber-eats-executive-interview-why-suburbs-are-key-to-food-delivery-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bee4969bdec57b7578265-2732-1366.jpg", "publishedAt": "2019-03-16T13:17:00Z", "content": "When it comes to delivery, Chinese food and pizza are about all that many Americans are used to ordering. \r\n Outside of New York City and other metro areas, that's often still the case, especially in the suburbs. That's the exact market Uber wants to corner w… [+3522 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "The worst outcome for Boeing after two deadly crashes involving its 737 Max 8 aircraft could lead airlines to lose trust in the company, an expert says (BA)", "description": "After two deadly crashes in five months involving its 737 Max 8 aircraft, Boeing finds itself in a precarious position. In the worst outcome for Boeing, investigators could find that the aerospace manufacturer \"deliberately took shortcuts\" with instruction ma…", "url": "https://www.businessinsider.com/boeing-lose-airlines-trust-crash-investigations-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8be870e0575a5766150e54-1920-960.jpg", "publishedAt": "2019-03-16T13:07:00Z", "content": "After two deadly crashes in five months involving its 737 Max 8 aircraft, Boeing finds itself in a precarious position. The damage the crashes cause for Boeing will depend on the findings of investigators, said Henry Harteveldt, the founder of the travel rese… [+2533 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julie Bort", "title": "Why SAP CEO Bill McDermott signs his emails 'XO, Bill' since buying Utah startup Qualtrics for $8 billion cash (SAP)", "description": "If you get an email from SAP CEO Bill McDermott these days, you'll see him sign it \"XO, Bill.\" But he's not sending hugs and kisses. He's reminding his people why he spent $8 billion cash to buy Utah software company, Qualtrics, last fall and facing down crit…", "url": "https://www.businessinsider.com/sap-ceo-signs-his-emails-xo-bill-since-buying-qualtrics-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c895497401d581c71512b9e-1136-568.jpg", "publishedAt": "2019-03-16T13:00:00Z", "content": "These days SAP CEO Bill McDermott signs his emails. \"XO, Bill,\" he tells Business Insider. \r\n But he's not sending virtual hugs and kisses. He's reiterating his marketing message of why he spent $8 billion cash to buy a Utah software company, Qualtrics, three… [+6834 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "<a target='_blank' href='https://www.businessinsider.com/author/richard-feloni/?IR=T'>Richard Feloni</a>, <a target='_blank' href='http://www.businessinsider.com/?IR=T'>Business Insider US</a>", "title": "These 9 books will help you make sense of why we need ‘better capitalism’ - Business Insider", "description": "These 9 books will help you make sense of why we need ‘better capitalism’ Business Insider Our Better Capitalism series focuses on why inequality has been hurting economic growth, and why new approaches to business and policy can be a course...", "url": "https://www.businessinsider.com/a-booklist-for-better-capitalism-2019-3/", "urlToImage": "https://static.businessinsider.sg/sites/2/2019/03/5c8c18d6daa5075e4a7c6d42.png", "publishedAt": "2019-03-16T13:00:00Z", "content": "caption\r\nFrench economist Thomas Piketty’s 2014 bestseller, “Capital in the 21st Century,” is still a foundational text on understanding today’s destabilizing inequality.\r\nsource\r\nREUTERS/Charles Platiau\r\nOur Better Capitalism series focuses on why inequality… [+8247 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Richard Feloni", "title": "These 9 books will help you make sense of why we need 'better capitalism'", "description": "Our Better Capitalism series focuses on why inequality has been hurting economic growth, and why new approaches to business and policy can be a course correction. We've chosen books from writers like the economist Joseph Stiglitz and the futurist Amy Webb tha…", "url": "https://www.businessinsider.com/a-booklist-for-better-capitalism-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c18f869bdec5f0114cc4f-2732-1366.jpg", "publishedAt": "2019-03-16T13:00:00Z", "content": "For over a year, Business Insider has been exploring why we need \"Better Capitalism\" and how we can achieve it. \r\n It started with the rejection of the shareholder primacy theory that grew in popularity in the late 1970s and became the norm beginning in the '… [+535 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matthew DeBord", "title": "Elon Musk just revealed the Tesla Model Y — and he's still the greatest car salesman who ever lived (TSLA)", "description": "Tesla CEO Elon Musk unveiled the Model Y crossover SUV last week. The new Tesla vehicle arrives after a difficult period for Musk and the company. Musk was at his best during the unveiling — in full-on salesman mode, both for the vehicle and for Tesla's visio…", "url": "https://www.businessinsider.com/elon-musk-proves-he-greatest-car-salesman-tesla-model-y-reveal-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8b35da124d0448e854b1a7-2732-1366.jpg", "publishedAt": "2019-03-16T12:57:00Z", "content": "A few years back, after Tesla posted an unexpected quarterly earnings beat and CEO Elon Musk took to the opportunity to undersell what was then the yet-to-be-produced Model 3 sedan, I wrote that he was the greatest car salesman who has ever lived. \r\n I'm not … [+2872 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "Apple’s ambitious vision for the future of TV is finally about to take shape. Here’s why it matters more than ever.", "description": "Apple laid the foundation for its approach to the TV market when it announced its refreshed Apple TV in 2015, and a new streaming service would serve to further that vision. It's a critical move for Apple as it looks to combat slowing iPhone sales and maintai…", "url": "https://www.businessinsider.com/apple-tv-streaming-service-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c17f1401d585e2755f609-2732-1366.jpg", "publishedAt": "2019-03-16T12:10:00Z", "content": "When Apple unveiled its revamped Apple TV set-top box in 2015, it framed the update as a dramatic rethinking and much-needed modernization of the medium. \"And our vision for TV is simple, and perhaps a little provocative,\" CEO Tim Cook said during the company… [+6854 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "Electronic Arts took a huge gamble by paying the world's most popular gamer $1 million to play its new game for a day. Here's why it was worth every penny (EA)", "description": "To help promote the surprise launch of \" Apex Legends,\" Electronic Arts paid Tyler \"Ninja\" Blevins, Michael “Shroud” Grzesiek, and several other professional gamers to play and stream the game on release day. Reuters reports that Ninja was paid $1 million to …", "url": "https://www.businessinsider.com/electronic-arts-brilliant-gamble-paying-ninja-1-million-play-apex-legends-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5ba155efe361c074048b5987-2732-1366.jpg", "publishedAt": "2019-03-16T12:00:00Z", "content": "The most popular new game of 2019 arrived as a complete surprise; Electronic Arts released \"Apex Legends \" on the same day it was announced, February 4th, with no advance marketing. \r\n That's an incredibly bold move in the gaming industry, which typically bui… [+919 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Antonio Villas-Boas", "title": "The Galaxy S10 is the better smartphone for taking photos compared to the iPhone XS, and it's clear what Apple needs to add to its next iPhone", "description": "The Samsung Galaxy S10 and Apple iPhone XS take nearly identical photos, so there's no specific winner for camera quality. But Galaxy S10 users have an option that iPhone users don't: an ultrawide camera that captures a much wider field of view than a smartph…", "url": "https://www.businessinsider.com/apple-iphone-xs-samsung-galaxy-s10-cameras-compared-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bd7475dfa9958762389f5-1920-960.jpg", "publishedAt": "2019-03-16T11:15:00Z", "content": "I've finally had a chance to test the camera on Apple's iPhone XS against Samsung's Galaxy S10, and they take incredibly similar photos. \r\n Sure, there are some differences here and there, but iPhone users and Galaxy S10 users will be equally happy with the p… [+224 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Here's how a tiny toymaker dodged the Toys R Us disaster that whacked Hasbro and Mattel (FNKO)", "description": "Toys R Us store closures and liquidation sales hammered Hasbro, Mattel, Spin Master and Jakks Pacific last year. Funko was hardly affected due to its large and diversified customer base, multiple sales channels, and devoted shoppers. The liquidation of Toys R…", "url": "https://www.businessinsider.com/heres-how-funko-dodged-the-toys-r-us-disaster-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ba294003f5c4d306c31f6-960-480.jpg", "publishedAt": "2019-03-16T10:55:40Z", "content": "The liquidation of Toys R Us and closure of more than 800 of its toy stores hammered Hasbro, Mattel, Spin Master and Jakks Pacific last year, as their recent results show. The only major toy stock to escape the fallout was Funko, thanks to its diversified cus… [+6831 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson and Yutong Yuan", "title": "Cristiano Ronaldo's heroic hat trick doesn't change the fact that his game remains in long-term decline", "description": "Cristiano Ronaldo pulled Juventus back from the brink of a defeat against Atletico Madrid with a nerveless hat trick on Tuesday. Ronaldo would return incredible performances more often than not in previous seasons but this was Ronaldo's seventh Champions Leag…", "url": "https://www.businessinsider.com/cristiano-ronaldo-game-remains-in-decline-despite-hat-trick-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bacd8daa5074c386e6d25-1536-768.jpg", "publishedAt": "2019-03-16T10:30:00Z", "content": "Cristiano Ronaldo's heroic hat trick midweek doesn't change the fact that his game remains in long-term decline. \r\n The striker rescued Juventus from European abyss when he brought the Italians back from the brink of defeat, overturning a 2-0 deficit to Atlet… [+4686 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Akin Oyedele", "title": "A 'tug-of-war' is pulling the stock market in 2 distinct directions — and how investors combat it will determine whether they survive the next meltdown", "description": "Several Wall Street strategists have identified a so-called \"flowless\" rally in the stock market this year. Even though stocks are on a tear this year, outflows from equity funds have accelerated. Societe Generale's Alain Bokobza says this is evidence that in…", "url": "https://www.businessinsider.com/stock-market-investing-tug-of-war-raging-ahead-of-next-crash-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bfd9a5b066e5c617e5da9-2732-1366.jpg", "publishedAt": "2019-03-16T10:05:00Z", "content": "Stocks are on a tear this year — but not everyone is impressed. \r\n Several investors have kept their enthusiasm tempered even as the market rebounded from a correction. While global stocks have gained 11% this year, $46 billion has been pulled from equity fun… [+3415 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Business Insider Intelligence", "title": "Share your ideas today!", "description": "The future of banking is coming to a smartphone near you. Saving, budgeting, and paying is getting easier than ever before, thanks to new features like scanning your face with a smartphone camera to log in or using your voice to navigate your banking app. To …", "url": "https://www.businessinsider.com/bi-insider-mobile-banking-survey-2019-3", "urlToImage": null, "publishedAt": "2019-03-16T09:56:00Z", "content": "The future of banking is coming to a smartphone near you. Saving, budgeting, and paying is getting easier than ever before, thanks to new features like scanning your face with a smartphone camera to log in or using your voice to navigate your banking app. To … [+417 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kieran Corcoran", "title": "Video shows New Zealand police carrying heaps of flowers past cordon to lay at mosque where gunman killed 41", "description": "Video posted to Twitter shows police in Christchurch, New Zealand, carrying flowers from the public after the previous day's mass shooting. They took the tributes past a police cordon to the Al Noor mosque, where 41 of the 49 victims of the previous day's mas…", "url": "https://www.businessinsider.com/video-new-zealand-police-carry-flowers-past-cordon-to-massacre-mosque-2019-3", "urlToImage": null, "publishedAt": "2019-03-16T09:49:57Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Choi", "title": "Jared Kushner had a rough week and it doesn't look like it's going to get any better", "description": "It's been a rough week for President Donald Trump's son-in-law and senior adviser, Jared Kushner. Kushner still faces congressional scrutiny after an internal White House memo suggested Trump was directly involved in granting his security clearance. Kushner's…", "url": "https://www.businessinsider.com/jared-kushner-security-clearance-academic-records-book-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c89892169bdec24a753d4d5-1920-960.jpg", "publishedAt": "2019-03-16T05:07:31Z", "content": "It's been a rough week for President Donald Trump's son-in-law and senior adviser, Jared Kushner. \r\n Questions surrounding the circumstances of his security clearance (and whether Trump influenced the process), still loom as lawmakers demand the US Justice De… [+4374 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosie Perper", "title": "SKY New Zealand pulls Sky News Australia from its platform after it aired disturbing footage of the deadly mosque shootings", "description": "Sky News Australia has been dropped by New Zealand’s biggest satellite television provider after it aired distressing footage of a livestream video connected to the Friday shooting in Christchurch which left 49 dead. At least 49 people were shot dead Friday i…", "url": "https://www.businessinsider.com/sky-new-zealand-pulls-sky-news-australia-over-mosque-shooting-video-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c77df401d5863532bdf97-1920-960.jpg", "publishedAt": "2019-03-16T04:17:50Z", "content": "Sky News Australia, a subsidiary of News Corp Australia, has been dropped by New Zealand's biggest satellite television provider after the news network aired distressing footage of a livestream video connected to the Friday shooting in Christchurch which left… [+2495 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sarah Gray", "title": "'I can tell you right now, our gun laws will change': New Zealand prime minister calls for change after deadliest mass shooting in the country's history", "description": "New Zealand's Prime Minister vowed to change New Zealand's gun laws, following the mass shooting on Friday that left 49 dead and more than 40 wounded. \"Suspect had a Category 'A' gun license,\" New Zealand police commissioner Mike Bush said at a press conferen…", "url": "https://www.businessinsider.com/new-zealand-gun-laws-will-change-prime-minister-says-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c4526401d58618b6ebad2-2732-1366.jpg", "publishedAt": "2019-03-16T01:36:37Z", "content": "New Zealand's Prime Minister vowed to change New Zealand's gun laws, following the mass shooting on Friday that left 49 dead and more than 40 wounded. \r\n The shooting, which took place at two mosques in Christchurch, has been called a \"terrorist\" act by the p… [+1811 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "I got an inside look at Hudson Yards on opening day. Here's what the glitzy neighborhood is like, from the $200 million climbable sculpture to the 7-story 'vertical shopping experience'", "description": "Hudson Yards, New York City 's $25 billion megadevelopment, is officially open to the public. The public can now visit the Vessel, a 150-foot tall, climbable sculpture in the center of Hudson Yards that cost $200 million to build. The Shops and Restaurants at…", "url": "https://www.businessinsider.com/hudson-yards-neighborhood-new-york-city-opening-vessel-shopping-tour-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c27df5b066e620b7ceaa5-2732-1366.jpg", "publishedAt": "2019-03-15T23:53:00Z", "content": "Hudson Yards, New York City's $25 billion megadevelopment, officially opened on March 15. \r\n The public can now visit the brand-new neighborhood on Manhattan's West Side, which includes luxurious residential towers, a luxury shopping center with stores like L… [+202 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "The Boeing 737 Max is now one of the most controversial airliners of all time. Here are 3 others.", "description": "The Boeing 737 Max airliner has been grounded by regulatory agencies and airlines worldwide. The action comes after two nearly-brand-new Boeing 737 Max 8 airliners crashed within a matter of months. The crashes, the grounding of the fleet, and the public furo…", "url": "https://www.businessinsider.com/boeing-737-max-and-other-airliners-that-suffered-failures-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b20032c1ae66220008b4fcb-1920-960.jpg", "publishedAt": "2019-03-15T23:41:16Z", "content": "The three-engined McDonnell Douglas DC-10 entered service in 1971 as a smaller rival to the Boeing 747 jumbo jet. But from the beginning, the DC-10 was plagued by problems. \r\n In 1972, the American Airlines Flight 96, a nearly brand-new DC-10, had to make an … [+1072 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Before he was a Democratic Socialist, Bernie Sanders pushed for nationalizing major industries in the 1970s", "description": "Sen. Bernie Sanders pushed for the nationalization of most major industries as a leader of a \"radical political party\" in the 1970s, according to a new report. Sanders reportedly embraced nationalizing most major industries in the US, including: the energy in…", "url": "https://www.businessinsider.com/bernie-sanders-in-1970s-pushed-for-nationalization-of-major-industries-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c24b2e0575a604f79e6bc-2732-1366.jpg", "publishedAt": "2019-03-15T22:28:01Z", "content": "Sen. Bernie Sanders has at times been labeled a radical for his progressive policy platform, but his politics are actually far more moderate than they were back in the 1970s, according to a new CNN report.\r\n At that time, Sanders reportedly embraced nationali… [+2897 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "James Brains", "title": "My kids and I built and played with LEGO's new City Sets, and they are more fun and engaging than ever", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/2019-lego-city-sets-review", "urlToImage": "https://amp.businessinsider.com/images/5c7d47af262898150d1df062-1136-568.jpg", "publishedAt": "2019-03-15T22:00:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+7596 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hillary Hoffower", "title": "Inside the star-studded opening of the Shops at Hudson Yards, where A-listers including Anne Hathaway and Whoopi Goldberg came to see NYC's new $25 billion neighborhood", "description": "On March 14, I attended the grand opening of The Shops & Restaurants at Hudson Yards, New York City's new $25 billion neighborhood. It was full of tastemakers, influencers, socialites, and celebrities, from Anne Hathaway to Whoopi Goldberg. It was one poppin'…", "url": "https://www.businessinsider.com/shops-at-hudson-yards-grand-opening-date-celebrities-new-york-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c1a985b066e60fa051714-1920-960.jpg", "publishedAt": "2019-03-15T21:39:00Z", "content": "Last night, I was surrounded by dollar signs. \r\n On my left, the real-life version of \"Gossip Girl\" — millennials wearing ascot scarfs, bow ties, and an air of confidence. To my right, female influencers dressed to what I call the \"Instagram nines\" — red lips… [+2850 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Trump says he doesn't see a rise in white nationalism around the world after New Zealand terror attack", "description": "President Donald Trump said he does not see a rise in white nationalism after a mass shooting at two mosques in New Zealand. \"I don't really. I think it's a small group of people that have very, very serious problems, I guess,\" Trump told reporters when asked…", "url": "https://www.businessinsider.com/trump-rise-white-nationalism-new-zealand-terror-attack-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c8c19d0124d04612c08ac66-750.jpg", "publishedAt": "2019-03-15T21:32:10Z", "content": "President Donald Trump on Friday told reporters he does not believe we're witnessing a rise in white nationalism around the world when answering questions about a mass shooting at two mosques in New Zealand. \r\n Trump was asked, \"Do you see today white nationa… [+1735 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andrea Schmitz and Rebecca Wilkin", "title": "Physicists have discovered that rotating black holes might serve as portals for hyperspace travel", "description": "Scientists once thought that traveling into a black hole would kill you. But now, physicists have run computer simulations to show that certain types of black holes — large, rotating ones — could serve as portals for hyperspace travel. Some physicists believe…", "url": "https://www.businessinsider.com/black-hole-travel-space-galaxy-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c7035fa1631a327395ea835-1920-960.png", "publishedAt": "2019-03-15T21:00:00Z", "content": "Following is a transcript of the video.\r\nNarrator: Black holes skirt the line between science fiction and science fact. On the one hand, scientists have seen real black holes in action, consuming unsuspecting stars that pass too close. But where reality ends … [+3424 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "11 natural cleaning brands that are as effective as traditional brands, but don’t use harsh, harmful chemicals", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/natural-cleaning-brands", "urlToImage": "https://amp.businessinsider.com/images/5c8c00b769e11c670344be24-750-375.jpg", "publishedAt": "2019-03-15T20:30:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+1299 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "The New Zealand shooting is now among the deadliest massacres in recent world history", "description": "At least 49 people were shot dead Friday in a mass shooting that targeted two mosques in the city of Christchurch, New Zealand. The massacre became the ninth-deadliest mass shooting in world history. Also on the list are several other terror and hate-motivate…", "url": "https://www.businessinsider.com/the-deadliest-mass-shootings-in-recent-world-history-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bf920124d045bed07666a-1920-960.jpg", "publishedAt": "2019-03-15T20:15:06Z", "content": "A massacre that left at least 49 people dead at two mosques in the city of Christchurch, New Zealand rocked communities across the world as reports emerged that the shooter was targeting Muslim men, women, and children. \r\n The shooting, which injured at least… [+1157 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "Netflix's 'One Day at a Time' viewership was on the rise, but not enough to save it from being canceled", "description": "Netflix canceled \"One Day at a Time\" on Thursday, tweeting, \" not enough people watched to justify another season.\" Data provided to Business Insider from analytics company Jumpshot shows viewership for \"One Day at a Time\" was steadily rising over its three s…", "url": "https://www.businessinsider.com/netflixs-one-day-at-a-time-viewership-rising-before-being-canceled-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c02145b066e5d425ab995-1536-768.jpg", "publishedAt": "2019-03-15T20:12:52Z", "content": "Netflix canceled \"One Day at a Time\" on Thursday, saying it was a \"very difficult decision\" not to renew the series for a fourth season on Twitter. The streaming giant said that \"simply not enough people watched to justify another season.\" \r\n Data provided to… [+1663 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matt Turner", "title": "Goldman Sachs job cuts — How to pitch VCs — Walmart's trucking ambitions", "description": "Hello! My name's Matt Turner, and I'm the Executive Editor at Business Insider. Starting today, I'm going to be sending out a weekly email highlighting some of the best reporting from our BI Prime coverage. First off, here are some of the interviews we publis…", "url": "https://www.businessinsider.com/goldman-sachs-job-cuts-how-to-pitch-vcs-walmarts-trucking-ambitions-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c883717daa50702fb62d4c5-1920-960.jpg", "publishedAt": "2019-03-15T20:11:56Z", "content": "My name's Matt Turner, and I'm the Executive Editor at Business Insider. Starting today, I'm going to be sending out a weekly email highlighting some of the best reporting from our BI Prime coverage. First off, here are some of the interviews we published thi… [+3898 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "Unicorn startup PagerDuty files to go public", "description": "On Friday, the IT operations company PagerDuty filed its S-1 to go public. PagerDuty previously confidentially filed for its IPO, but at the time, the government couldn't review its prospectus due to the government shutdown. The IT operations company PagerDut…", "url": "https://www.businessinsider.com/pagerduty-files-s-1-for-ipo-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c0106113a505d2b088033-750-375.jpg", "publishedAt": "2019-03-15T20:01:19Z", "content": "The IT operations company PagerDuty filed its S-1 on Friday to go public. \r\n PagerDuty, which was founded in 2009, helps alert employees when there are IT incidents. In the last twelve months, it has generated a revenue of $107 million. It now has over 10,000… [+441 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mara Leighton", "title": "REI has an extremely useful wedding registry program for outdoorsy couples — here's what you should know", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/rei-wedding-registry-overview", "urlToImage": "https://amp.businessinsider.com/images/5c8bd9fd69e11c601a52bbfa-1920-960.jpg", "publishedAt": "2019-03-15T20:00:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+3632 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "Trump issues his first presidential veto, striking down Senate resolution to terminate his national emergency declaration for a border wall", "description": "President Trump vetoed a resolution that would have terminated his national emergency declaration to build additional mileage of physical barriers along the US-Mexico border on Friday. The veto is the first of Trump's presidency, after being rebuked by Congre…", "url": "https://www.businessinsider.com/trump-first-presidential-veto-resolution-national-emergency-border-wall-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bd2c969bdec534d622993-1920-960.jpg", "publishedAt": "2019-03-15T19:55:26Z", "content": "WASHINGTON — President Donald Trump vetoed the resolution on Friday aimed at terminating his national emergency declaration to build physical barriers along the US-Mexico border from funds previously appropriated elsewhere. \r\n It is the first veto of the Trum… [+2502 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alex Lockie", "title": "The US and China are gearing up for a missile fight — and the US is at a huge disadvantage", "description": "The US is doomed to lose an increasingly hot missile race in Asia and the Pacific because of severe geographic, political, and military disadvantages against China. A treaty prevented the US and Russia from building missiles with medium-length ranges, but Chi…", "url": "https://www.businessinsider.com/us-is-at-a-huge-disadvantage-in-missile-fight-against-china-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5492f07ceab8ea7428bd4e5c-2732-1366.jpg", "publishedAt": "2019-03-15T19:51:58Z", "content": "The US announced on Thursday that it would begin testing a whole new class of previously banned missiles in August, but the US's chief rival, China, has a miles-long head start in that department. \r\n The US's new class of missiles are designed to destroy targ… [+3952 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jay Friedman", "title": "This is why a self-regulated Google is better for business and for the consumer", "description": "Jay Friedman is president of Goodway Group. In this op-ed, he explains why a self-regulated Google — rather than government intervention — is better for both business and consumers. Government regulation meant to deflate the monopoly could have the unintended…", "url": "https://www.businessinsider.com/self-regulated-google-better-for-business-and-for-the-consumer-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bfe5b69bdec5a69360412-1334-667.jpg", "publishedAt": "2019-03-15T19:45:56Z", "content": "It's been suggested plenty of times, but Elizabeth Warren officially fired the first shot in what looks to be a sure path toward anti-trust proceedings against America's largest tech companies, Amazon, Facebook, and Google. I'm sure there were plenty of cheer… [+3403 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "2 of Vizio's best sound systems are $100 off right now at Best Buy and Amazon", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/vizio-sound-system-deals-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bf96701df725f8e55b286-960-480.jpg", "publishedAt": "2019-03-15T19:35:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1725 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Johnson", "title": "How to download music and other audio files to your iPhone", "description": "Download music from your iTunes music collection to your iPhone with just a few clicks. You can download songs and other audio files to your iPhone using a USB cable or via Wi-Fi, though the initial setup requires connecting via USB either way. Every time you…", "url": "https://www.businessinsider.com/how-to-download-music-audio-files-on-iphone", "urlToImage": "https://amp.businessinsider.com/images/580782b4c52402c3008b5601-1920-960.jpg", "publishedAt": "2019-03-15T19:23:00Z", "content": "Given that your iPhone is essentially a cell phone merged with a music player, Apple has made it surprisingly cumbersome to download your music collection to a new iPhone. \r\n Windows users in particular have lamented for years that iTunes - Apple's desktop ap… [+4127 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "The top foods nutritionists swear by to be your healthiest self — and 2 they'll never touch", "description": "There are lots of great snacks that nutritionists swear by, including nuts, cheese, crunchy vegetables, fatty avocados, creamy yogurt, and savory hummus. But juice is terrible for your body, and sugar in liquids of all kinds is basically a nutritionist's wors…", "url": "https://www.businessinsider.com/unhealthiest-and-healthiest-foods-according-to-nutritionists-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a9840daa50738b04cb7e4-1920-960.jpg", "publishedAt": "2019-03-15T19:21:00Z", "content": "Nutritionists are not here to torture you. Dietitian Jason Ewoldt from the Mayo Clinic says when it comes to healthy eating, deprivation is not a winning strategy. \r\n \"We try to enlighten people about the foods they should be focusing more on, instead of rest… [+4060 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mara Leighton", "title": "Everything you need to know about Shudder, a streaming service that gives you unlimited access to horror, suspense, and thriller movies for $4 per month", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/shudder-streaming-service-horror-films-overview", "urlToImage": "https://amp.businessinsider.com/images/5c8bf8434f07ae612910d716-750-375.jpg", "publishedAt": "2019-03-15T19:15:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+4557 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone", "title": "Chinese tech giant Huawei has developed its own operating system as a 'plan B' in case it's barred by the US government from using Google and Microsoft products (GOOG, GOOGL, MSFT)", "description": "The Chinese tech-giant Huawei confirmed it has developed its own operating system that could replace Google's Android and Microsoft's Windows should it be barred from using American-made products, according to a recent report by the German newspaper Die Welt.…", "url": "https://www.businessinsider.com/huawei-has-developed-android-windows-os-replacements-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8107fe262898209c3621b3-2732-1366.jpg", "publishedAt": "2019-03-15T19:10:35Z", "content": "The Chinese tech giant Huawei confirmed it has developed its own operating system that could replace Google's Android and Microsoft's Windows should it be barred from using American-made products, according to a recent report by the German newspaper Die Welt.… [+1405 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Chinese tech giant Huawei has developed its own operating system as a 'plan B' in case it's barred by the US government from using Google and Microsoft products - Business Insider Nordic", "description": "Chinese tech giant Huawei has developed its own operating system as a 'plan B' in case it's barred by the US government from using Google and Microsoft products Business Insider Nordic Huawei has developed its own operating system for phones, laptops INSIDER …", "url": "https://nordic.businessinsider.com/huawei-has-developed-android-windows-os-replacements-2019-3", "urlToImage": null, "publishedAt": "2019-03-15T19:10:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Grace Panetta", "title": "Amy Klobuchar says her reputation for being tough on her staff makes her qualified to negotiate with leaders like Vladimir Putin", "description": "Sen. Amy Klobuchar said her tough approach to treating her staff makes her qualified to negotiate with important world leaders like Russian President Vladimir Putin in a recent CNN interview. Multiple recent news stories have alleged that Klobuchar created a …", "url": "https://www.businessinsider.com/amy-klobuchar-tough-boss-help-negotiate-vladimir-putin-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bf42c113a505acb4b1b10-1920-960.jpg", "publishedAt": "2019-03-15T19:08:14Z", "content": "Presidential candidate and US Senator Amy Klobuchar said her tough approach to managing her staff made her qualified to negotiate with important world leaders like Russian President Vladimir Putin in a recent CNN interview.\r\n Shortly before launching her pres… [+2648 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "You can now watch the first episodes of DC Universe's hit original shows for free without a subscription", "description": "The first episodes of DC Universe's three original shows will be available for a limited time for free without a subscription. The three shows include \"Titans,\" \"Young Justice: Outsiders,\" and \"Doom Patrol.\" DC Universe wants potential subscribers to check ou…", "url": "https://www.businessinsider.com/dc-universe-first-episodes-available-free-titans-doom-patrol-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bad99401d584ccc7b662b-2732-1366.jpg", "publishedAt": "2019-03-15T19:00:00Z", "content": "DC Universe wants potential subscribers to check out the service if they've been on the fence. \r\n The streaming service announced on Friday that the first episodes of its three original series — \"Titans,\" \"Young Justice: Outsiders,\" and \"Doom Patrol\" — will b… [+1284 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "American manufacturing is in danger of entering a recession", "description": "Manufacturing activity fell during the first couple months of the year. As growth slows and trade tensions drag on, the sector could be headed for a recession. Manufacturing accounts for about 12% of the US economy. Manufacturing activity in the US unexpected…", "url": "https://markets.businessinsider.com/news/stocks/american-manufacturing-is-in-danger-of-entering-a-recession-2019-3-1028034982", "urlToImage": "https://images.markets.businessinsider.com/image/51625da6ecad04f949000007-975/chart-665.jpg", "publishedAt": "2019-03-15T18:52:00Z", "content": "REUTERS / Brian Snyder\r\nManufacturing activity fell during the first couple months of the year.\r\nAs growth slows and trade tensions drag on, the sector could be headed for a recession.\r\nManufacturing accounts for about 12% of the US economy. \r\nManufacturing a… [+2456 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Holly Johnson", "title": "Here's when I'm ok with using my hard-earned points and miles on friends and family — and when I'm not", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/using-points-and-miles-to-book-award-travel-for-friends-family", "urlToImage": "https://amp.businessinsider.com/images/5c8bf3a74f07ae60441a8e9a-1536-768.jpg", "publishedAt": "2019-03-15T18:49:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+7040 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "American manufacturing is in danger of entering a recession", "description": "Manufacturing activity fell during the first couple months of the year. As growth slows and trade tensions drag on, the sector could be headed for a recession. Manufacturing accounts for about 12% of the US economy. Manufacturing activity in the US unexpected…", "url": "https://www.businessinsider.com/american-manufacturing-is-in-danger-of-entering-a-recession-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bf05ce0575a58e11d6cd3-960-480.jpg", "publishedAt": "2019-03-15T18:47:00Z", "content": "Manufacturing activity in the US unexpectedly fell for a second straight month in February, underscoring expectations for slower growth across major economies and raising concerns that the sector could be headed for a downturn. \r\n Factory output fell 0.4% las… [+2231 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Richard Feloni", "title": "How Aetna's former CEO found a blueprint for leadership in an ancient Taoist text", "description": "Mark Bertolini served as the CEO of Aetna from 2010 to 2018, stepping down after selling the healthcare company to CVS. He said he's followed the \"Four Levels of Taoist Leadership,\" based on a verse of the \" Tao Te Ching, \" and that the highest form of leader…", "url": "https://www.businessinsider.com/former-aetna-ceo-mark-bertolinis-taoist-leadership-lesson-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8be6abf73f5c559d2288f5-1920-960.jpg", "publishedAt": "2019-03-15T18:40:59Z", "content": "Every once in awhile, Mark Bertolini's son Eric will ask him, \"Why are we still here?\" Bertolini, who served as the CEO of Aetna from 2010 to 2018, and his son have both had brushes with death. \r\n Bertolini broke his neck in five places in a 2004 skiing accid… [+1738 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "The billionaire behind Hudson Yards, the most expensive real-estate development in US history, says it's 'not a neighborhood for the rich'", "description": "Hudson Yards, NYC's new $25 billion neighborhood, is the most expensive real-estate development in US history. The neighborhood's luxury condos start at $4.3 million and cost upwards of $32 million. When it's finished, Hudson Yards will have a luxury mall wit…", "url": "https://www.businessinsider.com/hudson-yards-stephen-ross-neighborhood-not-just-for-rich-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a96336123ca3cfc18f49c-2732-1366.jpg", "publishedAt": "2019-03-15T18:36:00Z", "content": "Hudson Yards is the most expensive real-estate development in US history. When it's finished, the $25 billion development will include luxurious residential towers, office spaces, a school, a luxury mall with high-end boutiques and restaurants, a $200 million… [+3023 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Holly Johnson", "title": "How to pay for purchases on European trips — we break down the pros and cons of using cash, credit cards, and debit cards", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/using-credit-cards-in-europe-cash-vs-card", "urlToImage": "https://amp.businessinsider.com/images/5c8befb8003f5c59f12ddb32-1536-768.jpg", "publishedAt": "2019-03-15T18:30:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+7243 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dan DeFrancesco", "title": "The first exchange to go live with bitcoin futures now isn't listing new contracts as another sign of the difficulty getting Wall Street interested in crypto", "description": "Cboe Global Markets announced late Thursday that it will stop listing new contracts of bitcoin futures. The Chicago-based exchange group, which was the first to launch a derivative for the cryptocurrency, said it is \"assessing its approach\" to how it handles …", "url": "https://www.businessinsider.com/cboe-to-not-list-new-contracts-for-bitcoin-futures-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8beb9d113a50597836f1f9-750-375.jpg", "publishedAt": "2019-03-15T18:28:58Z", "content": "Cboe Global Markets, the first exchange group to launch bitcoin futures when it went live in December 2017, announced it was putting a hold on listing new bitcoin contracts. \r\n In a notice published late Thursday, the Chicago-based exchange group said it woul… [+1277 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Linette Lopez", "title": "Wall Street is worried that Tesla's going broke yet again (TSLA)", "description": "After two profitable quarters in a row, Tesla is once again in financial trouble. The company has guided down expectations for Q1, and analysts are worried about margins on the new Model 3. Plus, the company has taken on more debt and has a $566 million bill …", "url": "https://www.businessinsider.com/teslas-financial-problems-return-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c86b52626289850590cd74a-1334-667.jpg", "publishedAt": "2019-03-15T18:24:19Z", "content": "Just over a month after Tesla CEO Elon Musk told investors that the company would be profitable going forward, its finances are once again the subject of Wall Street's most intense scrutiny. Tesla skeptics see blood in the water, while the company's supporter… [+8100 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Megan Foster", "title": "23 outdoor furniture deals to take advantage of this spring", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/outdoor-furniture-deals-sales", "urlToImage": "https://amp.businessinsider.com/images/5c8bec7169bdec56992ffd3a-750-375.jpg", "publishedAt": "2019-03-15T18:24:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1121 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "'Do not travel': The US government is warning Americans that if they Venezuela they could be at risk of homicide or arbitrary arrest", "description": "The US Department of State issued a level-four travel warning for Venezuela on Tuesday, telling Americans not to travel to the chaos-stricken country. The advisory said food, electricity, water, medical supplies, and other essentials are in short supply, whil…", "url": "https://www.businessinsider.com/us-travel-warning-against-venezuela-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bde5e6123ca5b5c117344-960-480.jpg", "publishedAt": "2019-03-15T18:22:22Z", "content": "The US Department of State issued a level-four travel warning for Venezuela on Tuesday to tell Americans \"do not travel\" to the chaos-stricken country, and that all Americans in the country should leave. It's the highest travel warning that the department iss… [+1596 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "Disney has rehired James Gunn to direct 'Guardians of the Galaxy 3' after firing him over offensive tweets", "description": "Disney has reinstated James Gunn as director of \"Guardians of the Galaxy 3,\" Deadline confirmed on Friday. Gunn was fired last year after offensive tweets resurfaced. Gunn was hired by Warner Bros. to write and possibly direct a \"Suicide Squad\" sequel in Octo…", "url": "https://www.businessinsider.com/disney-rehires-james-gunn-to-direct-guardians-of-the-galaxy-3-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bec97f73f5c56d50c6a8d-1136-568.jpg", "publishedAt": "2019-03-15T18:21:15Z", "content": "Disney has rehired James Gunn to direct \"Guardians of the Galaxy 3,\" Deadline confirmed on Friday with Marvel and Gunn representatives. \r\n Disney did not immediately return a request for confirmation from Business Insider. \r\nDisney fired Gunn last year from d… [+1169 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Alexandria Ocasio-Cortez attacked the NRA immediately after the New Zealand terror attack, then pivoted amid pushback", "description": "Rep. Alexandria Ocasio-Cortez quickly tweeted out her thoughts on Friday about the terror attack that killed 49 people at two mosques in New Zealand. She initially tweeted in part: \" What good are your thoughts & prayers when they don't even keep the pews saf…", "url": "https://www.businessinsider.com/alexandria-ocasio-cortez-new-zealand-terror-attack-nra-white-supremacy-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bb714003f5c4f967d330c-1536-768.jpg", "publishedAt": "2019-03-15T18:12:24Z", "content": "Rep. Alexandria Ocasio-Cortez took to Twitter on Friday in the immediate aftermath of the horrific terrorist attack that targeted two mosques — where at least 49 people were murdered, included young children — in the city of Christchurch, New Zealand. \r\n Whil… [+3299 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Business Insider", "title": "PRESENTING: The first-time founder's ultimate guide to pitching a VC", "description": "Just because you've binge-watched \"Shark Tank\" doesn't mean you know what it takes to deliver a successful pitch to investors. Convincing a venture capitalist to support your business is both an art and a science — and few first-time founders get it exactly r…", "url": "https://www.businessinsider.com/entrepreneurship-pitch-venture-capitalist-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8aa704113a503c9845831f-1920-960.jpg", "publishedAt": "2019-03-15T18:11:13Z", "content": "Just because you've binge-watched \"Shark Tank\" doesn't mean you know what it takes to deliver a successful pitch to investors. \r\n Convincing a venture capitalist to support your business is both an art and a science — and few first-time founders get it exactl… [+526 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "From Betsy DeVos, to Rupert Murdoch, to the Walton family, here are the investors that lost hundreds of millions investing in Theranos", "description": "Going into summer 2018, the blood-testing startup Theranos was running low on cash. In March, the SEC charged Theranos and its founder Elizabeth Holmes with fraud, alleging they had made false statements and misled investors while raising $700 million. In Jun…", "url": "https://www.businessinsider.com/who-invested-in-theranos-betsy-devos-walmart-heirs-2018-5", "urlToImage": "https://amp.businessinsider.com/images/5aecb20619ee865d008b4917-1920-960.jpg", "publishedAt": "2019-03-15T18:07:00Z", "content": "A number of the big names who invested in Theranos — from Education Secretary Betsy DeVos to Walmart heirs — lost hundreds of millions from their investments in the blood-testing company. \r\n Theranos, which was once valued at $9 billion, before shutting down,… [+2406 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Megan Foster", "title": "Save 30% on Nespresso machines at Bed Bath & Beyond — and more of today's best sales and deals from around the web", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/deal-of-the-day-nespresso-sale-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bd817daa50753ec10797c-1136-568.jpg", "publishedAt": "2019-03-15T18:05:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+3631 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alex Morrell", "title": "RBC's deputy chairman of investment banking explains why M&A has returned with a vengeance after going dormant last quarter", "description": "Larry Grafstein joined RBC Capital Markets last year from UBS as the deputy chairman of global investment banking. Business Insider recently spoke with Grafstein about the surprising turnaround in the markets this year and how 2019 could be just as strong for…", "url": "https://www.businessinsider.com/rbcs-larry-grafstein-explains-why-ma-has-returned-with-a-vengeance-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8acc46124d04438d058418-480-240.jpg", "publishedAt": "2019-03-15T17:54:37Z", "content": "What if you got a glimpse into the future, and what you saw terrified you? You'd likely take action to improve your fate. \r\n That may sound like Charles Dickens' \"A Christmas Carol,\" but we're talking about the 2019 mergers-and-acquisitions market. \r\n As Larr… [+10215 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hayley Peterson", "title": "Walmart and Kroger are rethinking stores as the online grocery battle intensifies (WMT, KR)", "description": "Walmart and Kroger are rethinking store layouts and functions as they battle for a bigger share of shoppers' online grocery spending. Walmart has considered adding an automated fulfillment system to its stores, according to Walmart US CEO Greg Foran. This cou…", "url": "https://www.businessinsider.com/walmart-kroger-stores-grocery-battle-vs-amazon-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c26819a2ab31e492937941a-2732-1366.jpg", "publishedAt": "2019-03-15T17:53:55Z", "content": "Walmart and Kroger are rethinking their brick-and-mortar store strategies in the face of growing competition from Amazon for shoppers' online grocery spending. \r\n Both Walmart and Kroger fulfill online orders from stores. As the popularity of online grocery g… [+4893 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "American Airlines has suspended flights to Venezuela after the State Department warned US citizens should stay out of the country (AAL)", "description": "American Airlines suspended flights to and from Venezuela on Friday due to security concerns. The announcement comes days after the US State Department issued a level four advisory instructing Americans to refrain from travel to the South American country. \"A…", "url": "https://www.businessinsider.com/american-airlines-suspends-venezuela-flights-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5be4aa3ada27f80895588c54-2732-1366.jpg", "publishedAt": "2019-03-15T17:46:24Z", "content": "American Airlines suspended flights to and from Venezuela on Friday. The announcement comes days after the US State Department issued a level four advisory instructing Americans to refrain from traveling to the South American country due to \"crime, civil unre… [+1591 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "The Champions League bracket is officially set and offers some potential dream matches leading into the final", "description": "The Champions League quarterfinals are set, with the eight remaining teams now knowing their competition for the next round. The quarterfinals offer some compelling pairings, but the best matches could be saved for the final depending on how the competition p…", "url": "https://www.businessinsider.com/champions-league-draw-bracket-final-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bb22e5dfa99513d67c023-1334-667.jpg", "publishedAt": "2019-03-15T17:41:23Z", "content": "The Champions League quarterfinals are officially set. \r\n After Friday's draw, football fans finally can visualize how the competition will play out, with the bracket and schedule set leading to the final in Madrid on June 1. \r\n The quarterfinals offer four c… [+279 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark T. Williams", "title": "How to finally address the country's out-of-control student loan crisis, according to a finance professor", "description": "For the first time in US history, total student-loan debt exceeds $1.5 trillion — surpassing both auto-loan and credit card debt. Mark T. Williams teaches finance, risk management, and capital markets at Boston University and says the sprawling financial-heal…", "url": "https://www.businessinsider.com/how-address-student-loan-crisis-finance-professor-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bde97124d0457690af20c-1136-568.jpg", "publishedAt": "2019-03-15T17:37:50Z", "content": "Generation Student Debt is the unenviable #hashtag for 45 million borrowers. They believed in the American Dream that you go to college to get ahead. But for one out of every four Americans, that has required taking on more and more debt. This growing class o… [+13618 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Candace Owens rejects any connection to 'radical Islamophobic white supremacy terror overseas' after being mentioned in New Zealand terrorist’s manifesto", "description": "Candace Owens, a popular figure on the political right, was mentioned in the manifesto of the alleged New Zealand mosque shooter. Owens quickly became a topic of conversation on social media as people responded to the shooting. \"Any insinuation that black con…", "url": "https://www.businessinsider.com/candace-owens-manifesto-new-zealand-mosque-terror-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bd3e369bdec5388337633-1920-960.jpg", "publishedAt": "2019-03-15T17:27:37Z", "content": "Candace Owens, a rising conservative star and the communications director for Turning Point USA, was mentioned in the manifesto of the man who claimed responsibility for a massacre at two mosques in New Zealand.\r\n The 74-page manifesto, which the alleged shoo… [+4163 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Harrison Jacobs", "title": "I found a hotel I like better than the $1 billion hotel considered 'the most luxurious in the world' — and it all comes down to location", "description": "I've stayed at a lot of luxurious places as I've traveled over the past year, including the Marina Bay Sands, the Burj Al Arab, and Nobu Hotel Ibiza. On a recent trip to Zanzibar, I was surprised to find that I liked a boutique hotel called Elewana Kilindi Za…", "url": "https://www.businessinsider.com/best-hotel-in-the-world-location-luxury-boutique-beach-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c89363269bdec16784ed250-1920-960.jpg", "publishedAt": "2019-03-15T16:54:00Z", "content": "I've stayed in a lot of luxurious places over the past year. \r\n There was the Nobu Hotel in Ibiza that wows you with the novelty of having world-class cocktails and sushi at its own in-house Nobu Restaurant. There was the Myconian Ambassador Relais &amp; Chat… [+3272 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Remi Rosmarin", "title": "5 female-founded venture capital funds to know — and the popular women-led startups they've invested in", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/female-founded-venture-capital-funds-startups-investments", "urlToImage": "https://amp.businessinsider.com/images/5c8bd1fb4f07ae5ab96ec517-1136-568.jpg", "publishedAt": "2019-03-15T16:50:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1693 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Audrey Schomer", "title": "DirecTV Now's price hikes and skinnier bundles could worsen churn — but push towards profitability (GOOGL, GMH)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here. DirecTV Now — DirecTV’s skinny bundle service — has confirmed th…", "url": "https://www.businessinsider.com/directv-now-price-hikes-skinnier-bundles-worsen-churn-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bd0e669bdec52ee45bb84-960-480.jpg", "publishedAt": "2019-03-15T16:34:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n DirecTV Now — DirecTV's skinny bundle service — has confirmed … [+3680 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "How to delete your Google search history on various web browsers", "description": "You should delete your Google search history on various web browsers from time to time. You can quickly clear your Google search history from desktop browsers as well as from a mobile device with these steps. By adjusting the settings of your Google account, …", "url": "https://www.businessinsider.com/how-to-delete-google-search-history", "urlToImage": "https://amp.businessinsider.com/images/5c40d97fd118933cd25c1517-1334-667.jpg", "publishedAt": "2019-03-15T16:32:00Z", "content": "When one thinks about reasons for clearing Google search history, the first thoughts are probably about content of a salacious nature. That or to keep those surprise party or anniversary vacation plans a secret, of course. \r\n But erasing stored Google searche… [+4262 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Arjun Reddy", "title": "Boeing's stock jumps after report says the plane maker will roll out a software upgrade for the 737 Max in 10 days (BA)", "description": "Boeing will roll out a software upgrade for the 737 Max aircraft in 10 days, according to an AFP report. The report follows the suspension of deliveries by the aircraft maker. Boeing's stock has rallied over 2% on the news. Watch Boeing trade live. Boeing wil…", "url": "https://www.businessinsider.com/boeings-stock-price-report-roll-out-software-upgrade-2019-3", "urlToImage": "https://images.markets.businessinsider.com/image/5be287b266be5015316383d3-2400/gettyimages-932915806small.jpg", "publishedAt": "2019-03-15T16:30:00Z", "content": "Stephen Brashear/Getty Images\r\nBoeing will roll out a software upgrade for the 737 Max aircraft in 10 days, according to an AFP report.\r\nThe report follows the suspension of deliveries by the aircraft maker. \r\nBoeing's stock has rallied nearly 2% on the news.… [+1091 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Arjun Reddy", "title": "Boeing's stock jumps after report says the plane maker will roll out a software upgrade for the 737 Max in 10 days (BA)", "description": "Boeing will roll out a software upgrade for the 737 Max aircraft in 10 days, according to an AFP report. The report follows the suspension of deliveries by the aircraft maker. Boeing's stock has rallied over 2% on the news. Watch Boeing trade live. Boeing wil…", "url": "https://markets.businessinsider.com/news/stocks/boeings-stock-price-report-roll-out-software-upgrade-2019-3-1028034695", "urlToImage": "https://images.markets.businessinsider.com/image/5be287b266be5015316383d3-2400/gettyimages-932915806small.jpg", "publishedAt": "2019-03-15T16:30:00Z", "content": "Stephen Brashear/Getty Images\r\nBoeing will roll out a software upgrade for the 737 Max aircraft in 10 days, according to an AFP report.\r\nThe report follows the suspension of deliveries by the aircraft maker. \r\nBoeing's stock has rallied over 2% on the news.\r\n… [+1089 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Slotnick", "title": "Chase has announced the Freedom credit card's Q2 bonus categories — including 5% cash back at grocery stores", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/chase-freedom-5x-points-q2-bonus-categories-2019", "urlToImage": "https://amp.businessinsider.com/images/5ae32d7919ee862c008b45c1-1136-568.jpg", "publishedAt": "2019-03-15T16:29:00Z", "content": "Chase offers two strong cash-back cards — the Chase Freedom and Chase Freedom Unlimited— that offer great rewards that you can combine with the points you earn from other cards. While both cards are slightly different, they're both great options and both earn… [+1563 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Linette Lopez", "title": "We just got a little taste of how complicated things could get for Tesla in China", "description": "Tesla is in talks with a Chinese battery maker to supply the cars it will manufacture at its soon-to-be-built Shanghai factory. Qualifying a complex new part and ensuring that it matches the quality of Tesla's originally sourced materials will take time and r…", "url": "https://www.businessinsider.com/tesla-making-batteries-in-china-could-present-problems-experts-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c87ca9e2628987350728085-2732-1366.jpg", "publishedAt": "2019-03-15T16:28:47Z", "content": "Tesla is in talks with Chinese battery maker CATL (Contemporary Amerpex Technology Co Limited) about supplying its currently-under-construction Shanghai plant with battery cells, according to Bloomberg.\r\n CATL is part of China's dream of building technology c… [+3038 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "Dollar General is sounding the alarm on the economy and says its profits could suffer as its low-income customers start hurting", "description": "Dollar General's CEO is preparing for a weaker economy in 2019. CEO Todd Vasos said on Thursday that the store's core customer is \"feeling a little less competent\" than 2018. \"We're positioning ourselves for the back half of the year for a weaker consumer.\" T…", "url": "https://www.businessinsider.com/dollar-general-prepares-for-weak-economy-with-more-in-store-promotions-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a6c10daa50730df351d56-750-375.jpg", "publishedAt": "2019-03-15T16:08:00Z", "content": "When the economy bites, dollar stores are well positioned to thrive, but even Dollar General's CEO is preparing for the worst this year. \r\n In a call with investors on Thursday after reporting earnings, CEO Todd Vasos explained that the store's core customer … [+1567 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "A little-known Democrat who has been running for president for almost 2 years is trying a wild scheme to try and get enough donations to qualify for the presidential debates", "description": "Presidential candidates will need to receive 65,000 individual donations to appear on the Democratic National Committee's debate stage. In a growing field of candidates, standing out can be difficult, making it a steep challenges to obtain enough individual d…", "url": "https://www.businessinsider.com/2020-presidential-candidate-john-delaney-donations-for-dnc-debate-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bc4c74f07ae58104ee099-2732-1366.jpg", "publishedAt": "2019-03-15T16:07:55Z", "content": "Getting a spot on the debate stage is proving to be a difficult task for many of the candidates in the 2020 presidential race, after the Democratic National Committee set requirements to qualify, including reaching a minimum of 65,000 individual donations. \r\n… [+2560 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nicky Lineaweaver", "title": "A new Amazon hire hints at doctor strategy for the Haven joint healthcare venture (AMZN, JPM, BRK.A)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Health Briefing subscribers. To receive the full story plus other insights each morning, click here. After a long-awaited name reveal last week, Haven — the joint h…", "url": "https://www.businessinsider.com/amazon-haven-doctor-hire-healthcare-strategy-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c815f58262898654770892e-1136-568.png", "publishedAt": "2019-03-15T16:05:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Health Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n After a long-awaited name reveal last week, Haven — the joint… [+3129 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dennis Green", "title": "We tried a new e-commerce startup that sells organic and natural products with an annual membership that's the same price as Costco's — here's what it's like to use", "description": "Public Goods is a new online store that specializes in essentials like food, household, and personal care products. It uses both an annual membership program like Costco's and a private-label model where each product category offers pretty much one choice. Th…", "url": "https://www.businessinsider.com/public-goods-costco-like-shopping-membership-review-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8abddd124d04410b1d9166-2732-1366.jpg", "publishedAt": "2019-03-15T16:01:10Z", "content": "Public Goods is part of a new breed of online shopping startup. \r\n This time, the equation is Costco + Brandless = Public Goods. \r\n The relatively new online store specializes in essentials like food, household, and personal care products, all with slick, Ins… [+1832 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Anderson and Shira Polan", "title": "What happens to your brain and body when you do yoga regularly", "description": "Over 36 million Americans practice yoga — a popular exercise that can have profound benefits to your mental and physical health. Studies show yoga can improve flexibility, which in turn can help treat and prevent back pain. Yoga and meditation have also been …", "url": "https://www.businessinsider.com/yoga-health-good-for-you-meditation-benefits-mental-physical-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c803f4526289853fd4c86b1-2732-1366.jpg", "publishedAt": "2019-03-15T16:00:00Z", "content": "Over 36 million Americans practice yoga, which really can have profound health effects on your body and brain. Studies show yoga can improve flexibility, which in turn can prevent and treat back pain. It also lowers inflammation in the body, which has been li… [+3128 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shana Lebowitz", "title": "A day in the life of a TV producer who logs a grueling 12-hour shift — and still makes time to bask in the 'majesty of New York'", "description": "Colleen King is an MSNBC executive producer who's worked on shows such as \"Hardball\" and \"Morning Joe.\" Today, she works on \"The 11th Hour.\" Her typical workday runs from noon to midnight and is jam-packed. She keeps things lively by dispensing candy to cowor…", "url": "https://www.businessinsider.com/msnbc-executive-producer-day-in-life-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8acfc8e0575a423764e62e-1136-568.jpg", "publishedAt": "2019-03-15T15:51:06Z", "content": "Colleen King has been at MSNBC for more than 14 years, during which time she's worked on shows such as \"Hardball\" and \"Morning Joe.\" \r\n Today, King is an executive producer on \"The 11th Hour,\" overseeing a team of senior producers and booking producers. Part … [+701 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Canales", "title": "We taste-tested Chick-fil-A, KFC, and Popeyes and found the best fast food chicken chain", "description": "When a craving for fast-food fried chicken hits, a number of options are available to fulfill your deep-fried desires. Chick-fil-A, KFC, and Popeyes are three of the most popular chicken chains in the US. We traversed the San Francisco Bay Area's fast-food sc…", "url": "https://www.businessinsider.com/chick-fil-a-kfc-popeyes-best-fast-food-chicken-chain-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c894b07401d581aab19201b-1920-960.jpg", "publishedAt": "2019-03-15T15:50:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "Walmart US is increasingly relying on its 8,600 'Elite Fleet' truckers over third-parties — and it's the latest move from America's largest company to take charge of its transportation network (WMT)", "description": "Walmart depends on its company truck drivers as well as third-party truckers to move its goods. Its internal team of 8,600 company drivers are among the most elite in the trucking industry, earning on average $87,500 in their first year. That's more than twic…", "url": "https://www.businessinsider.com/walmart-truckers-over-third-parties-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5393805aeab8ea942e7e11b2-960-480.jpg", "publishedAt": "2019-03-15T15:44:03Z", "content": "Last year, when a truck driver shortage hit industries across the board, retailers ranging from Amazon to General Mills to Tyson Foods had to reevaluate their bottom lines. To attract more drivers to the industry, trucking companies had to boost pay, and that… [+4565 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "The evolution of Stitch Fix: from a Harvard student's apartment to a $2 billion company", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/stitch-fix-personal-styling-overview", "urlToImage": "https://amp.businessinsider.com/images/5c8a9fc56123ca3f21796c42-750-375.jpg", "publishedAt": "2019-03-15T15:43:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+7258 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "Tiger Woods blew a huge opportunity at The Players with a disastrous quadruple bogey on its famous island-green hole", "description": "Tiger Woods weekend at The Players Championship at TPC Sawgrass was derailed on Friday with a quadruple bogey on the course's famous par-3 no. 17. Woods had been off to a hot start through his first seven holes of the day but hit the water twice on the no. 17…", "url": "https://www.businessinsider.com/tiger-woods-water-the-players-sawgrass-17-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bbe1d69bdec4efa6a0fed-1536-768.jpg", "publishedAt": "2019-03-15T15:38:43Z", "content": "Tiger Woods weekend at The Players Championship at TPC Sawgrass took an awful turn on Friday after a disastrous quadruple bogey on the course's famous par-3 no. 17. \r\n Woods had kicked off the tournament with a solid 2-under round on Thursday, keeping himself… [+1908 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian Wylonis, The Org", "title": "Here are the top power moves of the week: Facebook, Tesla and Y Combinator", "description": "Keeping an eye on major hires and promotions is one of the best ways to understand a company's strategy. The Org tracks executive changes at companies big and small. Here's a snapshot of the most important executive moves of the week across media, tech and fi…", "url": "https://www.businessinsider.com/power-moves-of-the-week-facebook-tesla-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b3f9340c05c091c008b4abc-1920-960.jpg", "publishedAt": "2019-03-15T15:35:49Z", "content": "Every week we bring you an overview of the most important executive changes from the past week. Yesterday, Facebook announced another leadership reshuffle as the company's Chief Product Officer, Chris Cox, is stepping down. Read more about this and other nota… [+2833 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Madeline Shi", "title": "Atlanta startup Qoins is rolling out a new feature that will lend users an extra pair of hands to pay off their debts", "description": "Qoins is rolling out a new feature, named MoneyTree, that allows users to invite their family members and friends to help pay down their debts. Since the upstart was founded in 2017, it has made a total of $4.5 million in debt payments for its users, accordin…", "url": "https://www.businessinsider.com/atlanta-startup-qoins-is-rolling-out-a-new-feature-that-will-lend-users-an-extra-pair-of-hands-to-pay-off-their-debts-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ba80d01df72518b5dde09-2732-1366.jpg", "publishedAt": "2019-03-15T15:31:29Z", "content": "Qoins, an Atlanta-based startup that helps people pay down their credit card debt, is rolling out a new feature that will lend users an extra pair of hands to pay off their debts. \r\n Qoins offers an app that rounds up users' spare change to whittle down their… [+1138 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Laura McCamy", "title": "5 ways you're making your job harder than it needs to be", "description": "If you're not an efficient worker, you may be making your job harder than it needs to be. Productivity expert Peggy Duncan said organization is the key to efficiency on the job. Duncan told Business Insider the five biggest ways you're wasting time at work an…", "url": "https://www.businessinsider.com/be-more-productive-at-work-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c89109be0575a0f70446feb-1536-768.jpg", "publishedAt": "2019-03-15T15:31:00Z", "content": "Have you ever gotten to the end of your workday and wondered what you did with your time? \r\n You didn't finish the report that was due yesterday. Your desk is a mess. Maybe you work longer, frantically trying to catch up. You feel stressed, miserable, anxious… [+679 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Americans are getting more optimistic about the economy", "description": "Consumer sentiment rose more than expected to 97.8 in the first half of March. Increasing optimism was concentrated among lower- and middle-class households. The gains come after disappointing sentiment readings at the beginning of 2019. Public confidence in …", "url": "https://www.businessinsider.com/americans-are-getting-more-optimistic-about-the-economy-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bc0ae124d0451b6748985-1920-960.jpg", "publishedAt": "2019-03-15T15:29:00Z", "content": "Public confidence in the economy rose more than expected in the US in early March, particularly among lower- and middle-class households. \r\n Consumer sentiment rose 4.3% from a month earlier to 97.8, preliminary results from the University of Michigan's month… [+2040 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Americans are getting more optimistic about the economy", "description": "Consumer sentiment rose more than expected to 97.8 in the first half of March. Increasing optimism was concentrated among lower- and middle-class households. The gains come after disappointing sentiment readings at the beginning of 2019. Public confidence in …", "url": "https://markets.businessinsider.com/news/stocks/americans-are-getting-more-optimistic-about-the-economy-2019-3-1028034556", "urlToImage": "https://images.markets.businessinsider.com/image/5aeb5da219ee8644288b47f5-1999/target.jpg", "publishedAt": "2019-03-15T15:29:00Z", "content": "Rick Wilking/Reuters\r\nConsumer sentiment rose more than expected to 97.8 in the first half of March.\r\nIncreasing optimism was concentrated among lower- and middle-class households.\r\nThe gains come after disappointing sentiment readings at the beginning of 201… [+2291 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "Burger King is selling a month of coffee for just $5 — the price of a large cappuccino at Starbucks (QSR)", "description": "Burger King has a new deal that allows customers to order a month of coffee for $5. With the BK Café Coffee Subscription, customers pay $5 upfront for a small brewed coffee every day of the month. Burger King takes aim at a rival chain in ads with the tagline…", "url": "https://www.businessinsider.com/burger-king-5-dollar-coffee-subscription-deal-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bb982124d0450642980e0-1920-960.jpg", "publishedAt": "2019-03-15T15:27:46Z", "content": "Burger King has a new deal to win over coffee lovers. \r\n On Friday, the fast-food chain debuted the \"BK Café Coffee Subscription.\" For $5, customers can get a cup of coffee every single day for a month. That comes out to roughly 17 cents for every cup of coff… [+1395 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "Walmart upped its distribution center productivity by 13% in the last year and a half — and it wasn't by telling employees to 'work harder'", "description": "Walmart's network of distribution and consolidation centers, staffed by 102,000 associates, are tasked with keeping its stores stocked. Greg Smith, the executive vice president of supply chain at Walmart US, told Business Insider that Walmart increased its su…", "url": "https://www.businessinsider.com/walmart-increased-distribution-center-productivity-13-percent-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ac31a401d5840a92ec8dd-2732-1366.jpg", "publishedAt": "2019-03-15T15:26:02Z", "content": "Walmart boosted productivity at its nearly-200 distribution centers by 13% over the past 18 months. \r\n \"We have been driving productivity really hard, not necessarily by making people work harder, but by finding obstacles and finding issues of failure that we… [+2692 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "Dispensed: New Theranos footage, an e-cig crackdown, and the pharmacy powering DTC companies like Hims", "description": "Hello, It was another busy week on the healthcare desk here at Business Insider, with news that National Cancer Institute director Dr. Ned Sharpless will be acting FDA commissioner when Dr. Scott Gottlieb steps down. We were also following developments from S…", "url": "https://www.businessinsider.com/dispensed-weekly-healthcare-newsletter-march-15-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c2f7f05bd77305daf6487b5-1920-960.jpg", "publishedAt": "2019-03-15T15:23:01Z", "content": "Hello, \r\n It was another busy week on the healthcare desk here at Business Insider, with news that National Cancer Institute director Dr. Ned Sharpless will be acting FDA commissioner when Dr. Scott Gottlieb steps down. We were also following developments fro… [+4703 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nicholas Shields", "title": "Uber is doubling down on autonomous vehicle tech (SFTBY, TM)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Transportation & Logistics Briefing subscribers. To receive the full story plus other insights each morning, click here. Ride-hailing titan Uber is close to accepting a $1 …", "url": "https://www.businessinsider.com/uber-softbank-toyota-autonomous-vehicle-tech-investment-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5ab12815fe7c5258128b4c64-1920-960.jpg", "publishedAt": "2019-03-15T15:21:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Transportation &amp; Logistics Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Ride-hailing titan Uber is close to accepting… [+4330 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ryan Pickrell", "title": "A big batch of B-52 bombers is flying into Europe amid heightened tensions with Russia", "description": "A large Bomber Task Force reportedly consisting of up to six B-52 Stratofortress heavy long-range bombers are flying into Europe this week. The rotation, which comes at a time of heightened tension with Russia, is focused on interoperability training, but the…", "url": "https://www.businessinsider.com/a-big-batch-of-b-52-bombers-is-flying-into-europe-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bbd55f73f5c4edd1f4eb6-960-480.jpg", "publishedAt": "2019-03-15T15:20:42Z", "content": "US Air Force B-52 Stratofortress heavy long-range bombers are flying into Europe this week, US Air Forces Europe - Africa announced Thursday, at a time Russia is making threats against the US as a Cold War-era missiles ban collapses. \r\n A Bomber Task Force co… [+3777 chars]"}]}