{"status": "ok", "totalResults": 3613, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman and Sonam Sheth", "title": "Trump supporters celebrate the end of Robert Mueller's Russia investigation and slam 'Collusion Truthers'", "description": "President Donald Trump's supporters celebrated the conclusion of special counsel Robert Mueller's Russia investigation on Friday evening, claiming that the president has been cleared of any collusion charges. Donald Trump Jr., the president's eldest son, simp…", "url": "https://www.businessinsider.com/trump-supporters-celebrate-end-robert-mueller-russia-investigation-collusion-truthers-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c955f2816c95821877bb5f3-1136-568.jpg", "publishedAt": "2019-03-22T22:59:35Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bob Bryan", "title": "Special counsel Robert Mueller is reportedly not recommending any more indictments after submitting the final Russia report", "description": "The special counsel Robert Mueller on Friday submitted his final report on Russia's interference in the 2016 election to Attorney General William Barr. According to multiple reports, Mueller is not recommending any further indictments as part of the report. D…", "url": "https://www.businessinsider.com/robert-mueller-special-counsel-not-recommending-more-indictments-russia-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b81864ce361c0243a8b4976-1920-960.jpg", "publishedAt": "2019-03-22T22:30:41Z", "content": "Special counsel Robert Mueller is not recommending any further indictments in his final report on Russian interference in the 2016 election. \r\n A senior justice department official told multiple outlets that the final report, which Mueller submitted to the At… [+834 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger and Sonam Sheth", "title": "Mueller has submitted his report to the attorney general. Here's what happens next.", "description": "The special counsel Robert Mueller submitted his final report in the Russia investigation to Attorney General William Barr on Friday. It's not clear what the report contains yet, but there are a few possible scenarios that could play out going forward. Now th…", "url": "https://www.businessinsider.com/mueller-report-what-happens-next-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9556dc0cf913217d44306a-2732-1366.jpg", "publishedAt": "2019-03-22T22:19:40Z", "content": "Special counsel Robert Mueller on Friday submitted his report on the investigation into Russian election interference to Attorney General William Barr. \r\n It's not entirely clear what the report contains, or how much of it will be disclosed to the public. \r\n … [+1608 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Troy Wolverton", "title": "Here's the pitch deck a Virginia startup used to raise $6 million after seven years of bootstrapping its business (AMZN)", "description": "Amify helps product makers sell their goods on Amazon. The startups works with companies including guitar-maker Fender guitars and running-shoe manufacturer Brooks to list their goods on the giant ecommerce site, battle vendors of counterfeit products, and ha…", "url": "https://www.businessinsider.com/amify-raised-57-million-with-this-pitch-deck-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c940e6ddc6767053d46ece6-2732-1366.jpg", "publishedAt": "2019-03-22T22:17:28Z", "content": "Many people have been daunted by Amazon's large and growing share of the e-commerce market. \r\n But Ethan McAfee saw an opportunity. \r\n McAfee foresaw that Amazon was becoming like a mall on the internet, the go-to destination for online shopping. Companies th… [+2170 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bob Bryan", "title": "Trump lawyers Rudy Giuliani and Jay Sekulow say they're 'pleased' that special counsel Robert Mueller has submitted his final report to the attorney general", "description": "Special counsel Robert Mueller on Friday submitted the long-awaited final report on the Russia investigation to Attorney General William Barr. President Donald Trump's personal lawyers, Jay Sekulow and Rudy Giuliani, released a statement on the delivery of th…", "url": "https://www.businessinsider.com/rudy-giuliani-jay-sekulow-trump-lawyer-reaction-robert-mueller-submitting-russia-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9557c40cf91321ea2b00c9-1536-768.jpg", "publishedAt": "2019-03-22T22:00:03Z", "content": "The personal legal team for President Donald Trump said it was \"pleased\" that the special counsel Robert Mueller submitted his final report on the Russia investigation to Attorney General William Barr. \r\n Trump's lawyers Jay Sekulow and Rudy Giuliani released… [+1944 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "Democrats demand that Attorney General William Barr release special counsel Robert Mueller's entire report on the Russia investigation", "description": "Special counsel Robert Mueller ended the investigation into Russian interference in the 2016 elections on Friday. Lawmakers reacted with caution and concern, as there are crucial next steps to be taken in order for the final report to become public in its ent…", "url": "https://www.businessinsider.com/democrats-demand-attorney-general-william-barr-release-mueller-russia-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c95510c86291324a75006e7-2732-1366.jpg", "publishedAt": "2019-03-22T21:53:58Z", "content": "WASHINGTON — Lawmakers reacted to the bombshell news on Friday that former FBI Director Robert Mueller and the special counsel finished their investigative report on Russian interference in the 2016 elections by demanding that Barr release the final report to… [+4066 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Read Attorney General William Barr's letter to Congress on Robert Mueller's Russia investigation report", "description": "Special Counsel Robert Mueller has reportedly delivered his report on the investigation into Russian election interference to Attorney General William Barr. Barr wrote in a letter to Congress on Friday evening that he would brief congressional leaders on the …", "url": "https://www.businessinsider.com/read-attorney-general-william-barr-letter-mueller-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c95510c86291324a75006e7-2732-1366.jpg", "publishedAt": "2019-03-22T21:52:10Z", "content": "Special Counsel Robert Mueller has delivered his report on the investigation into Russian election interference to Attorney General William Barr. \r\n Barr notified Congress on Friday evening that the Justice Department had received the special counsel's report… [+1302 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Grace Panetta", "title": "Mueller has submitted his report: Here's what 'collusion' actually means, and whether members of Trump campaign could have broken the law", "description": "The special counsel Robert Mueller has delivered his final report on the Russia investigation to Attorney General William Barr. It's not yet clear what details the report contains or what will be disclosed to the public. Legal experts say that while \"collusio…", "url": "https://www.businessinsider.com/mueller-report-what-collusion-means-trump-russia-2018-11", "urlToImage": "https://amp.businessinsider.com/images/5b7afaa38905f2ff1e8b46c5-1920-960.jpg", "publishedAt": "2019-03-22T21:37:11Z", "content": "Special counsel Robert Mueller has submitted the long-awaited report on his 19-month investigation. \r\n It is expected to examine one of the biggest questions surrounding the legitimacy of President Donald Trump's administration: whether the Trump campaign ill… [+7296 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jessica DeFino", "title": "I bought a $69 bidet attachment for my toilet in an effort to be more eco-friendly and hygienic — and now I can't imagine not having one", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/tushy-bidet-attachment-review", "urlToImage": "https://amp.businessinsider.com/images/5c9552a1dc6767208f75d25c-1334-667.jpg", "publishedAt": "2019-03-22T21:30:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+5884 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matt Weinberger", "title": "Pinterest has spent $309 million on Amazon's cloud since 2017 as part of a $750 million contract (AMZN)", "description": "With the paperwork for Pinterest's IPO, Pinterest has revealed the terms of a long-term contract with Amazon Web Services. The contract, signed in 2017, requires Pinterest to spend at least $750 million on Amazon Web Services by 2023. Pinterest has officially…", "url": "https://www.businessinsider.com/pinterest-ipo-amazon-web-services-2019-3", "urlToImage": "https://amp.businessinsider.com/images/51b8c4346bb3f7602300000f-1136-568.jpg", "publishedAt": "2019-03-22T21:28:01Z", "content": "Pinterest has officially filed for its IPO, giving us a look at the social media site's financials and business. \r\n Of note is that Pinterest has a long-term contract with Amazon Web Services. \r\n The contract was first signed in May, 2017, and requires Pinter… [+2336 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "5 wild endings that swung millions for bettors on the first day of March Madness", "description": "The first day of March Madness action is in the books. Thursday didn't see any huge upsets, but there was still plenty of wild endings for those betting on individual games in Las Vegas. Below we break down the worst bad beats of the first day of March Madnes…", "url": "https://www.businessinsider.com/march-madness-bad-beats-gambling-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c954de1ffcb27213c29729b-1334-667.jpg", "publishedAt": "2019-03-22T21:24:24Z", "content": "It's estimated that more than $8 billion will be bet on March Madness this year between bets, pools, and pick'ems. \r\n While that estimate is obviously a rough one — it's extremely difficult to judge for all the bracket pools happening in offices, schools, and… [+784 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Chris Snyder", "title": "Here's what Nickelodeon slime is made of — according to 'Double Dare' host Marc Summers", "description": "Nickelodeon is hosting its annual Kid's Choice Awards on Saturday. Anyone who watched Nickelodeon in the '90s knows that it was all about the green slime. Marc Summers, former host of \"Double Dare\" and \"What Would You Do?\" explains what it was actually made o…", "url": "https://www.businessinsider.com/heres-what-was-really-in-nickelodeon-slime-secret-ingredients-double-dare-marc-summers-nick-2017-6", "urlToImage": "https://amp.businessinsider.com/images/5941a2c4688ad223008b4635-1920-960.jpg", "publishedAt": "2019-03-22T21:09:00Z", "content": "Any kid who watched Nickelodeon in the '90s knows that it was all about the green slime. Marc Summers, host of \"Double Dare\" and \"What Would You Do?\" explains what it was actually made out of. A new documentary about Summers' life and career comes out later t… [+1533 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Robert Mueller has turned in his full report on the Russia investigation to the attorney general", "description": "Special Counsel Robert Mueller has reportedly delivered his report on the Russia investigation to Attorney General William Barr. This marks the conclusion of Mueller's investigation into Russian election interference. It's not clear what details the report co…", "url": "https://www.businessinsider.com/robert-mueller-has-turned-full-report-russia-investigation-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c954d6c7563b01f4c619255-1536-768.jpg", "publishedAt": "2019-03-22T21:07:46Z", "content": "Special Counsel Robert Mueller has reportedly delivered his report on the investigation into Russian election interference to Attorney General William Barr. \r\n This has been a highly anticipated moment, but it's uncertain what the report contains or what will… [+1608 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Flanagan", "title": "I spent a day with the US Coast Guard in the Port of Miami, where units search for drug smugglers and unauthorized migrants", "description": "In January, a Miami-based Coast Guard vessel was involved in the seizure of a boat carrying 132 pounds of cocaine. Earlier that month, a Miami-based Coast Guard airplane spotted a vessel carrying 35 migrants off the coast of Puerto Rico. After spending time a…", "url": "https://www.businessinsider.com/coast-guard-us-patrol-port-miami-drug-smuggling-illegal-immigration-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8188472628986c5a5779ea-1920-960.jpg", "publishedAt": "2019-03-22T21:00:00Z", "content": "Following is a transcript of the video.Graham Flanagan: At the end of last year, I spent some time at the Coast Guard Training Center in Cape May, New Jersey, which is boot camp for the Coast Guard. \r\nPetty Officer Arianne Gunn: Get upright!Recruit: Aye, aye,… [+5391 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Johnson", "title": "How to drop a pin on Google Maps from your desktop or mobile app", "description": "You can drop a pin in Google Maps and then save that location or navigate to it. Dropping a pin is convenient if you don't know the address you're at, don't want to look up the exact address, or if a specific location has no address. Dropping a pin on the map…", "url": "https://www.businessinsider.com/how-to-drop-a-pin-on-google-maps", "urlToImage": "https://amp.businessinsider.com/images/5c9542ab8e436a207c025293-2732-1366.jpg", "publishedAt": "2019-03-22T20:40:00Z", "content": "Google Maps has made it so easy to navigate that it has become an indispensable tool for getting around town (and has been amusingly name checked in pop culture). \r\n Finding almost any address is as easy as typing it into the search box, but there are times w… [+2693 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Becky Peterson", "title": "Pinterest just officially filed for an IPO", "description": "Pinterest, the social media site for \"pinning\" images and shopping, has publicly filed to go public in an IPO that could take place as soon as April. The company will list on the New York Stock Exchange under the ticker symbol \"PINS,\" according to its S-1. Th…", "url": "https://www.businessinsider.com/pinterest-ipo-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c7412ad2628985dc9063323-1920-960.jpg", "publishedAt": "2019-03-22T20:38:59Z", "content": "Pinterest, the social media site for \"pinning\" images and shopping, filed a public S-1 on Friday in preparation for an IPO that could take place as soon as April. \r\n The company will list on the New York Stock Exchange under the ticker symbol \"PINS,\" accordin… [+815 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sam Fellman", "title": "7 winning strategies Navy SEALs use to overcome sleep deprivation", "description": "Set a sleep routine that relaxes you in the hours before bed — and follow it. When you're stressed or overwhelmed, write out a plan that helps you focus on how you'll face the challenges tomorrow. Recognize when you're really tired. Nap. Ask others for help. …", "url": "https://www.businessinsider.com/sleep-tips-from-navy-seals-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c951a816b526517c70f2b4a-960-480.jpg", "publishedAt": "2019-03-22T20:36:59Z", "content": "Growing evidence suggests that poor sleep habits harm our health, our relationships, even our jobs. So if you're having trouble sleeping, then it's time to get back to the basics — military style. \r\n Special operators, who are sent on the US military's most d… [+1249 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "A glossy new startup in Hudson Yards that bills itself an 'urban sanctuary' is betting people will pay $6 to access showers, phone booths, and a nap pod for 30 minutes. Here's what it looks like inside.", "description": "3DEN at Hudson Yards offers work spaces, Casper nap pods, showers, a meditation room, soundproof phone booths, and coffee and snacks in a spacious, plant-filled lounge overlooking the Vessel. It costs $6 for 30 minutes. Everything can be done on 3DEN's app, f…", "url": "https://www.businessinsider.com/3den-hudson-yards-coworking-nap-shower-meditate-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9531d616c9581b274e7b0c-2732-1366.jpg", "publishedAt": "2019-03-22T20:33:00Z", "content": "If you find yourself at Hudson Yards, New York City's new $25 billion neighborhood, and you need to get some work done, make a private phone call, sit and meditate, take a nap, or even take a shower, there's one place where you can, in fact, do all of those t… [+1735 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Becky Peterson", "title": "Billion-dollar startup Zoom filed to go public — and shares of a totally unrelated company also called called Zoom shot up 1,100% (ZOOM)", "description": "Zoom Video Communications, a $1 billion startup, filed for its much-anticipated IPO on Friday. Zoom Technologies, a completely unrelated company, saw its shares spike 1,100% in the aftermath. That company trades under the ticker symbol \"Zoom,\" which likely le…", "url": "https://www.businessinsider.com/zoom-ipo-otc-stock-flying-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9541b377584e20cc491798-960-480.png", "publishedAt": "2019-03-22T20:30:00Z", "content": "On Friday, hot $1 billion startup Zoom Video Communications filed for its long-awaited IPO. \r\n And in the immediate aftermath, Zoom Technologies, a $150,000 company which has nothing to do with the other Zoom, saw its stock spike up as high as 1,100%. \r\n Zoom… [+1093 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hillary Hoffower", "title": "11 stunning island and beachfront homes for sale across the US for under $1 million", "description": "Island and beachfront homes don't have to cost millions. We teamed up with Trulia to find some of the most affordable of their kind in the US for less than $1 million. A cottage in the Hamptons, land of multi-million dollar homes, is up for sale for just over…", "url": "https://www.businessinsider.com/island-beachfront-homes-for-sale-usa-under-1-million-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93ca41daa50705ea3c928e-1136-568.jpg", "publishedAt": "2019-03-22T20:21:00Z", "content": "Why take a vacation to an island when you can live on one? Turns out, you don't always need to spend a fortune to live in paradise. \r\nWe teamed up with Trulia to find some of the most affordable island and beachfront homes in the US, and there were plenty for… [+742 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matt Weinberger", "title": "Microsoft's cloud boss explains how it's packaging up its best technology to win customers across gaming, cybersecurity, and augmented reality (MSFT)", "description": "Microsoft has been busy: In less than a month, it unveiled the HoloLens 2 headset, the Azure Sentinel security service, and Game Stack for video game developers. Microsoft Executive VP Scott Guthrie tells us that what this all has in common is the company tak…", "url": "https://www.businessinsider.com/microsoft-executive-vp-scott-guthrie-hololens-game-stack-azure-sentinel-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b89dc2a959f342d008b587e-2732-1366.jpg", "publishedAt": "2019-03-22T20:13:06Z", "content": "Microsoft has had a busy few weeks. \r\n Since the end of February, Microsoft has unveiled the HoloLens 2 augmented reality headset, the Azure Sentinel cloud computing security service, and Game Stack, a unified set of tools to help game developers build with M… [+4636 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dennis Green", "title": "Here's how shopping on Wish, the $8.7 billion site that sells Chinese goods at rock-bottom prices, compares to Amazon (AMZN)", "description": "Wish is a platform that nearly exclusively sells goods produced in China for rock-bottom prices. The company's CEO told Forbes this month that he rebuffed possible acquisition interest from Amazon in 2016. Wish and Amazon are on different ends of the online-s…", "url": "https://www.businessinsider.com/amazon-wish-how-shopping-experience-compares-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c952a3686d56e1dd863cdb9-1136-568.jpg", "publishedAt": "2019-03-22T19:57:00Z", "content": "For those used to purchasing on large online shopping websites, Wish can be a bit of an adjustment. \r\n None of the merchandise looks particularly attractive, and the prices are rock-bottom. Some items are literally free and only require paying for shipping. I… [+1033 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Anthony L. Fisher", "title": "Trump's executive order defending free speech on college campus is spare on details, and the ceremonial signing felt like a partisan photo op", "description": "President Trump signed an executive order Thursday ostensibly protecting free speech on college campuses. \"Under the guise of speech codes and safe spaces and trigger warnings, these universities have tried to restrict free thought, impose total conformity an…", "url": "https://www.businessinsider.com/trump-executive-order-college-campus-free-speech-lacks-details-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94f2c88e436a144a073042-2732-1366.jpg", "publishedAt": "2019-03-22T19:56:02Z", "content": "President Trump made young conservative activists feel seen Thursday when he signed an executive order headlined, \"IMPROVING FREE INQUIRY, TRANSPARENCY, AND ACCOUNTABILITY AT COLLEGES AND UNIVERSITIES.\" \r\n \"Under the guise of speech codes and safe spaces and … [+5369 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman and Kate Taylor", "title": "Howard Schultz won’t commit to a female vice presidential running mate. Here are the other male candidates who have.", "description": "Howard Schultz, the former Starbucks CEO who's considering an independent presidential run, told INSIDER on Friday that he can't commit yet to having a woman running mate. Schultz said that, if elected, he'll have the most diverse presidential cabinet in US h…", "url": "https://www.businessinsider.com/male-candidates-commit-to-female-vice-presidential-running-mate-howard-schultz-wont-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c952ac46b52651a701f5152-1136-568.jpg", "publishedAt": "2019-03-22T19:55:34Z", "content": "Howard Schultz, the former Starbucks CEO who announced in January that he's \"seriously considering\" a presidential run as a centrist independent, told Business Insider on Friday that he won't commit yet to having a woman running mate. \r\n \"At this point I woul… [+2608 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Becky Peterson", "title": "Hot video meeting startup Zoom filed to go public, and it's profitable", "description": "Zoom, the $1 billion video conferencing startup, publicly filed for an IPO on Friday. The company didn't price its upcoming IPO, but indicated in the filing that it will list on the Nasdaq under the ticker symbol \"ZM.\" The company is profitable, and grew reve…", "url": "https://www.businessinsider.com/zoom-files-to-go-public-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c953a2086291320bd104203-2732-1366.jpg", "publishedAt": "2019-03-22T19:47:12Z", "content": "Zoom, the $1 billion video conferencing startup that competes with Cisco WebEx, publicly filed its S-1 on Friday. The news confirms Business Insider's earlier reporting that the company aims to go public in April. \r\n This makes Zoom the latest in a long list … [+1763 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Frohwein, Contributor", "title": "No, it’s not money — this is the one thing small businesses need to succeed, according to survey", "description": "Kabbage recently polled 600 thriving US small business owners to better understand their cash flow issues and found that a third of them started with less than $5,000. In this op-ed, Kabbage CEO Rob Frohwein writes that traits like self-confidence, grit, and …", "url": "https://www.businessinsider.com/small-businesses-need-confidence-to-succeed-kabbage-survey-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9536a92cc7401dc46dffa2-960-480.jpg", "publishedAt": "2019-03-22T19:40:59Z", "content": "As any entrepreneur knows, it's easy for doubts to creep in when starting a business. It's no surprise that having enough capital tops the list of concerns, but there's optimism to share for those starting their business journey when it comes to limited fundi… [+4636 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Trump just threw out US North Korea policy because he 'likes' Kim Jong Un, and now everyone is really confused", "description": "President Donald Trump on Friday walked back new Treasury Department sanctions aimed at hurting North Korea. The White House explained the move by stating Trump \"likes\" North Korean leader Kim Jong Un, adding that the president doesn't think the sanctions are…", "url": "https://www.businessinsider.com/trump-upends-us-north-korea-policy-because-he-likes-kim-jong-un-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c952bdf09b6032092475c14-1536-768.jpg", "publishedAt": "2019-03-22T19:31:02Z", "content": "The US government's new policy toward North Korea is apparently that President Donald Trump \"likes\" Kim Jong Un and is willing to let his friend slide on sanctions, a move that seemed to take his own administration by surprise. \r\n Trump prompted confusion on … [+3738 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Danny Bakst", "title": "We tried 'Game of Thrones'-themed scotch, wine, and beer — and we threw anything we didn't like out the Moon Door", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/game-of-thrones-scotch-wine-beer-review", "urlToImage": "https://amp.businessinsider.com/images/5c925128f73f5c3cd759cdf6-1136-568.jpg", "publishedAt": "2019-03-22T19:30:00Z", "content": "There are many differences that separate the various regional communities in Westeros, but one thing that connects them all is alcohol consumption. Wine is one of the most popular drinks in Westeros, with original blends created from the southern lands of Dor… [+998 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bob Bryan", "title": "The US posted a $234 billion budget deficit last month, the biggest one-month deficit in history", "description": "The US budget deficit hit $234 billion in the month of February, up 8.7% compared to the same month last year. The February budget deficit was also the highest one-month deficit on record, eclipsing the previous record set in 2012. The deficit is growing as t…", "url": "https://www.businessinsider.com/us-budget-deficit-hits-record-february-national-debt-2019-3", "urlToImage": "https://amp.businessinsider.com/images/56660a8ec2814477008b81e6-2732-1366.jpg", "publishedAt": "2019-03-22T19:16:54Z", "content": "The US posted a record budget deficit in the month of February, according to a new report form the Treasury Department. \r\n The budget deficit for February came in at $234 billion, according to the Treasury, higher than the previous monthly record of $231.7 bi… [+1785 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hayley Peterson", "title": "Walmart is quietly closing stores — here's the full list (WMT)", "description": "Walmart is closing eight stores in the United States. The closing stores include one Walmart Supercenter in Lafayette, Louisiana, and seven Walmart Neighborhood Market stores in Arizona, California, Kansas, South Carolina, Tennessee, Virginia, and Washington.…", "url": "https://www.businessinsider.com/walmart-stores-closing-list-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c952e8b16c9581ab8480821-1920-960.jpg", "publishedAt": "2019-03-22T19:13:17Z", "content": "Walmart is closing at least eight US stores across eight states. \r\n The closing stores include one Walmart Supercenter in Lafayette, Louisiana, and seven Walmart Neighborhood Market stores in Arizona, California, Kansas, South Carolina, Tennessee, Virginia, a… [+1238 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "The Google Home Max is one of the best smart speakers you can buy, but it's normally $400 — it's on sale for $300 right now", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/google-home-max-sale-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c952ef48e436a1d0454f358-1136-568.jpg", "publishedAt": "2019-03-22T19:10:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1501 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "CBS hired a special cameraman to work the 'Zion Cam' and record every move the Duke star makes in his NCAA tournament run", "description": "Expectations are high for the Duke Blue Devils in March Madness. Throughout the college basketball season, Duke has been the most dominant team in the country, led by standout superstar Zion Williamson. CBS is set to take advantage of Williamson's star power …", "url": "https://www.businessinsider.com/zion-williamson-cbs-cam-march-madness-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9527e42cc7401b6073972d-1536-768.jpg", "publishedAt": "2019-03-22T19:08:42Z", "content": "Zion Williamson has been the most dominant player in college basketball all season. \r\n Between his monstrous dunks, unbelievably athletic defense, and affable personality, Williamson has captured the imaginations of college basketball fans across the country,… [+2158 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "Netflix's Mötley Crüe movie, 'The Dirt,' is being called a boring and 'wonderfully bad' music biopic in the vein of 'Bohemian Rhapsody'", "description": "Netflix's new biopic about rock band Mötley Crüe is being torn apart by critics and has a 46% Rotten Tomatoes critic score. Indiewire's David Ehrlich compared it to \"Bohemian Rhapsody,\" and said that it \" could have been made about any one of a zillion other …", "url": "https://www.businessinsider.com/netflixs-motley-crue-movie-the-dirt-gets-bad-reviews-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c952dd38e436a1d0454f352-960-480.jpg", "publishedAt": "2019-03-22T19:02:31Z", "content": "It looks like Netflix has its own mediocre music biopic on its hands, at least according to movie critics. \r\n Netflix's \"The Dirt,\" a biopic about rock band Mötley Crüe, debuted on the streaming giant on Friday, and has been torn apart by critics. It has a 46… [+1243 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Price", "title": "Facebook was warned about Cambridge Analytica issues months earlier than previously disclosed (FB)", "description": "Facebook was warned about issues with Cambridge Analytica months before the first reports in 2015. A court filing reveals that an employee was raising red flags internally back in September 2015. Facebook says it hasn't \"misled\" anyone about the timeline of t…", "url": "https://www.businessinsider.com/facebook-warned-cambridge-analytica-months-earlier-2015-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c952b288e436a1c6849d8e7-2560-1280.jpg", "publishedAt": "2019-03-22T19:02:08Z", "content": "Facebook employees had been warned about allegations that Cambridge Analytica was misusing users' data from the social network months earlier than previously disclosed. \r\n A court filing from the Washington DC attorney general made public this week said that … [+2692 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "How to unfriend and unfollow people on Facebook", "description": "You can unfriend someone on Facebook in two clicks, but it can't be undone without your former Facebook friend accepting a new friend request. Your Facebook \"friend\" won't be notified when you unfriend them, but you'll disappear from their friend list. Blocki…", "url": "https://www.businessinsider.com/how-to-unfriend-on-facebook", "urlToImage": "https://amp.businessinsider.com/images/5c9524fd09b6031f2e3d6458-2732-1366.jpg", "publishedAt": "2019-03-22T19:02:00Z", "content": "There are a lot of good reasons to cut ties (in some form) with Facebook friends. \r\n Maybe your sister-in-law just won't stop posting pictures of her dog or your cousin is cluttering up your feed with political screeds. Or maybe you just went through a breaku… [+2757 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Linette Lopez", "title": "Stephen Moore is going to embarrass himself (and us) at the Fed", "description": "President Donald Trump has asked the conservative economic commentator Stephen Moore to join the Federal Reserve Board. This is a mistake. The Federal Reserve is supposed to make policy independent of the White House and the GOP, and Moore has demonstrated he…", "url": "https://www.businessinsider.com/stephen-moore-bad-choice-for-federal-reserve-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9528f27563b0198b44ae25-2732-1366.jpg", "publishedAt": "2019-03-22T19:01:00Z", "content": "President Donald Trump has asked the conservative economic commentator Stephen Moore to join the Federal Reserve,according to reports. He is not suited for the role. \r\n The Federal Reserve is supposed to work independently of the White House, and Moore will n… [+2737 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Remi Rosmarin", "title": "Amazon's baby registry is easy to use and offers tons of benefits to expecting parents — here's how it works", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/amazon-baby-registry-overview", "urlToImage": "https://amp.businessinsider.com/images/5c93eaf37563b0006e4e77b2-1136-568.jpg", "publishedAt": "2019-03-22T18:55:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+5448 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "Howard Schultz slams the 'vilification' of successful people in business as 'left-leaning' Democratic presidential hopefuls enter the 2020 race (SBUX)", "description": "Howard Schultz criticized the rise of what he called the \"vilification\" of business success and capitalism as presidential hopefuls vie for the Democratic nomination. \"I'm equally concerned about both a socialist democratic president as well as reelecting Don…", "url": "https://www.businessinsider.com/howard-schultz-slams-vilification-business-politics-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c54a478936c0e1f52229fd2-2732-1366.jpg", "publishedAt": "2019-03-22T18:52:06Z", "content": "DENVER, Colorado — Former Starbucks CEO Howard Schultz is doubling down on his centrist viewpoint as more 2020 presidential hopefuls throw their hat in the ring for the Democratic nomination. \r\n \"In the last few months, there's been a level of vilification on… [+3813 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Avella", "title": "NBA legend Kareem Abdul-Jabbar explains why the NCAA should pay college athletes", "description": "The NCAA made nearly $1.1 billion in revenue in 2017. NBA legend Kareem Abdul-Jabbar says he thinks college athletes should be paid. In the video above, the \"Mycroft Holmes\" author explains why the NCAA should pay their athletes. Following is a transcript of …", "url": "http://www.businessinsider.com/kareem-abdul-jabbar-ncaa-should-pay-their-athletes-2015-10", "urlToImage": "https://amp.businessinsider.com/images/561805a069bedd944d4a394b-750-375.jpg", "publishedAt": "2019-03-22T18:43:00Z", "content": "Following is a transcript of the video.\r\nKareem Abdul-Jabbar: I think college athletes should be paid because they're being exploited. The NCAA makes a couple billion dollars each year and the people who actually do the work that enables them to make that mon… [+428 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "Elon Musk hints that the web browsers in Tesla cars are going to get a lot better, thanks to technology created by Google (TSLA)", "description": "Tesla CEO Elon Musk tweeted on Friday that the browsers of Tesla cars will be updated to run on the Chromium web browser — which could fix a major Tesla owner frustration with the current browser. Chromium is Google 's open source web browser project, and for…", "url": "https://www.businessinsider.com/elon-musk-tesla-web-browser-chromium-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c409dbbecbeb43710270a1d-1136-568.jpg", "publishedAt": "2019-03-22T18:39:18Z", "content": "Tesla CEO Elon Musk tweeted Friday that the company's electric cars are getting a new web browser. \r\n After a Tesla owner complained on Twitter about the unreliability of the browser in their vehicle's dashboard, Musk replied that a forthcoming software updat… [+1720 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "A little-known practice in the pharma industry is under threat, and a new memo reveals how the companies that rely on it are bracing for change (CVS, UNH)", "description": "CVS Health is asking drugmakers not to increase the net cost of their drugs should rebates go away, according to a letter obtained by Business Insider. It's a response to a proposed rule from the Trump administration that could end these payments. Pharmacy-be…", "url": "https://www.businessinsider.com/cvs-health-asks-drugmakers-not-to-increase-net-cost-of-medicare-drugs-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c756d291631a37ea63cb6e7-2732-1366.jpg", "publishedAt": "2019-03-22T18:33:00Z", "content": "A little-known practice that healthcare middlemen use to negotiate drug prices might go away, and one of the biggest company's in the space is bracing for it. \r\n On Thursday, CVS Health, which operates the pharmacy benefit manager CVS Caremark, wrote to drugm… [+5485 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Malarie Gokey", "title": "The best stylish smartwatches for women", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-smartwatch-women", "urlToImage": "https://amp.businessinsider.com/images/5c95147f569b5518036c07e0-960-480.jpg", "publishedAt": "2019-03-22T18:30:00Z", "content": "Why you'll love it: The Fitbit Versa is a better fitness tracker than it is a smartwatch, but if that's what you want, it's a great alternative. \r\n If what you really want is a great fitness tracker with a few key smartwatch features and not a techy smartwatc… [+3027 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Richard Feloni", "title": "How a love for yoga led Aetna's former CEO to raise the insurance giant's minimum wage to $16 an hour", "description": "Mark Bertolini is the former CEO of the health insurance company Aetna. He is remembered for the employee benefits he brought to Aetna, including raising the minimum wage for its lowest paid workers to $16 an hour. He said that it began when he saw the succes…", "url": "https://www.businessinsider.com/former-aetna-ceo-mark-bertolini-investing-in-employees-health-yoga-benefits2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92924adaa5074c0e6fca56-1920-960.jpg", "publishedAt": "2019-03-22T18:07:00Z", "content": "Former Aetna CEO Mark Bertolini considers raising the company's minimum wage to $16 an hour in 2015 one of the proudest moments in his career. In an interview with Business Insider in February, he admitted the decision was influenced by a surprising source: h… [+2995 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "The 23 top Marvel Cinematic Universe sidekicks and supporting heroes, ranked from worst to best", "description": "When you think about the Marvel Cinematic Universe, popular heroes like Captain America, Iron Man, and Black Panther probably spring to mind first. Or you might even think about the notable villains like Loki and Killmonger. But the MCU is also rich with memo…", "url": "https://www.businessinsider.com/marvel-cinematic-universe-sidekicks-ranked-from-worst-to-best-2018-4", "urlToImage": "https://amp.businessinsider.com/images/5c9521d6dc676718f735d615-1334-667.jpg", "publishedAt": "2019-03-22T18:01:00Z", "content": "\"Black Panther\"\r\n Marvel \r\nWhen you think about the Marvel Cinematic Universe, popular heroes like Captain America, Iron Man, and Black Panther probably spring to mind first. Or you might even think about the notable villains like Loki and Killmonger. \r\n But … [+997 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Antonio Villas-Boas", "title": "AT&T's controversial '5G E' network is actually slower than existing LTE networks operated by Verizon and T-Mobile, according to tests in a new report (T)", "description": "AT&T's \"5G E\" network was tested against the LTE networks from other carriers by Open Signal, and AT&T's network performed about the same. It's not the performance anyone was expecting from 5G, but that's because AT&T's \"5G E\" network isn't actually 5G. It's …", "url": "https://www.businessinsider.com/att-5g-e-performance-not-faster-than-verizon-t-mobile-lte-network-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c95187d8629131b36632e8d-1920-960.jpg", "publishedAt": "2019-03-22T17:46:00Z", "content": "AT&amp;T's \"5G E\" network delivers about the same speeds as Verizon and T-Mobile's 4G LTE networks, according to a report by networking research company Open Signal. \r\n In fact, AT&amp;T's \"5G E\" network performed slightly worse than its two main competitors'… [+2588 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "The myth of the Bernie Bro: Bernie Sanders' supporters are more diverse than the prevailing narrative suggests", "description": "Sen. Bernie Sanders has often faced criticism for not doing enough to reach out to women and voters of color, and the prevailing narrative is that his base is mostly white and male — a monolithic group often called Bernie Bros. But recent polling on 2020 Demo…", "url": "https://www.businessinsider.com/bernie-bro-myth-sanders-base-more-diverse-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9510dbee52ef1b0d25a478-2732-1366.jpg", "publishedAt": "2019-03-22T17:33:00Z", "content": "One of the prevailing narratives surrounding Sen. Bernie Sanders is that he doesn't appeal to a broad group of voters, and that the majority of his supporters are young, white men often referred to as \"Bernie Bros.\" \r\n There's no doubt that Sanders struggled … [+2961 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "John McCain described how he received the Steele dossier that contains the most salacious allegations about Trump and Russia", "description": "The late Republican Sen. John McCain provided dramatic details of how he obtained the infamous Trump-Russia dossier in his new book, \" The Restless Wave.\" The Trump-Russia dossier alleges the Kremlin has been \"cultivating, supporting, and assisting\" Trump for…", "url": "https://www.businessinsider.com/how-john-mccain-received-steele-dossier-trump-russia-2018-5", "urlToImage": "https://amp.businessinsider.com/images/5b0473ed1ae662d2048b4d7b-1920-960.jpg", "publishedAt": "2019-03-22T17:27:00Z", "content": "Sen. John McCain released his seventh book on Tuesday.\r\n Carolyn Kaster/AP Photos \r\nThe late Sen. John McCain provided intimate details of how he obtained the infamous so-called Steele dossier in his 2018 book, \"The Restless Wave.\" \r\n The Republican senator w… [+4933 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Audrey Schomer", "title": "Apple's news service just landed The Wall Street Journal (AAPL, NYT, GHC)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here. Apple has convinced The Wall Street Journal to participate in it…", "url": "https://www.businessinsider.com/apple-lands-wall-street-journal-apple-news-service-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c950bda0cf91316d734965c-1136-568.png", "publishedAt": "2019-03-22T17:27:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Apple has convinced The Wall Street Journal to participate in … [+2415 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nicholas Shields", "title": "Uber Freight will face challenges in Europe (DPSGY, XPO, CHRW)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Transportation & Logistics Briefing subscribers. To receive the full story plus other insights each morning, click here. Uber Freight, the digital freight marketplace arm o…", "url": "https://www.businessinsider.com/uber-freight-europe-expansion-challenges-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c6eeed61631a309c057e5e2-960-480.jpg", "publishedAt": "2019-03-22T17:22:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Transportation &amp; Logistics Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Uber Freight, the digital freight marketplace… [+3409 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lea Nonninger", "title": "Banks are struggling to meet the latest PSD2 deadline", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here. Forty-one percent of European banks did not comply with the latest PSD…", "url": "https://www.businessinsider.com/european-banks-miss-psd2-deadline-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9502df2cc74015ed42788b-320-160.jpg", "publishedAt": "2019-03-22T17:06:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Forty-one percent of European banks did not comply with the latest P… [+3349 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Slotnick", "title": "American Express has a little-known program called AmEx Offers — you can use it to get huge discounts and bonus points", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/how-amex-offers-work", "urlToImage": "https://amp.businessinsider.com/images/5c9508212cc74016d522a345-1920-960.jpg", "publishedAt": "2019-03-22T17:00:00Z", "content": "American Express issues a number of different credit and charge cards that have unique perks, benefits, and rewards. \r\n For instance, the AmEx Platinum offers access to more than 1,000 airport lounges around the world, while the American Express® Gold Card ea… [+3938 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "'Let everybody else waste money' — 17 of Jamie Dimon's most brilliant quotes", "description": "JPMorgan Chase chairman and CEO Jamie Dimon has frequently shared his opinion on the economy, politics, success, and more. We rounded up 17 of Dimon's most brilliant quotes below. Jamie Dimon, the chairman and CEO of JPMorgan Chase, is one of the most famous …", "url": "https://www.businessinsider.com/jamie-dimon-best-quotes-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c41bb12719671538e022374-2732-1366.jpg", "publishedAt": "2019-03-22T16:58:00Z", "content": "Jamie Dimon.\r\n Chip Somodevilla / Getty Images \r\n Jamie Dimon, the chairman and CEO of JPMorgan Chase, is one of the most famous bankers in America. \r\n The exec has a net worth of $1.3 billion, and since he took the helm of JPMorgan Chase at the end of 2005, … [+394 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Harrison Jacobs and Annie Zheng", "title": "I spent 5 days on a Tanzanian safari and saw wild lions, elephants, and rhinos — but it made me realize there are 2 factors that can make or break your trip", "description": "Located in East Africa, Tanzania is home to some of the greatest conservation areas and parks in the world, including the Serengeti, an area spanning 12,000 miles of grasslands, forests, swamps, and woodlands teeming with wildlife. On a recent five-day safari…", "url": "https://www.businessinsider.com/what-safari-in-africa-is-like-tanzania-and-serengeti-tips-photos-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c9513302cc7401875530f00-750.jpg", "publishedAt": "2019-03-22T16:55:00Z", "content": "\"Safaris are different in every country. But there is no safari like a safari in Tanzania.\" That's what my guide, Charles Nnko, told me, after I touched down in Arusha, Tanzania last month. We were in a Franken-Land Rover, rumbling down a highway that inadver… [+1261 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Goldfarb, bioGraphic", "title": "An indigenous tribe in Washington is strategically placing beavers around to help salmon", "description": "An indigenous tribe in Washington is setting up beaver dams to help rebuild the salmon habitat. Beaver dams create lazy side channels that baby salmon need to conserve energy and evade predators. Even in good conditions, getting beavers to stay where you put …", "url": "https://www.businessinsider.com/strategically-placing-beavers-around-to-help-salmon-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9512c009b6031c860899f5-1920-960.jpg", "publishedAt": "2019-03-22T16:54:11Z", "content": "It's before dawn on a late August morning, the Washington sky blanched with smoke drifting from distant wildfires, and Molly Alves and David Bailey have caught a beaver. \r\n The two biologists haul the ornery package of fat and fur, still penned into the trap … [+32528 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bob Bryan", "title": "Trump is planning to appoint a conservative economist to the Federal Reserve Board who has repeatedly called for the entire Federal Reserve to be fired", "description": "President Donald Trump said Friday that he will nominate conservative economist Stephen Moore to the Federal Reserve's Board of Governors. Moore has been an ardent supporter of Trump and helped craft the president's economic message during the 2016 campaign. …", "url": "https://www.businessinsider.com/trump-will-appoint-stephen-moore-federal-reserve-board-of-governors-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5900a9b47522ca3a268b63f0-1136-568.png", "publishedAt": "2019-03-22T16:53:05Z", "content": "President Donald Trump told reporters on Friday that he plans to appoint Stephen Moore, a conservative economist who helped advise the president's 2016 campaign, to a seat on the Federal Reserve Board. \r\n Moore helped to craft Trump's economic messaging in 20… [+1894 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ryan Pickrell", "title": "Trump is reportedly ready to sell dozens of new fighter jets to Taiwan, and China is already furious", "description": "The Trump administration has given \"tacit approval\" to Taiwan's request for 60 new F-16 fighter jets, Bloomberg News reported. The sale has yet to be officially approved, but China is already furious and protesting it. \" China’s position to firmly oppose US a…", "url": "https://www.businessinsider.com/china-outraged-as-trump-expected-to-sell-new-fighters-to-taiwan-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5926e778621e6cb9018b4a4c-1920-960.jpg", "publishedAt": "2019-03-22T16:41:43Z", "content": "The Trump administration is reportedly ready to approve the sale of dozens of new fighter jets to Taiwan, and China is not happy about it, Bloomberg News reported. \r\n Taiwan has requested 60 new F-16s that are more capable than the last batch of fighters the … [+3007 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Record flooding is devastating the Midwest and could saddle Nebraska's farmers with nearly $1 billion of damage", "description": "Record flooding across the Midwest has damaged agricultural fields and killed livestock. Farmers will face hundreds of millions of dollars worth of damage, according to experts. That comes at a time when farmers are already struggling from low commodity price…", "url": "https://markets.businessinsider.com/news/stocks/nebraska-flooding-animals-crops-farmers-nearly-1-billion-damage-2019-3-1028052702", "urlToImage": "https://images.markets.businessinsider.com/image/5c950c1e0cf91316e03ed28b-2400/ap19079767992156.jpg", "publishedAt": "2019-03-22T16:40:00Z", "content": "DroneBase via AP\r\nRecord flooding across the Midwest has damaged agricultural fields and killed livestock.\r\nFarmers will face hundreds of millions of dollars worth of damage, according to experts.\r\nThat comes at a time when farmers are already struggling from… [+2343 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Amir Ismael", "title": "Save an extra 50% on sale styles at Bonobos — and more of today's best deals from around the web", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/deal-of-the-day-bonobos-final-sale-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c547752b3573316e51c1a36-960-480.jpg", "publishedAt": "2019-03-22T16:40:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+4186 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Record flooding is devastating the Midwest and could saddle Nebraska's farmers with nearly $1 billion of damage", "description": "Record flooding across the Midwest has damaged agricultural fields and killed livestock. Farmers will face hundreds of millions of dollars worth of damage, according to experts. That comes at a time when farmers are already struggling from low commodity price…", "url": "https://www.businessinsider.com/nebraska-flooding-animals-crops-farmers-nearly-1-billion-damage-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c950c3609b6031b6f467cc2-2732-1366.jpg", "publishedAt": "2019-03-22T16:40:00Z", "content": "Record flooding has devastated farmers across the Midwest, hitting them hundreds of millions of dollars worth of damage to crops and livestock at a time when some are already struggling to make ends meet. \r\n Nebraska has been bearing the brunt of the pain so … [+2062 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "Former Starbucks CEO Howard Schultz comes out against Elizabeth Warren's plan to break up tech giants like Amazon (SBUX)", "description": "Howard Schultz does not agree with Sen. Elizabeth Warren's plan to break up tech giants such as Amazon and Facebook, the former Starbucks CEO told Business Insider on Friday. \"What I do agree with is the government needs to create oversight — not regulation —…", "url": "https://www.businessinsider.com/howard-schultz-opposes-elizabeth-warren-plan-break-up-amazon-big-tech-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c5c98c974c5871f4034e298-2732-1366.jpg", "publishedAt": "2019-03-22T16:31:40Z", "content": "DENVER, Colorado — Howard Schultz, the former Starbucks CEO who is \"seriously considering\" a presidential run as a centrist independent, has come out against Sen. Elizabeth Warren's plan to break up tech giants like Amazon. \r\n \"I do not agree with Elizabeth W… [+1765 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Johnson", "title": "How to permanently delete your Google account (and save your data)", "description": "A Google account gives you access to many free services, but it's possible to completely and permanently delete it. It's a really good idea to save a copy of all your Google data before you delete the account. Here's how to save your data from and permanently…", "url": "https://www.businessinsider.com/how-to-delete-google-account", "urlToImage": "https://amp.businessinsider.com/images/5c950a188e436a180c0fa667-2732-1366.jpg", "publishedAt": "2019-03-22T16:30:00Z", "content": "With over 1.5 billion active Gmail users, about one person in every five on earth has a Google account. If you're among them but want to sever your ties, Google makes it possible to permanently delete your Google account. You might want to do that because you… [+2933 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury and Dennis Green", "title": "Costco's Kirkland brand has become a secret weapon worth as much as $75 billion (COST)", "description": "Costco 's Kirkland Signature brand is one of the company's biggest assets, accounting for nearly a third of it sales. According to a recent report from UBS, Kirkland could be worth around $75 billion, which the analysts estimate is around $15 billion more tha…", "url": "https://www.businessinsider.com/costco-kirkland-brand-drives-growth-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c95048416c958151747149e-750-375.jpg", "publishedAt": "2019-03-22T16:20:53Z", "content": "Costco shoppers can't get enough of its Kirkland brand, and it's become one of the store's biggest assets. \r\n According to a recent report from UBS, the Kirkland Signature label could be worth as much as $75 billion. That is over $15 billion more than Estee L… [+2137 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "James Brains", "title": "The best KitchenAid mixers you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-kitchenaid", "urlToImage": "https://amp.businessinsider.com/images/5b4660c715add92a008b46fb-960-480.jpg", "publishedAt": "2019-03-22T16:20:00Z", "content": "The KitchenAid Professional 5 Plus has a ten-speed motor with a slow start function and overload protection. The mixer comes with a five-quart stainless steel mixing bowl featuring an ergonomic handle. Also, the hinged hub cover flips up to make it easier to … [+1953 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "One crucial detail was missing from Google’s huge gaming announcement: Games!", "description": "Google just announced its intentions to enter the video game industry. Instead of making a video game console, Google is launching a streaming video game platform named Stadia. The announcement promised a lot, and it sounds good on paper, but it was missing o…", "url": "https://www.businessinsider.com/google-console-stadia-announcement-missing-video-games-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91432df73f5c28fd404c85-1136-568.jpg", "publishedAt": "2019-03-22T16:11:33Z", "content": "In the lead up to a new video game console launch, there's a lot of hype around hardware bells and whistles. Forum threads light up with spec comparisons, and people furiously break down the potential benefits and liabilities of using particular types of RAM … [+1201 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sam Rega", "title": "Shaq is investing in 9 Papa John's locations — here's where 7 other celebrities own fast food chains", "description": "Retired NBA player Shaquille O'Neal just invested in nine Papa John's pizza chain restaurants and joined the company's board of directors. Celebrities often invest in ventures outside of their industries to diversify their wealth. Watch the video above to see…", "url": "https://www.businessinsider.com/map-celebrity-chain-restaurants-burger-king-papa-johns-shaq-2017-1", "urlToImage": "https://amp.businessinsider.com/images/588621bef10a9a98468b9108-1920-960.jpg", "publishedAt": "2019-03-22T16:10:00Z", "content": "EDITOR'S NOTE: This video was originally published on January 23, 2017."}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sam Rega", "title": "Shaq is investing in 9 Papa John's locations — here's where 7 other celebrities own fast food chains", "description": "Retired NBA player Shaquille O'Neal just invested in nine Papa John's pizza chain restaurants and joined the company's board of directors. Celebrities often invest in ventures outside of their industries to diversify their wealth. Watch the video above to see…", "url": "http://www.businessinsider.com/map-celebrity-chain-restaurants-burger-king-papa-johns-2016-10", "urlToImage": "https://amp.businessinsider.com/images/588621bef10a9a98468b9108-1920-960.jpg", "publishedAt": "2019-03-22T16:10:00Z", "content": "EDITOR'S NOTE: This video was originally published on January 23, 2017."}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "Yet another recession warning just flashed red — a Treasury 'yield curve' just inverted for the first time since 2007", "description": "The three-month to 10-year US Treasuries yield curve has inverted for the first time since 2007. US Treasuries yield curves are key indicators that credit markets fear recession. The Dow tumbled 400 points as yield curve inversion sparked growth concerns. A k…", "url": "https://www.businessinsider.com/3-month-10-year-treasury-yield-curve-inverted-for-first-time-since-07-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94f67ddc67671202034a9b-1920-960.jpg", "publishedAt": "2019-03-22T16:02:20Z", "content": "A keenly watched measure of market sentiment on recession has just indicated that recession is increasingly on the cards. \r\n 10-year Treasury yields declined Friday, continuing from a more than one-year low which has led to the three-month and 10-year yield c… [+1463 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Obama to meet with freshmen Democrats, including controversial members Alexandria Ocasio-Cortez and Ilhan Omar", "description": "Former President Barack Obama is set to meet with the freshmen House Democratic class next week in Washington, including controversial members Alexandria Ocasio-Cortez of New York and Ilhan Omar of Minnesota. While Obama is largely revered among fellow Democr…", "url": "https://www.businessinsider.com/obama-will-meet-freshmen-democrats-ocasio-cortez-omar-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94ed44569b5511b83c0ed4-1136-568.jpg", "publishedAt": "2019-03-22T16:00:48Z", "content": "Former President Barack Obama is looking to make some new friends in Washington. \r\n He's set to gather with the more than 60 freshman House Democrats next week at a meet and greet in Washington, Politico reported Friday, including controversial members Alexan… [+1668 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steve Cameron", "title": "Why Canada Goose jackets are so expensive", "description": "Canada Goose started out as a working-class brand in 1957, but has since transformed into a status-symbol. Its jackets today can cost up to $1,550. The brand says that its jackets can withstand temperatures as low as -30° C and the animal fur trim protects ag…", "url": "https://www.businessinsider.com/canada-goose-jackets-expensive-2019-2", "urlToImage": "https://amp.businessinsider.com/images/5c93c939daa507056e0da5de-1136-568.jpg", "publishedAt": "2019-03-22T16:00:00Z", "content": "Following is a transcription of the video:\r\nNarrator: This jacket has been banned from a UK high school. Why? An effort to poverty-proof the school environment. Shielding low-income students from feeling bad about not having a pricey coat. Canada Goose jacket… [+4576 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Francesca Rea", "title": "21 'Amazon's Choice' products we've tried for ourselves, and use all the time", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/useful-amazons-choice-products", "urlToImage": "https://amp.businessinsider.com/images/5c94f2376b526511835f200a-1136-568.jpg", "publishedAt": "2019-03-22T15:49:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+2076 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Smith", "title": "The Apple Watch does a better job of treating my stress and anxiety than anything else I've tried (AAPL)", "description": "The Apple Watch is a great way to improve your mental and physical health. I'd been dealing with more stress and anxiety ever since moving to Canada a little less than two years ago. While I learned mindfulness techniques to help me cope, nothing has done a b…", "url": "https://www.businessinsider.com/apple-watch-series-4-breathe-app-calm-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94fac60cf913145d567bf7-1920-960.jpg", "publishedAt": "2019-03-22T15:40:14Z", "content": "More:AppleApple WatchApple Watch Series 4Mental Health\r\nPopular\r\nTheresa May prepares to give MPs vote to revoke Article 50 and cancel Brexit\r\nPopular\r\nAdidas has launched 'Game of Thrones' Ultra Boosts here's where to buy them before they sell out for good\r\n… [+376 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian Wylonis, The Org", "title": "Here are the power moves of the week: Ford nabs Snap's CFO and Kickstarter's CEO exits", "description": "Keeping an eye on major hires and promotions is one of the best ways to understand a company's strategy. The Org tracks executive changes at companies big and small. Here's a snapshot of the most important executive moves of the week across media, tech and tr…", "url": "https://www.businessinsider.com/power-moves-of-the-week-ford-boeing-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94fe4eee52ef17f612b595-750-375.jpg", "publishedAt": "2019-03-22T15:38:40Z", "content": "Every week we bring you an overview of the most important executive changes from the past week. This week, the former CFO of Snap, Tim Stone, was announced as the new Chief Financial Officer of Ford Motors. Read more about this and other notable executive cha… [+2602 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Stocks are sinking as yield curve inversion sparks growth concerns", "description": "US equities were under pressure Friday, with the major averages all down about 1.2%. The sell-off could be attributed to the inverted yield curve, the economist Ed Yardeni said. Crude oil plunged 2%, cracking below $59 a barrel. Watch the markets trade in rea…", "url": "https://www.businessinsider.com/stock-market-news-stocks-and-crude-oil-fall-yield-curve-inverts-2019-3", "urlToImage": null, "publishedAt": "2019-03-22T15:36:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Dow tumbles 400 points as yield curve inversion sparks growth concerns", "description": "US equities were under pressure Friday, with the major averages all down about 1.2%. The sell-off could be attributed to the inverted yield curve, the economist Ed Yardeni said. Crude oil plunged 2%, cracking below $59 a barrel. Watch the markets trade in rea…", "url": "https://markets.businessinsider.com/news/stocks/stock-market-news-stocks-and-crude-oil-fall-yield-curve-inverts-2019-3-1028052557", "urlToImage": "https://images.markets.businessinsider.com/image/59149688144293f8008b4620-2000/new-york-stock-exchange-0501.jpg", "publishedAt": "2019-03-22T15:36:00Z", "content": "Reuters\r\nUS equities were under pressure Friday, with the major averages all down about 1.2%.\r\nThe sell-off could be attributed to the inverted yield curve, the economist Ed Yardeni said.\r\nCrude oil plunged 2%, cracking below $59 a barrel.\r\nWatch the markets … [+1498 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Dow tumbles 400 points as yield curve inversion sparks growth concerns", "description": "US equities were under pressure Friday, with the major averages all down about 1.2%. The sell-off could be attributed to the inverted yield curve, the economist Ed Yardeni said. Crude oil plunged 2%, cracking below $59 a barrel. Watch the markets trade in rea…", "url": "https://markets.businessinsider.com/news/stocks/stock-market-news-stocks-and-crude-oil-fall-yield-curve-inverts-2019-3-1028052557", "urlToImage": "https://images.markets.businessinsider.com/image/5c9223e65dfa9945f757b0b6-2400/2019-03-20t112600z1lynxnpef2j0xyrtroptp4usa-stocks.jpg", "publishedAt": "2019-03-22T15:36:00Z", "content": "Reuters\r\nUS equities were under pressure Friday, with the major averages all down about 1.2%.\r\nThe sell-off could be attributed to the inverted yield curve, the economist Ed Yardeni said.\r\nCrude oil plunged 2%, cracking below $59 a barrel.\r\nWatch the markets … [+1498 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "Dispensed: An Alzheimer's drug flameout, a new depression drug, and a Stanford professor who saw through Elizabeth Holmes early on", "description": "Hello, OK show of hands, how many of you have finally hit your limit on Theranos/Elizabeth Holmes content? I think across the newsroom, we pulled together more than a dozen posts in the last week and a half (phew!). I'd definitely recommend checking them all …", "url": "https://www.businessinsider.com/dispensed-weekly-healthcare-newsletter-march-22-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c2f7f05bd77305daf6487b5-1920-960.jpg", "publishedAt": "2019-03-22T15:34:40Z", "content": "OK show of hands, have we finally hit our limit on Theranos/Elizabeth Holmes content? I think across the newsroom, we pulled together more than a dozen posts in the last week and a half (phew!). I'd definitely recommend checking them all out if you can't get … [+4137 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "Cam Newton says he's giving up sex for a month to make his mind 'stronger'", "description": "Carolina Panthers quarterback Cam Newton revealed on \"The Late Late Show with James Corden\" that he is giving up sex for the month of March. Newton said he creates a new challenge for himself each month, and March's challenge is a vow of chastity. Newton said…", "url": "https://www.businessinsider.com/cam-newton-giving-up-sex-month-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94f681ee52ef1691060762-1334-667.jpg", "publishedAt": "2019-03-22T15:32:47Z", "content": "While appearing on \"The Late Late Show with James Corden\" on Thursday, Carolina Panthers quarterback Cam Newton revealed he gives himself a new challenge to take on each month. \r\n He told Corden that for March, he is taking a vow of chastity. \r\n \"In March — I… [+678 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "Michigan State coach Tom Izzo came under fire after he needed to be restrained while berating one of his players", "description": "Michigan State head coach Tom Izzo came under fire after berating freshman forward Aaron Henry on Thursday. Izzo's outburst came during a timeout, with the Spartans coach eventually being restrained by his other players as he got in Henry's face. Izzo later a…", "url": "https://www.businessinsider.com/video-tom-izzo-aaron-henry-yelling-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94ee48dc6767110a08c218-1920-960.jpg", "publishedAt": "2019-03-22T15:28:37Z", "content": "Michigan State won its opening game of the 2019 NCAA tournament on Thursday against Bradley, but not without a bit of controversy befalling the Spartans head coach Tom Izzo. \r\n No. 2 Michigan State was supposed to have an easy time knocking off their 15-seed … [+1931 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "MillerCoors is suing the maker of Bud Light over its controversial Super Bowl ads about corn syrup in beer (AB, TAP)", "description": "Bud Light mocked Coors Light and Miller Lite over the beer brands' use of corn syrup in a series of ads that aired during the Super Bowl. On Thursday, MillerCoors took legal action, accusing Anheuser-Busch of false advertising and trademark dilution in a suit…", "url": "https://www.businessinsider.com/millercoors-sues-bud-light-maker-over-super-bowl-ad-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c587997936c0e4d35347b02-1536-768.jpg", "publishedAt": "2019-03-22T15:28:26Z", "content": "Bud Light's corn syrup-centric Super Bowl commercial sparked a major feud between two of the world's larger beer producers in February. \r\n Now MillerCoors, the company that the Bud Light ad called out for using corn syrup, is taking its grievances to court. \r… [+2734 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Malarie Gokey", "title": "The best wireless chargers you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-wireless-charger", "urlToImage": "https://amp.businessinsider.com/images/5ace1a0f146e712b008b4589-750-375.jpg", "publishedAt": "2019-03-22T15:20:00Z", "content": "Why you'll love it: TaoTronics LED Desk Lamp has a fast wireless charger and a USB port built in so it can charge your phone and another device besides. \r\n If you like products that serve multiple purposes, you'll love the TaoTronics LED Desk Lamp with its bu… [+2039 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "Jordan Peele's 'Us' is tracking to make more money than 'Get Out' and 'A Quiet Place' in its opening weekend box office", "description": "Jordan Peele's \"Us\" made $7.4 million in Thursday previews, edging out other recent horror hits like \"The Nun\" and \"A Quiet Place,\" and could make up to $65 million this weekend. That would be one of the biggest horror debuts since \"It\" in 2017. The movie was…", "url": "https://www.businessinsider.com/jordan-peeles-new-horror-movie-us-to-have-huge-box-office-opening-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c94f0a477584e13300934c5-750.jpg", "publishedAt": "2019-03-22T15:06:29Z", "content": "\"Get Out\" director Jordan Peele is back with a new horror movie this weekend, and it's expected to be another huge hit for the filmmaker. \r\n Peele's new movie, \"Us,\" raked in $7.4 million in Thursday night previews. That's more than other recent horror hits, … [+1756 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "Facebook briefly called one of its execs the 'VP of integrity' in a blog post about the New Zealand mass shooting, but quietly changed it after a journalist noticed", "description": "Facebook executive Guy Rosen penned an update Wednesday about the platform's response and review process in light of the recent mass shooting in New Zealand. A Guardian journalist pointed out that the post initially went up with Rosen's title as \"VP of integr…", "url": "https://www.businessinsider.com/facebook-removes-mention-of-new-vp-of-integrity-role-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94e3fbffcb2710543d0f64-1536-768.jpg", "publishedAt": "2019-03-22T15:05:54Z", "content": "Facebook recently referred to one of its executives as \"VP of integrity\" — then quickly changed his title back to what it was previously after a journalist pointed it out and asked about it. \r\n Facebook posted an update Wednesday about its response to the mas… [+2337 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "Billie vs. Flamingo razors — how 2 startups trying to change women's shaving stack up", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/flamingo-vs-billie-razor", "urlToImage": "https://static.businessinsider.com/image/5c94f45916c958129a52bf56-750.jpg", "publishedAt": "2019-03-22T15:00:00Z", "content": "I used the Billie razor with the Shave Cream ($8), a non-aerosol cream made with soothing and gentle ingredients like aloe, sage, shea butter, and grapefruit and free from synthetic fragrances, parabens, and sulfates. I'm a sucker for anything grapefruit-flav… [+1095 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eric Rosenberg", "title": "I used Credit Karma to file my taxes for free last year and loved it. Here's why I didn't use it again, but who I think should.", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, but our reporting and recommendations are always independent and objective. Credit Karm…", "url": "https://www.businessinsider.com/credit-karma-tax-review", "urlToImage": "https://amp.businessinsider.com/images/554278fa69beddd557f0a745-1136-568.jpg", "publishedAt": "2019-03-22T14:58:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, but our reporting and recommendations are always independent and objective. Most people… [+4361 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Democratic Socialists of America officially endorse Bernie Sanders for 2020 as the 'only socialist' in US history with a 'serious chance' to win", "description": "The Democratic Socialists of America have officially endorsed Bernie Sanders for president in 2020. \"Sanders is the only democratic socialist running for president in 2020, and the only socialist in American history with a serious chance of winning the presid…", "url": "https://www.businessinsider.com/democratic-socialists-america-endorse-bernie-sanders-2020-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c94f280569b55129d6ee165-750.jpg", "publishedAt": "2019-03-22T14:56:01Z", "content": "The Democratic Socialists of America (DSA) have officially endorsed Sen. Bernie Sanders for president in 2020, referring to the Vermont senator as the \"only socialist\" in US history with a \"serious chance\" of winning the presidency. \r\n \"Sanders is the only de… [+3622 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Lyft, Uber, and Slack are the IPOs getting all the attention this year — but a completely different corner of the market is heating up", "description": "The initial-public-offering market suffered through a slow start to the year due to the partial government shutdown and the brutal fourth-quarter for financial markets, but public debuts are ratcheting back up. While a host of high-profile unicorns and decaco…", "url": "https://www.businessinsider.com/initial-public-offering-market-healthcare-ipos-heating-up-2019-3", "urlToImage": "https://images.markets.businessinsider.com/image/5ad493e7146e711f008b4bbb-1000/shutterstock453339415.jpg", "publishedAt": "2019-03-22T14:55:00Z", "content": "lenetstan/Shutterstock\r\nThe initial-public-offering market suffered through a slow start to the year due to the partial government shutdown and the brutal fourth-quarter for financial markets, but public debuts are ratcheting back up.\r\nWhile a host of high-pr… [+3862 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jennifer Still", "title": "How to clear the cache on a Google Chrome browser to make it run more efficiently", "description": "You should clear the cache on your Google Chrome browser periodically to ensure that it's functioning efficiently, as an overloaded cache could be slowing down your browsing experience. Clearing your cache on a Google Chrome browser is quick and easy. Here's …", "url": "https://www.businessinsider.com/how-to-clear-cache-on-google-chrome", "urlToImage": "https://static.businessinsider.com/image/5c94f25e569b55128630bc14-750.jpg", "publishedAt": "2019-03-22T14:55:00Z", "content": "If you notice your Google Chrome browser becoming sluggish or not loading updates you know have been made to a particular website, it may be time to clear your cache. \r\n What does that mean? Whenever we navigate to a site, our browser stores pieces of it in o… [+2601 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Lyft, Uber, and Slack are the IPOs getting all the attention this year — but a completely different corner of the market is heating up", "description": "The initial-public-offering market suffered through a slow start to the year due to the partial government shutdown and the brutal fourth-quarter for financial markets, but public debuts are ratcheting back up. While a host of high-profile unicorns and decaco…", "url": "https://markets.businessinsider.com/news/stocks/initial-public-offering-market-healthcare-ipos-heating-up-2019-3-1028052410", "urlToImage": "https://images.markets.businessinsider.com/image/5ad493e7146e711f008b4bbb-1000/shutterstock453339415.jpg", "publishedAt": "2019-03-22T14:55:00Z", "content": "lenetstan/Shutterstock\r\nThe initial-public-offering market suffered through a slow start to the year due to the partial government shutdown and the brutal fourth-quarter for financial markets, but public debuts are ratcheting back up.\r\nWhile a host of high-pr… [+3862 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Walt Hickey", "title": "How the INSIDER 2020 Democratic primary tracker works", "description": "We're tracking the Democratic primary contenders and want to find out their overlaps in support. This helps us figure out exactly who most stands to gain when candidates falter, and who is most directly competing for support. It's early in the race and votes …", "url": "https://www.businessinsider.com/2020-election-methodology", "urlToImage": "https://static.businessinsider.com/image/5c94f1be16c958121b6f2047-750.jpg", "publishedAt": "2019-03-22T14:54:57Z", "content": "INSIDER is interested in Democratic voters' frequently overlapping perceptions of different candidates jockeying for the presidency. \r\n There are plenty of places that are actively polling the Democratic primary, and for people interested in the topline numbe… [+6180 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nathan McAlone", "title": "MoviePass walks back its claim to be 'profitable' and declines to say which investors 'did well' during its 99.99% stock drop", "description": "MoviePass has walked back claims by its parent company's CEO, Ted Farnsworth, that the movie-ticket subscription service is \"profitable.\" MoviePass said it would be more accurate to say that it made more in revenue from the \"typical subscriber\" — one who had …", "url": "https://www.businessinsider.com/moviepass-walks-back-claim-to-be-profitable-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c94f24686d56e14660eb945-750.jpg", "publishedAt": "2019-03-22T14:49:17Z", "content": "MoviePass has walked back its claim to be \"profitable.\" \r\n In an interview with Techcrunch published on Thursday, Ted Farnsworth, the CEO of MoviePass' parent company, Helios and Matheson Analytics, said the company's movie-ticket service was \"profitable righ… [+1686 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "Pilots who fly for Amazon are underpaid and overworked, and it may doom the e-commerce behemoth's aspirations to edge out FedEx and UPS (AMZN)", "description": "Business Insider spoke with 13 pilots who work or have worked for Air Transport Services Group and Atlas Air Worldwide, where they fly or have flown planes for Amazon Air. Those pilots and transportation analysts said the rapid growth of Amazon Air, coupled w…", "url": "https://www.businessinsider.com/amazon-pilot-disputes-could-threaten-plan-take-down-fedex-ups-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93d1dfdaa50706127c8e2a-2732-1366.jpg", "publishedAt": "2019-03-22T14:46:34Z", "content": "Jeff Bezos is a master at cutting costs. \r\n He's also looking to launch a third-party logistics service that many analysts say is poised to edge out FedEx and UPS. Earlier this year, Amazon declared itself a transportation company in its most recent SEC filin… [+10368 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Adam Bienkov", "title": "Theresa May prepares to give MPs vote to revoke Article 50 and cancel Brexit", "description": "Theresa May is preparing to hold a series of \"indicative votes\" on Brexit if her deal is rejected again next week. Among the options under consideration for votes in Parliament is the option to revoke Article 50 and cancel Brexit. More than 3 million people h…", "url": "https://www.businessinsider.com/parliament-indicative-vote-revoke-article-50-and-cancelling-brexit-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c94edd309b60315a925a522-750.jpg", "publishedAt": "2019-03-22T14:44:06Z", "content": "LONDON — Theresa May is preparing to offer members of parliament a vote on whether to revoke Article 50 and cancel Brexit. \r\n The government is reportedly discussing plans to stage seven \"indicative votes\" next week on what to do if it again rejects the prime… [+1811 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Zoë LaRock", "title": "A new study shows mHealth apps lack evidence and imperil patient privacy", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Health Briefing subscribers. To receive the full story plus other insights each morning, click here. A recent anaylsis of mobile health (mHealth) apps found their d…", "url": "https://www.businessinsider.com/mobile-health-mhealth-apps-patient-privacy-risks-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b24364c1ae66226008b5246-640-320.png", "publishedAt": "2019-03-22T14:44:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Health Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n A recent anaylsis of mobile health (mHealth) apps found their… [+3964 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marley Jay", "title": "A Wall Street economist has uncovered a new and improved way to see a stock-market crash coming — and he warns the alarm bells are already going off", "description": "Junk bonds — which make up the riskiest class of corporate debt — have often tipped off investors about future downturns in the stock market. But one expert says it's not likely to do that anymore, and he's found an alternative. Takahide Kiuchi, executive eco…", "url": "https://www.businessinsider.com/next-stock-market-correction-new-bond-market-signal-for-investors-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5acf5b98146e711b008b4677-960-480.jpg", "publishedAt": "2019-03-22T14:28:31Z", "content": "Investors have long relied on the risky high-yield bond market to alert them to coming stock meltdowns. But that alarm filed to go off before last year's selloff. \r\n Takahide Kiuchi, executive economist at Nomura Research Institute, says he's found an alterna… [+2841 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "Home startup Parachute sells more than sheets and towels — you can now buy Fair Trade-certified rugs starting at $89", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/parachute-rugs-collection", "urlToImage": "https://amp.businessinsider.com/images/5c9401506b526503cb51800a-750-375.jpg", "publishedAt": "2019-03-22T14:23:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+2344 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "Just 0.25% of brackets remain perfect after one day of March Madness action", "description": "The first day of March Madness action is in the books. Thursday didn't see any huge upsets, with No. 12 Murray State being the lowest-ranked team of the day to pull off a first-round win. Despite this, brackets across the country were busted, as just 42,828 p…", "url": "https://www.businessinsider.com/how-many-perfect-brackets-left-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c94e458dc67670f9c125743-1920-960.jpg", "publishedAt": "2019-03-22T14:14:24Z", "content": "March Madness is the most unpredictable event in all of sports. \r\n Though many contests through the years have advertised larger-than-life prizes, the quest for a \"perfect bracket\" that correctly predicts the winner of all 63 games of the tournament is an all… [+1940 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shana Lebowitz", "title": "The founders of a cookie startup used a rehearsal trick from Beyoncé to conquer their nerves before going on 'Shark Tank' — and won $300,000 from Alex Rodriguez", "description": "Before going on \" Shark Tank,\" the founders of the Nui cookie company used almost the same technique as Beyoncé: boosting their heart rate while rehearsing their pitch. They also handed out free cookies to ingratiate themselves with casting agents. Ultimately…", "url": "https://www.businessinsider.com/shark-tank-nui-beyonce-rehearsal-strategy-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93f98c09b603033a1947f6-1920-960.jpg", "publishedAt": "2019-03-22T14:12:50Z", "content": "Kristoffer Quiaoit and Victor Macias arrived early to the casting call for \"Shark Tank.\" \r\n Unfortunately, so did everyone else. \r\n About 1,000 people stood in line in front of them — and the entrepreneurs knew they had to find some way to stand out among the… [+3305 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "'But his WhatsApp': Hillary Clinton and Alexandria Ocasio-Cortez poked fun at revelations that Jared Kushner used WhatsApp messages for White House business", "description": "Hillary Clinton and Alexandria Ocasio-Cortez exchanged a playful back-and-forth over Twitter mocking Jared Kushner for being investigated over his use of WhatsApp, a private messaging service, for official government business. During the 2016 election, Clinto…", "url": "https://www.businessinsider.com/hillary-clinton-alexandria-ocasio-cortez-tweet-about-jared-kushner-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c94e9752cc74011ce774b66-750.jpg", "publishedAt": "2019-03-22T14:12:41Z", "content": "Former Secretary of State Hillary Clinton and Democratic Rep. Alexandria Ocasio-Cortez had a joking Twitter exchange on Thursday over Jared Kushner's use of WhatsApp for official White House duties, which may have violated federal records laws.\r\n Ocasio-Corte… [+2076 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "A $1.6 trillion credit market could batter the global economy. And it's you that will take the hit if it implodes, not Wall Street.", "description": "Leveraged loans make up an approximately $1.6 trill ion market, and a variety of financial experts have raised concerns about the booming industry. These loans are typically packaged into complex credit instruments which are then purchased by pension funds an…", "url": "https://www.businessinsider.com/what-are-leveraged-loans-what-are-clos-and-should-you-be-worried-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9244b34f07ae524f5f78b1-2732-1366.jpg", "publishedAt": "2019-03-22T14:11:57Z", "content": "Leveraged loans have caught a lot of heat in recent months. \r\n These loans are, in simple terms, to riskier companies which have amassed a large amount of debt relative to their earnings. And the market for these loans has boomed. \r\n Amid an extended period o… [+4998 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lulu Chang", "title": "The best meal delivery services we've tried", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-meal-delivery-service", "urlToImage": "https://amp.businessinsider.com/images/5c335eae630d9b5bc75e98f5-1136-568.jpg", "publishedAt": "2019-03-22T14:00:00Z", "content": "Why you'll love it: If you're not so sure about meal delivery services but are in love with meal kits, the offerings from Hungryroot may just be the first step you need to become a convert. \r\n There's something beguiling about meal kits. What with their pre-p… [+2301 chars]"}]}