{"status": "ok", "totalResults": 3613, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Associated Press", "title": "The National Enquirer paid $200K for private Jeff Bezos texts, according to new Wall Street Journal report - Business Insider", "description": "The National Enquirer paid $200K for private Jeff Bezos texts, according to new Wall Street Journal report Business Insider The Wall Street Journal reports that the National Enquirer's publisher paid $200,000 to obtain intimate texts between Amazon CEO Jeff B…", "url": "https://www.businessinsider.com/national-enquirer-paid-200k-private-bezos-texts-wsj-report-claims-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c904148e0575a13ca69313c-2732-1366.jpg", "publishedAt": "2019-03-19T02:38:30Z", "content": "SAN FRANCISCO (AP) — The Wall Street Journal reports that the National Enquirer's publisher paid $200,000 to obtain intimate texts between Amazon CEO Jeff Bezos and his mistress Lauren Sanchez. American Media Inc., the supermarket tabloid's publisher, reporte… [+627 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bryan Logan", "title": "SEC says Elon Musk's tweet about Tesla vehicle production was a 'blatant violation' of court order to have his tweets vetted before publishing", "description": "The Securities and Exchange Commission filed its rebuttal to Elon Musk's response to the agency's contempt-of-court claim against the Tesla CEO. The Monday filing says a tweet Musk sent in February claiming that Tesla would produce 500,000 vehicles in 2019 wa…", "url": "https://www.businessinsider.com/sec-responds-to-elon-musk-in-contempt-of-court-claim-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c902f83124d0415891ba4e3-2560-1280.jpg", "publishedAt": "2019-03-19T01:49:08Z", "content": "The Securities and Exchange Commission, in a court filing on Monday, said a tweet Elon Musk published in February was a \"blatant violation\" of a $40 million court settlement that requires Tesla to appoint a \"Twitter czar\" who would vet his tweets for informat… [+2130 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Troy Wolverton", "title": "AI experts are studying the way that kids' brains develop, and it could be a game-changer for the technology (GOOG, GOOGL)", "description": "Computer scientists developing artificial intelligence want their technology to be more like a child's brain. Children's brains are great at collecting information and learning from cues in the world around around them, something that AI systems struggle with…", "url": "https://www.businessinsider.com/research-kids-cognitive-development-influencing-artificial-intelligence-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c903aa4113a5016e020b4d5-1920-960.jpg", "publishedAt": "2019-03-19T01:18:06Z", "content": "STANFORD, California — At first take, it might not be clear why an expert in children's cognitive development was a featured speaker at a conference on artificial intelligence. \r\n It turns out that kids — and those who understand how they learn — may have a l… [+2928 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Associated Press", "title": "'Very concerning': Top Democrats write letter urging the FBI to investigate spa owner offering Trump access - Business Insider", "description": "'Very concerning': Top Democrats write letter urging the FBI to investigate spa owner offering Trump access Business Insider In a Friday letter to the FBI, Democrats on the House and Senate judiciary and intelligence panels wrote that reports about Li Yang \"r…", "url": "https://www.businessinsider.com/top-democrats-urge-fbi-probe-of-spa-owner-offering-trump-access-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c83c079262898640f1b20c2-750-375.jpg", "publishedAt": "2019-03-19T00:10:58Z", "content": "WASHINGTON (AP) — Top Democrats are urging the FBI to investigate a Trump campaign donor who is the founder and onetime owner of a spa that has been implicated in a human-trafficking ring. \r\n In a Friday letter to the FBI, Democrats on the House and Senate ju… [+3920 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Becky Peterson and Olivia Oran", "title": "Lyft's bankers are trying to compare the ride-hailing app to Grubhub and luxury retailer Farfetch— here's their pitch to investors (GRUB, FTCH)", "description": "Bankers will compare Lyft to \"marketplace\" companies like food delivery service Grubhub and luxury fashion retailer Farfetch in their pitch to investors as the company gears up to go public next week, sources said. They'll also pitch Lyft as comparable to hig…", "url": "https://www.businessinsider.com/lyfts-bankers-are-trying-to-compare-the-ride-hailing-app-to-grubhub-and-farfetch-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c0eab4c293b715338577c59-1136-568.jpg", "publishedAt": "2019-03-19T00:06:00Z", "content": "Lyft's bankers will compare the ride-hailing app to everything from a luxury fashion retailer to a food delivery service in their pitch to potential investors during the two week pre-IPO roadshow, which kicked off in New York City on Monday.\r\n Lyft, which is … [+2836 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marissa Perino", "title": "Singapore is holding on to its title as the most expensive city in the world — but this time, it's sharing the No. 1 spot with 2 other cities", "description": "The Economist Intelligence Unit recently released their annual report, which lists the most expensive cities in the world. This year, the No. 1 spot is occupied by a three-way tie between Singapore, Paris, and Hong Kong. Singapore has maintained the top posit…", "url": "https://www.businessinsider.com/most-expensive-cities-in-the-world-singapore-paris-hong-kong-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ffe0401df7218e51a441a-2560-1280.jpg", "publishedAt": "2019-03-19T00:02:00Z", "content": "This year's most expensive city title is split three ways, divided between Paris, Hong Kong, and five-year-winner Singapore. \r\n The Economist Intelligence Unit announced the updated standings in their annual Worldwide Cost of Living report. The report compare… [+1969 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "The president of $26.6 billion Atlassian explains the 'gnarly problem' that prompted its $166 million acquisition of AgileCraft (TEAM)", "description": "Atlassian will acquire the Texas-based startup AgileCraft for $166 million, the company announced Monday. AgileCraft helps companies with creating a \"master plan\" for building, managing, and delivering projects. Atlassian president Jay Simons explains why the…", "url": "https://www.businessinsider.com/atlassian-president-on-why-acquiring-agilecraft-166-million-2019-3", "urlToImage": "https://amp.businessinsider.com/images/52fa14c7ecad04be1025ad98-750-375.jpg", "publishedAt": "2019-03-18T23:40:54Z", "content": "Atlassian announced Monday that it will acquire Texas-based startup AgileCraft for $166 million. \r\n AgileCraft, which was founded in 2013, helps companies with building and managing their projects, essentially helping them create a \"master plan.\" According to… [+1820 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Price", "title": "The 'network effect' that made Facebook unstoppable has become a major threat, but the damage is happening in Facebook's executive ranks (FB)", "description": "Facebook has just lost two key execs, chief product officer Chris Cox and WhatsApp chief Chris Daniels. Their departures could spark further exits at the scandal-ridden company, an analyst is warning. Facebook has a famously mission-driven culture — meaning t…", "url": "https://www.businessinsider.com/facebook-execs-leaving-spark-further-departures-chrix-cox-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c900cfc124d0413162fb2fb-2560-1280.jpg", "publishedAt": "2019-03-18T22:14:38Z", "content": "Facebook was shaken last week by the departure of two key executives — and it could be a sign of darker times to come. \r\n On Thursday, CEO Mark Zuckerberg announced that Chris Cox, the company's chief product officer and one of his top lieutenants who had ser… [+3014 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "The Ethiopian Airlines and Lion Air crashes show eerie similarities — here are all the things they have in common (BA)", "description": "Boeing has come under fire after two deadly crashes involving its 737 Max 8 aircraft in five months. While investigators have not released their final reports about the crashes, there appear to be a number of similarities between them. The similarities includ…", "url": "https://www.businessinsider.com/ethiopian-airlines-lion-air-crashes-similarities-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c863ebd262898427e770785-1536-768.jpg", "publishedAt": "2019-03-18T22:09:15Z", "content": "Boeing has come under fire after two deadly crashes involving its 737 Max 8 aircraft in five months. \r\n The first, an October 2018 crash of a Lion Air flight, killed 189 people. The second, an Ethiopian Airlines crash on March 10, killed all 157 people on boa… [+404 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Megan Foster", "title": "16 useful products to help you wake up and get get your day started on the right foot", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/products-to-help-you-wake-up-in-the-morning", "urlToImage": "https://amp.businessinsider.com/images/5c7daf0d26289831036114e2-750-375.jpg", "publishedAt": "2019-03-18T22:09:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1067 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alex Lockie", "title": "Pompeo jokes Trump may fire him in a tweet as rumors swirl about his departure", "description": "Secretary of State Mike Pompeo joked Monday that President Donald Trump may fire him via tweet. That's exactly what happened to Trump's last secretary of state. Pompeo ruled out running for Senate from Kansas in 2020, but he kept his options open. Secretary o…", "url": "https://www.businessinsider.com/states-pompeo-jokes-trump-may-fire-him-via-tweet-as-rumors-swirl-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5bdbaf5b3815075d1a10c4db-2732-1366.jpg", "publishedAt": "2019-03-18T21:19:58Z", "content": "Secretary of State Mike Pompeo made a joke on Monday that may hit a bit close to home as rumors swirl about his political future outside President Donald Trump's administration. \r\n Pompeo, in his home state of Kansas for the Global Entrepreneurship Summit on … [+1855 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Reuters", "title": "A Peruvian ex-president was arrested at a Silicon Valley restaurant on charges of being drunk in public", "description": "Alejandro Toledo, a former President of Peru, was arrested in San Mateo, Calif. for being drunk in public. Toledo, 73, served as the South American country's president from 2001 to 2006. Toledo denied being arrested and said the information about his arrested…", "url": "https://www.businessinsider.com/peruvian-ex-president-arrested-for-being-drunk-in-public-in-california-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9009c6113a50134e6f0ea7-1136-568.jpg", "publishedAt": "2019-03-18T21:17:00Z", "content": "Peru's former president, Alejandro Toledo, considered a fugitive in Peru, was arrested for being drunk in public in California and released early on Monday, authorities in California said. \r\n Since 2017, Toledo, a resident of California, has refused to heed o… [+1175 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Reuters", "title": "Cyclone Idai has reportedly destroyed nearly 90% of the Mozambican port city of Beira", "description": "Reuters Cyclone Idai has destroyed nearly 90% of the Mozambican port city of Beira, according to the Red Cross. Communication lines have been cut and roads have been destroyed. The port of Beira is a gateway for imports to landlocked countries in Southern Afr…", "url": "https://www.businessinsider.com/cyclone-idai-devastates-mozambique-port-city-red-cross-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c900668e0575a0fb94352cb-2732-1366.jpg", "publishedAt": "2019-03-18T21:04:00Z", "content": "MAPUTO (Reuters) - Cyclone Idai has caused massive damage to the Mozambican port city of Beira, with nearly 90 percent of the area destroyed, the Red Cross said on Monday. \r\n Mozambican media said about 84 people have died, 68 of those in Beira. \r\n \"The scale… [+686 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gene Kim and Benji Jones", "title": "Sumo wrestlers eat up to 7,000 calories a day, yet don't typically suffer from symptoms of obesity", "description": "Sumo wrestlers eat up to 7,000 calories a day and weigh as much as 400 pounds. Yet they don't suffer from heart attacks, strokes, or other symptoms of obesity. Their secret is in their name — sumo wrestler. Regular intense exercise prevents the build-up of vi…", "url": "https://www.businessinsider.com/sumo-wrestlers-obesity-diet-calories-exercise-symptoms-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fff165b066e1178657e89-2732-1366.jpg", "publishedAt": "2019-03-18T21:00:00Z", "content": "Following is a transcript of the video.\r\n Sumo wrestlers eat up to 7,000 calories a day and weigh 300 to 400 pounds or two to three times as much as the average adult. \r\n While that may not sound like the healthiest lifestyle, you shouldn't judge a book, or a… [+2424 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "I tried Apple's recently updated Mini Mac — and it's the way to go if you're looking for macOS desktop on a budget", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/apple-mac-mini-review", "urlToImage": "https://amp.businessinsider.com/images/5c4b1d842bdd7f10590d1322-1136-568.jpg", "publishedAt": "2019-03-18T21:00:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+5246 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bob Bryan and Reuters", "title": "Alan Krueger, economic adviser to Obama and Clinton, dies at 58", "description": "Alan Krueger, a Princeton economics professor and presidential adviser, died over the weekend. Krueger, who held adviser roles in the Clinton and Obama administrations, was 58. Alan Krueger, a Princeton University economics professor who advised US Presidents…", "url": "https://www.businessinsider.com/alan-krueger-economic-adviser-to-obama-and-clinton-dies-at-58-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fe7ec5dfa9912636a5d45-2732-1366.jpg", "publishedAt": "2019-03-18T20:50:00Z", "content": "Alan Krueger, a Princeton University economics professor who advised US Presidents Bill Clinton and Barack Obama, died over the weekend at the age of 58, the university said on Monday. \r\n \"Alan was recognized as a true leader in his field, known and admired f… [+1276 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Insider Inc.", "title": "APPLY NOW: Insider Inc. is hiring an entertainment reporter, visual features reporters, a billionaires reporter, and more", "description": "Insider Inc. has a number of editorial openings across both Business Insider and INSIDER. If you're interested in joining a fast-paced, growing newsroom, apply at the links provided below. Unless otherwise stated, positions are located in our New York City he…", "url": "https://www.businessinsider.com/insider-inc-business-insider-hiring-jobs-editors-reporters-video-careers-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b91478d80eb35572d8b4d6a-1334-667.jpg", "publishedAt": "2019-03-18T20:40:49Z", "content": "Insider Inc. has a number of editorial openings across both Business Insider and INSIDER. If you're interested in joining a fast-paced, growing newsroom, apply at the links provided below. Unless otherwise stated, positions are located in our New York City he… [+148 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hillary Hoffower", "title": "11 creative ways people have made $1 million", "description": "Building wealth often takes smart saving strategies, but there are creative ways to achieve millionaire status more quickly, too. Some people get there by going viral, while others get there by selling uncommon things in new ways. We took a look at 11 differe…", "url": "https://www.businessinsider.com/creative-ways-to-make-a-million-dollars-2016-1", "urlToImage": "https://amp.businessinsider.com/images/56a93c5ec08a809e2f8ba7c5-960-480.jpg", "publishedAt": "2019-03-18T20:40:00Z", "content": "Kindergarten teacher Deanna Jump reached millionaire status by selling lesson plans online.\r\n Todd Stone/AP \r\n Getting rich is a long-term game ... for the most part. \r\n While your best bet to accumulate wealth is to curb your spending, start investing, and d… [+883 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Becky Peterson", "title": "$1 billion Sequoia-backed Health Catalyst has picked lead banks for its IPO", "description": "Health Catalyst, a $1 billion healthcare data startup, is interviewing banks for an initial public offering, according to multiple sources. The company has hired Goldman Sachs and JPMorgan to lead the IPO process, according to one of the sources. Health Catal…", "url": "https://www.businessinsider.com/1-billion-sequoia-backed-health-catalyst-has-picked-lead-banks-for-its-ipo-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fd5b9003f5c09a11fd196-640-320.jpg", "publishedAt": "2019-03-18T20:29:38Z", "content": "Health Catalyst, a Sequoia Capital-backed startup that stores and analyzes data for healthcare companies, is interviewing banks for an initial public offering expected later this year, according to multiple people familiar with the process. \r\n The startup has… [+650 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Canales", "title": "We compared the most popular menu items at KFC and Popeyes — and the winner is crystal clear", "description": "When a craving for fast-food fried chicken hits, KFC and Popeyes offer two viable options for satisfying your deep-fried desires. To see how the two fried chicken chains compare, we visited both chains in the San Francisco Bay Area and collected some of the m…", "url": "https://www.businessinsider.com/kfc-vs-popeyes-best-chicken-chain-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8aac5c6123ca41670bfa6a-1920-960.jpg", "publishedAt": "2019-03-18T20:29:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dan DeFrancesco", "title": "The $43 billion combination of FIS and Worldpay could trigger a wave of M&A. Here are the deals that could be next. (FIS, WP)", "description": "Fidelity National Information Services (FIS) is acquiring Worldpay for a deal valued at $43 billion the two companies announced Monday. The deal is similar to Fiserv's acquisition of First Data in January 2019, as it involves a financial-technology company (F…", "url": "https://www.businessinsider.com/fis-acquisition-of-worldpay-means-more-payments-deals-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fc1a75b066e07d6009d66-1136-568.jpg", "publishedAt": "2019-03-18T20:15:33Z", "content": "Like middle-schoolers at their first dance, financial-technology companies and payment processors are quickly pairing off with each other in hopes of not being the only ones left alone in a space that's rapidly evolving. \r\n Fidelity National Information Servi… [+3999 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "A cross-country American Airlines flight was diverted because its bathrooms were unusable (AAL)", "description": "An American Airlines flight from San Francisco to New York City was diverted to Chicago because its bathrooms were unusable, the flight-tracking website Flightradar24 first reported. American Airlines told Business Insider that the issue with the flight's bat…", "url": "https://www.businessinsider.com/american-airlines-flight-diverted-due-to-unusable-bathrooms-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ff8305dfa9915261e23b6-2732-1366.jpg", "publishedAt": "2019-03-18T20:09:15Z", "content": "An American Airlines flight from San Francisco to New York City was diverted to Chicago because its bathrooms were unusable, the flight-tracking website Flightradar24 first reported. \r\n American Airlines told Business Insider that the issue with the flight's … [+800 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "A new kind of nightmare 'snowplow' parent is calling their kids' employers to talk about issues their children are having at work", "description": "\"Snowplow parents\" are emerging as an even more hyper-intensive version of helicopter parenting, The New York Times reported. These parents clear \"any obstacles in their child's path to success, so they don't have to encounter failure, frustration or lost opp…", "url": "https://www.businessinsider.com/snowplow-parents-calling-employers-college-helicopter-parenting-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8feb1f113a500e7e6f0709-2732-1366.jpg", "publishedAt": "2019-03-18T20:06:00Z", "content": "Move over, helicopter parents. \r\n \"Snowplow parents\" are the newest embodiment of a hyper-intensive parenting style that can include parents booking their adult children haircuts, texting their college kids to wake them up so they don't sleep through a test, … [+3842 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "Apple's new iPad Air and iPad Mini are available to buy right now — and they both cost $500 or less", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/apple-ipad-air-ipad-mini-price-specs", "urlToImage": "https://amp.businessinsider.com/images/5c8fef835b066e0f006ac18a-2732-1366.jpg", "publishedAt": "2019-03-18T20:00:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+2267 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "How you can archive your Amazon order history to keep it private", "description": "Amazon does not allow you to permanently delete your order history, but you can archive it and obscure it enough to render it effectively cleared. Deleting browsing history is another good way to protect your privacy on Amazon, whether hiding gifts from a spo…", "url": "https://www.businessinsider.com/how-to-delete-archive-amazon-order-history", "urlToImage": "https://amp.businessinsider.com/images/5c8ff1015dfa99138b75e052-1920-960.jpg", "publishedAt": "2019-03-18T19:57:00Z", "content": "Here's the bad news: you can't actually delete your Amazon order history. In fact, even if you deactivate your account, the company will still have a record of everything you bought from them. So try not to get online at two a.m. after three too many vodka to… [+2259 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Cork Gaines", "title": "The highest-paid coaches in the NCAA Tournament", "description": "The March Madness NCAA Tournament bracket is now set. We ranked the 30 highest-paid coaches in this year's tournament. Check out the rest of our March Madness coverage here. The NCAA Tournament bracket is now set as 68 teams will compete to be NCAA champions …", "url": "https://www.businessinsider.com/highest-paid-coaches-ncaa-tournament-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5373c0ca69beddbd262d8007-1920-960.jpg", "publishedAt": "2019-03-18T19:52:29Z", "content": "Seasons at school: 43 \r\nNCAA Tournament appearances: 34 \r\nBest finish: NCAA Champions \r\nOne thing to know: Boeheim does not want players to be paid, saying, \"And everybody says, 'The coach makes this and the players (don't make anything).' The player is 17 ye… [+353 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone", "title": "This giant 'S' spotted in San Francisco is almost certainly the logo for Google's highly-anticipated game streaming service (GOOG, GOOGL)", "description": "A giant S logo, for what is likely Google's highly anticipated gaming announcement, was spotted by 9to5Google on Monday. The \"S\" likely stands for \"Stream,\" as in \"Project Stream,\" Google's Netflix-like video game streaming service it announced last October. …", "url": "https://www.businessinsider.com/google-project-stream-gaming-logo-revealed-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fee2b113a500f032e9b58-2732-1366.jpg", "publishedAt": "2019-03-18T19:36:40Z", "content": "The name for Google's highly anticipated gaming announcement at the Game Developer's Conference (GDC) Tuesday apparently starts with an \"S.\" \r\n A photo of the never-before-seen Google gaming logo was first tweeted by 9to5Google inside San Francisco's Moscone … [+1565 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone, provided by<br><a href=\"http://www.businessinsider.com\" target=\"_blank\" style=\"text-decoration:none\"><img src=\"//imgs.sfgate.com/graphics/partners/businessinsider/article_header.gif\" border=\"0\"></a>", "title": "This giant 'S' spotted in San Francisco is almost certainly the logo for Google's highly anticipated game streaming service - Middletown Press", "description": "Business Insider  \n \n  A giant S logo, for what is likely Google's highly anticipated gaming announcement, was  spotted by 9to5Google  on Monday.  \n  The \"S\" likely stands for \"Stream,\" as in \"Project Stream,\" Google's Netflix-like video game streaming servic…", "url": "https://www.businessinsider.com/google-project-stream-video-games-yeti-2018-10?utm_source=hearst&amp;utm_medium=referral&amp;utm_content=allverticals", "urlToImage": "https://s.hdnux.com/photos/01/01/04/07/17056234/7/rawImage.jpg", "publishedAt": "2019-03-18T19:36:00Z", "content": "FILE-- The name for Google's highly anticipated gaming announcement at the Game Developers Conference (GDC) Tuesday apparently starts with an \"S.\"\r\nFILE-- The name for Google's highly anticipated gaming announcement at the Game Developers Conference (GDC) Tue… [+2241 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Remi Rosmarin", "title": "I've been dry brushing my body every day before I shower and my skin has never been softer — here's how it works", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/esker-dry-brush-review", "urlToImage": "https://amp.businessinsider.com/images/5c8c0e635dfa9960b64a409c-1136-568.jpg", "publishedAt": "2019-03-18T19:35:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+4761 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Here comes Tilray... (TLRY)", "description": "Tilray is set to report fourth-quarter earnings after Monday's closing bell. Analysts are expecting an adjusted loss of $1.34 a share on $15 million revenue. Watch Tilray trade live. The cannabis producer Tilray is set to report fourth-quarter earnings after …", "url": "https://www.businessinsider.com/weed-tilray-earnings-q4-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c3df059d4beaf346f051194-2732-1366.jpg", "publishedAt": "2019-03-18T19:34:00Z", "content": "The cannabis producer Tilray is set to report fourth-quarter earnings after Monday's closing bell. Here is what analysts surveyed by Bloomberg are expecting. \r\nAdjusted loss per share: $1.34 \r\nRevenue: $15.07 million \r\n2019 adjusted-loss-per-share guidance: $… [+753 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Here comes Tilray... (TLRY)", "description": "Tilray is set to report fourth-quarter earnings after Monday's closing bell. Analysts are expecting an adjusted loss of $1.34 a share on $15 million revenue. Watch Tilray trade live. The cannabis producer Tilray is set to report fourth-quarter earnings after …", "url": "https://markets.businessinsider.com/news/stocks/weed-tilray-earnings-q4-2019-3-1028039194", "urlToImage": "https://images.markets.businessinsider.com/image/5bb2611a9a4ab804c93f3a06-2400/tilraynanaimoplants.jpg", "publishedAt": "2019-03-18T19:34:00Z", "content": "Tilray\r\nTilray is set to report fourth-quarter earnings after Monday's closing bell.\r\nAnalysts are expecting an adjusted loss of $1.34 a share on $15 million revenue.\r\nWatch Tilray trade live.\r\nThe cannabis producer Tilray is set to report fourth-quarter earn… [+935 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "Americans overwhelmingly want Congress to defy Trump and override his veto of the border wall emergency declaration", "description": "Americans support an override of President Trump's veto of the resolution that aimed to terminate his national emergency declaration to build a wall on the US-Mexico border by a two to one margin, according to a new poll. Opposition and support for a veto ove…", "url": "https://www.businessinsider.com/americans-want-trump-border-wall-emergency-declaration-veto-override-poll-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fce1701df72104d50e95b-1920-960.jpg", "publishedAt": "2019-03-18T19:22:18Z", "content": "Americans support an override of President Donald Trump's veto of the resolution to terminate the national emergency declaration allowing the White House to divert funds from military projects to build walls and physical barriers along the United States-Mexic… [+3152 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joana Galvão, Contributor", "title": "I was such a bad micromanager that all my employees quit — and it taught me the one trait all powerful leaders need", "description": "Joana Galvão is the co-founder of Gif Design Studios, an award-winning design agency. When she first started her company, she micromanaged her employees by literally watching them over their shoulders and interrupting them to tweak their work. She does nearly…", "url": "https://www.businessinsider.com/micromanager-boss-this-is-what-i-learned-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fedb75dfa99133741b445-1334-667.jpg", "publishedAt": "2019-03-18T19:21:24Z", "content": "\"You don't learn to walk by following rules, you learn by doing and by falling over,\" Virgin founder Sir Richard Branson has written. That's true, but falling over also hurts. Even better than learning from your own painful mistakes is learning from someone e… [+5626 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "Prince Harry is reportedly asking the queen for paternity leave — here are 6 things millennial dads do that their parents didn't", "description": "Prince Harry is reportedly looking to take two weeks of paternity leave when his wife, Meghan Markle, gives birth. That's one of several ways millennial dads are parenting their kids differently than previous generations did. According to a 2016 Cornell Unive…", "url": "https://www.businessinsider.com/millennial-dads-generational-differences-paternity-leave-money-work-identity-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5aecb9a37708e93357483da5-1334-667.jpg", "publishedAt": "2019-03-18T19:20:00Z", "content": "Dads these days.\r\n Chris Jackson/Getty Images \r\n Prince Harry will take two weeks of paternity leave when his wife, Meghan Markle, gives birth, according to news reports on Monday. \r\n But apart from members of the Royal Family, it's hardly newsworthy these da… [+633 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "53% American adults say they don't want to fly on a Boeing 737 Max (BA)", "description": "The Boeing 737 Max represents the latest generation of narrow-body passenger jets. It's also the latest version of the Boeing 737, the best-selling airliner in aviation history. The 371 Boeing 737 Max planes already delivered to airlines have been grounded by…", "url": "https://www.businessinsider.com/americans-dont-want-to-fly-boeing-737-max-survey-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fdbd069e11c1df755918a-2732-1366.jpg", "publishedAt": "2019-03-18T19:20:00Z", "content": "The Boeing 737 Max represents the latest generation of narrow-body passenger jets. It's also the latest version of the Boeing 737, the best-selling airliner in aviation history. \r\n However, following the crash of Ethiopian Airlines Flight ET302 last week, the… [+2246 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Brodwin", "title": "The 5 deadliest habits to avoid as you get older", "description": "A handful of activities can be truly detrimental to your health. In some cases, new studies have even found a link between those habits and an early death. Here are the most damaging habits you should try to avoid, especially as you get older. Bad habits are …", "url": "https://www.businessinsider.com/deadliest-habits-avoid-as-you-age-get-older-to-live-longer-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a31b0abb0bcd51e008b4cbc-1136-568.jpg", "publishedAt": "2019-03-18T19:13:00Z", "content": "Bad habits are tough to break. \r\n Even when they're truly detrimental to your health, certain activities can be difficult to give up. Whether it's smoking, regularly indulging in sugary beverages, or binge drinking, there are a handful of practices that exper… [+5913 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Here are the world's 9 largest M&A deals this year", "description": "Worldpay on Monday agreed to be bought by Fidelity National Information Services in a $43 billion that included debt. The deal is the second-largest transaction announced so far in 2019, boosting the total value of global deals to a year-to-date total of $345…", "url": "https://www.businessinsider.com/ma-largest-deals-world-2019-2019-3", "urlToImage": null, "publishedAt": "2019-03-18T19:07:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shana Lebowitz", "title": "Companies like Netflix say harsh feedback improves their employees' work, but experts suggest bosses aren't always the best judge of performance", "description": "Leadership experts say the feedback process at most workplaces is highly flawed. That's because performance assessment is very subjective, and it doesn't always resonate with employees. Many bosses are realizing this, and relying more on objective data. Givin…", "url": "https://www.businessinsider.com/feedback-process-workplace-changing-less-subjective-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a1c6e0bf914c354018b643c-1136-568.jpg", "publishedAt": "2019-03-18T18:47:00Z", "content": "Giving employees feedback is, supposedly, about telling them what they did wrong and hoping they'll fix it. \r\n But the feedback process itself may have some glaring flaws. \r\n In a recent Harvard Business Review article, leadership experts Marcus Buckingham an… [+2935 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Caroline Lupini", "title": "Delta and American Express are offering one of the highest welcome offers we've seen for this popular airline credit card", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/platinum-delta-amex-bonus-skymiles-offer-march-april-2019", "urlToImage": "https://amp.businessinsider.com/images/5c8fe255401d580917726d20-960-480.jpg", "publishedAt": "2019-03-18T18:45:27Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+6511 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Caroline Lupini, provided by<br><a href=\"http://www.businessinsider.com\" target=\"_blank\" style=\"text-decoration:none\"><img src=\"//imgs.sfgate.com/graphics/partners/businessinsider/article_header.gif\" border=\"0\"></a>", "title": "Delta and American Express are offering one of the highest welcome offers we've seen for this popular airline credit card - The Advocate", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/platinum-delta-amex-bonus-skymiles-offer-march-april-2019?utm_source=hearst&amp;utm_medium=referral&amp;utm_content=allverticals", "urlToImage": "https://www.stamfordadvocate.com/img/pages/article/opengraph_default.jpg", "publishedAt": "2019-03-18T18:45:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+6536 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "Intel and the Department of Energy are building America's first exascale supercomputer, a computer that's capable of a quintillion calculations per second (INTC)", "description": "Intel and the U.S. Department of Energy announced Monday that they will start to build Aurora, the U.S.'s first exascale supercomputer. An exascale supercomputer is capable of processing one quintillion (1,000,000,000,000,000,000) calculations per second, and…", "url": "https://www.businessinsider.com/intel-department-of-energy-aurora-first-exascale-supercomputer-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c3fd56123ca6833443ed7-2560-1280.jpg", "publishedAt": "2019-03-18T18:30:00Z", "content": "Intel will start to build what's set to be the U.S.'s most powerful supercomputer, and it will be so fast, it can process one quintillion calculations per second — or one billion times one billion calculations per second. \r\n To put that in perspective, if eve… [+3722 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Bernie Sanders says it's 'nonsense' to 'paint' democratic socialism as 'Venezuela' and 'authoritarianism'", "description": "Sen. Bernie Sanders told NPR it's \"nonsense\" when people on the political right attempt to characterize democratic socialism as \"authoritarianism and communism and Venezuela.\" Socialism remains a divisive term in US politics, and the presidential hopeful sign…", "url": "https://www.businessinsider.com/bernie-sanders-explains-what-socialism-means-to-him-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fcfbce0575a074b1fadc7-2732-1366.jpg", "publishedAt": "2019-03-18T18:20:58Z", "content": "Sen. Bernie Sanders said it's \"nonsense\" when his \"right-wing colleagues\" seek to \"paint\" democratic socialism as \"authoritarianism and communism and Venezuela.\" \r\n But the Vermont senator and presidential hopeful also suggested he needs to do a \"better job\" … [+5035 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Tesla is asking employees to volunteer and help deliver 30,000 cars before the end of the quarter (TSLA)", "description": "Mad dashes to deliver cars by the end of a quarter aren't new at Tesla, and an internal email seen by Business Insider shows this period is no exception. VP Sanjay Shah asked employees to help deliver 30,000 cars over the last 15 days of the quarter. CEO Elon…", "url": "https://www.businessinsider.com/tesla-asks-employees-help-delivering-30000-cars-end-quarter-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fd9366123ca12997250a6-2732-1366.jpg", "publishedAt": "2019-03-18T18:20:56Z", "content": "Hours after unveiling its newest car, the Model Y, Tesla was once again asking employees to help deliver cars ahead of the end of the first quarter. \r\n According to an internal email sent on Friday, March 15 from senior vice president Sanjay Shah to departmen… [+2166 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Janine Clements", "title": "The best straightening brushes you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-straightening-brush", "urlToImage": "https://amp.businessinsider.com/images/5c8bcb0a69bdec51df2a364f-750-375.jpg", "publishedAt": "2019-03-18T18:20:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+2148 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Antonio Villas-Boas", "title": "This smartphone maker put a selfie camera where no other phone maker has put one before", "description": "Chinese smartphone maker ZTE's upcoming smartphone has a selfie camera that sticks out from the main body of the phone. It's a novel design solution to avoid using the divisive notch that was popularized by Apple's iPhone X and adopted by numerous other Andro…", "url": "https://www.businessinsider.com/zte-axon-v-has-protruding-selfie-camera-to-avoid-iphone-style-notch-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fd11569e11c1bba285c8a-1920-960.jpg", "publishedAt": "2019-03-18T18:12:39Z", "content": "Chinese smartphone maker ZTE is putting the selfie camera on its upcoming Axon V smartphone where no smartphone maker has put one before: outside the main body of the phone. \r\n The ZTE Axon V hasn't been announced yet, but its unique design was posted on the … [+1289 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "I climbed Vessel, the $200 million, 2,500-step sculpture in Hudson Yards — and the view from the inside blew me away", "description": "The Vessel is a brand-new, 150-foot tall climbable sculpture in New York City's new $25 billion Hudson Yards neighborhood. The sculpture cost $200 million to build and features 154 interconnected staircases, nearly 2,500 individual steps, and 80 landings. I w…", "url": "https://www.businessinsider.com/new-york-city-vessel-sculpture-hudson-yards-views-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fc95bdaa50706825ddab6-2732-1366.jpg", "publishedAt": "2019-03-18T18:09:00Z", "content": "The Vessel, a $200 million climbable sculpture in New York City's Hudson Yards, is now officially open to the public. \r\n Designed by Thomas Heatherwick, it's the sculptural centerpiece of Hudson Yards, Manhattan's new $25 billion neighborhood that includes of… [+809 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Marijuana is the fastest-growing industry in the US job market, according to a new report", "description": "The US added 64,389 full-time legal cannabis jobs in 2018. That outpaces growth in other sectors in the job market. Job openings in the cannabis industry have also surged. Forget the energy industry. Marijuana appears to be the fastest growing job sector in t…", "url": "https://www.businessinsider.com/weed-marijuana-fastest-growing-industry-us-job-market-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a948eaeaae6050c098b45fd-750-375.jpg", "publishedAt": "2019-03-18T18:08:00Z", "content": "Forget the energy industry. Marijuana appears to be the fastest growing job sector in the US. \r\n The US added 64,389 full-time legal cannabis jobs in 2018, according to a new report from Leafly and Whitney Economics. That brought the total number of positions… [+2084 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Marijuana is the fastest-growing industry in the US job market, according to a new report", "description": "The US added 64,389 full-time legal cannabis jobs in 2018. That outpaces growth in other sectors in the job market. Job openings in the cannabis industry have also surged. Forget the energy industry. Marijuana appears to be the fastest growing job sector in t…", "url": "https://markets.businessinsider.com/news/stocks/weed-marijuana-fastest-growing-industry-us-job-market-report-2019-3-1028039054", "urlToImage": "https://images.markets.businessinsider.com/image/5a8677155124c9797e450d39-800/pot-pharm-booming-canada-weed-sector-plots-next-wave-medicines.jpg", "publishedAt": "2019-03-18T18:08:00Z", "content": "Thomson Reuters\r\nThe US added 64,389 full-time legal cannabis jobs in 2018. \r\nThat outpaces growth in other sectors in the job market.\r\nJob openings in the cannabis industry have also surged. \r\nForget the energy industry. Marijuana appears to be the fastest g… [+2268 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Gillett and Shana Lebowitz", "title": "Prince Harry will reportedly take 2 weeks of paternity leave — and stacks of research suggest paid leave is a no-brainer", "description": "Prince Harry is reportedly taking two weeks of paternity leave. A growing body of evidence suggests paid leave benefits parents, kids, and businesses. The US is the only country in the developed world that doesn't mandate paid maternity leave. Prince Harry wi…", "url": "https://www.businessinsider.com/scientific-proof-paid-parental-leave-is-good-for-everyone", "urlToImage": "https://amp.businessinsider.com/images/5c8fd3cb69e11c1c5317eae2-1136-568.jpg", "publishedAt": "2019-03-18T18:05:00Z", "content": "Prince Harry will reportedly take two weeks of paternity leave when his wife, Meghan Markle, gives birth. \r\n A friend of the Prince is reported to have said, \"He doesn't need to take paternity leave because he doesn't work in the way most people do, but he th… [+6541 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "Warner Bros. CEO Kevin Tsujihara is stepping down following a report alleging he had a sexual relationship with an actress and promised to help her get roles", "description": "Kevin Tsujihara is stepping down as Warner Bros. chairman and CEO. This follows a story in The Hollywood Reporter earlier this month that alleged Tsujihara had a sexual relationship with an actress and promised to help get her acting roles. Kevin Tsujihara is…", "url": "https://www.businessinsider.com/warner-bros-ceo-kevin-tsujihara-steps-down-after-scandal-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fd39069e11c1c3136a5a8-1536-768.jpg", "publishedAt": "2019-03-18T18:04:09Z", "content": "Kevin Tsujihara is stepping down as chairman and CEO of Warner Bros., according to a WarnerMedia statement sent out Monday. \r\n This exit comes a few weeks after The Hollywood Reporter ran a story alleging the studio head had a sexual relationship with actress… [+1505 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "These are the brands that Gen Z shops at most, according to a survey of more than 1,800 young Americans", "description": "Generation Z is becoming a big focus in the retail space. Business Insider recently surveyed more than 1,800 Americans between the age of 13 and 21 to find out which clothing brands they shop at most. Athletic brands and fast-fashion stores featured prominent…", "url": "https://www.businessinsider.com/nike-american-eagle-vans-among-teens-favorite-clothing-brands-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fa3e6f73f5c7ccb51c1da-1920-960.jpg", "publishedAt": "2019-03-18T18:00:14Z", "content": "Editor's note: Business Insider surveyed 1,884 young Americans about their buying attitudes and beliefs. This is the first in a series of stories that will be rolled out over the next several weeks.\r\n Generation Z is becoming a big focus in retail. \r\n Retaile… [+723 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Megan Foster", "title": "12 clever products to help you make the most of your under-sink storage space", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/under-sink-organization-hacks-and-products", "urlToImage": "https://amp.businessinsider.com/images/5c8fd57d4f07ae162a607a0a-1334-667.jpg", "publishedAt": "2019-03-18T17:58:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1238 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gili Malinsky", "title": "From creating Japanese playing cards in 1889 to becoming one of the most iconic video game companies in history, see how Nintendo has evolved", "description": "World-famous video game company Nintendo was founded in 1889 selling Japanese playing cards, and has found both success and failure throughout its 130-year history. In the '60s, then- Nintendo president Hiroshi Yamauchi tried expanding the games manufacturer …", "url": "https://www.businessinsider.com/nintendo-game-boy-super-mario-history-evolution-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fdb8e69bdec092914fe7a-1536-768.jpg", "publishedAt": "2019-03-18T17:58:00Z", "content": "In the '80s, Yokoi (who'd helped Nintendo enter into the electronic game market in the '70s) saw a man playing with his calculator on his commute, and was inspired to create a handheld video game for Nintendo. \r\n The original handheld game was the the Game &a… [+296 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Goggin", "title": "Former DNC chair Donna Brazile joins Fox News as a contributor: 'I know I'm going to get criticized from my friends'", "description": "Former DNC chair Donna Brazile will join Fox News as a contributor beginning March 18. Brazile left CNN in October 2016 after leaked emails revealed that she had passed on town hall questions to Hillary Clinton's presidential campaign. Following the election,…", "url": "https://www.businessinsider.com/donna-brazile-joins-fox-news-former-dnc-chair-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fcb595b066e096b7c4948-640-320.jpg", "publishedAt": "2019-03-18T17:53:24Z", "content": "Former Democratic National Committee (DNC) chair and political strategist Donna Brazile will join Fox News as a contributor in March. \r\n The announcement of the pairing may come as a surprise to many considering Brazile's previous official Democratic allegian… [+3437 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "Federal investigators reportedly suspect that pilot error played a role in the fatal Amazon Air cargo crash (AMZN)", "description": "The Wall Street Journal reported that the National Transportation Security Board (NTSB) is suspecting pilot error in the Atlas Air Flight 3591, which crashed on Feb. 23 in Texas, killing all three on board. The plane was carrying USPS and Amazon cargo. Severa…", "url": "https://www.businessinsider.com/pilot-error-amazon-air-atlas-air-crash-ntsb2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fd8c2f73f5c06c4253a35-1920-960.jpg", "publishedAt": "2019-03-18T17:49:34Z", "content": "Inspectors with the National Transportation Security Board (NTSB) suspect that pilot error — not aircraft malfunctions — led to the deadly Atlas Air crash on Feb. 23, The Wall Street Journal reported on Friday. All three people on board died in the crash. \r\n … [+2690 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nicole Phillips", "title": "Insider Inc. is hiring a Senior Account Manager to lead our Enterprise Renewal team", "description": "As a Senior Account Manager, you will be responsible for renewing and growing our B2B client relationships for Insider Inc.’s two core subscription products; Business Insider Intelligence and Business Insider Prime. Business Insider Intelligence is Business I…", "url": "https://www.businessinsider.com/insider-inc-hiring-senior-account-manager-team-lead-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fda3b6123ca12c515c0a3-960-480.jpg", "publishedAt": "2019-03-18T17:49:00Z", "content": "As a Senior Account Manager, you will be responsible for renewing and growing our B2B client relationships for Insider Inc.'s two core subscription products; Business Insider Intelligence and Business Insider Prime. Business Insider Intelligence is Business I… [+2455 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "Meghan McCain slammed Trump for repeated attacks on her late father: 'He will never be a great man'", "description": "Meghan McCain hit back again at President Donald Trump's Twitter insults against her late father Sen. John McCain of Arizona. McCain dismissed the multiple tweets that targeted her father by name, saying Monday on \"The View\" that Trump was \"obsessing over gre…", "url": "https://www.businessinsider.com/meghan-mccain-trump-the-view-twitter-for-repeated-attacks-on-her-late-father-john-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fc5da401d5804c6487dc9-2732-1366.jpg", "publishedAt": "2019-03-18T17:40:59Z", "content": "Meghan McCain replied to President Donald Trump's tweets insulting her late father offline, slamming the president on ABC's \"The View\" Monday. \r\n Co-host Whoopi Goldberg opened the show by bringing up the president's weekend tweetstorm, in which he spent the … [+3255 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis, Walt Hickey and Yutong Yuan", "title": "Most Americans think Michael Jordan is the 'GOAT' over LeBron James, and it's not even close", "description": "LeBron James vs. Michael Jordan is often a hotly contested debate among sports television and radio personalities. People often weigh the dominance of Jordan against the all-around play and longevity of LeBron. A new INSIDER poll suggests that it is not much …", "url": "https://www.businessinsider.com/jordan-lebron-goat-debate-americans-jordan-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fd041113a5009933b60bc-1920-960.jpg", "publishedAt": "2019-03-18T17:38:00Z", "content": "LeBron James recently moved into fourth on the NBA's all-time scoring list, passing Michael Jordan. \r\nRead more: Ex-teammates roasted LeBron James after he passed Michael Jordan on the NBA all-time scoring list\r\n The achievement re-ignited one of the fiercest… [+4215 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "Apple just announced a new 10.5-inch iPad Air — here's how it compares to the 11-inch iPad Pro", "description": "Apple launched a faster new iPad Air on Monday that supports Apple Pencil and Apple's Smart Keyboard. While it bears some similarities to the 11-inch iPad Pro, there are some differences when it comes to performance, identity verification, and other features.…", "url": "https://www.businessinsider.com/apple-new-ipad-air-ipad-pro-compared-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fc8d8113a50084d74d83a-1920-960.jpg", "publishedAt": "2019-03-18T17:37:45Z", "content": "Thanks to its thinner bezels, Apple's smaller iPad Pro (pictured above alongside the 12.9-inch version) manages to pack a slightly larger display into a body that's around the same size as the new iPad Air. \r\n Among the biggest differences between the iPad Ai… [+608 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Amir Ismael", "title": "Take an extra 30% off Sperry boat shoes — and more of today's best deals from around the web", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/deal-of-the-day-sperry-sale-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b33b7651ae6624e008b5510-960-480.jpg", "publishedAt": "2019-03-18T17:30:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+4198 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Emma Court", "title": "The FDA’s top leader says the US is approaching a tipping point on vaccines that could lead to ‘epidemics and maybe worse’", "description": "We asked FDA Commissioner Scott Gottlieb if there was one thing someone could do right now to fix healthcare. Gottlieb quickly indicated vaccines, a crucial scientific advance that protect us from dangerous diseases. They have also come under attack from an a…", "url": "https://www.businessinsider.com/scott-gottlieb-fda-vaccines-key-fix-for-us-health-system-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fb87e69bdec03682e0cc3-1920-960.jpg", "publishedAt": "2019-03-18T17:18:00Z", "content": "The US health system has all kinds of problems. \r\n But when we asked FDA Commissioner Scott Gottlieb if there was one fix that could significantly improve the system, he quickly pointed to vaccines. He told Business Insider that it's important that everyone g… [+2192 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "Samsung recruited the world's top 'Fortnite' player for a tournament showing off their new smartphones", "description": "Tyler \"Ninja\" Blevins, the world's most popular gamer, and iKon, a Korean pop group, helped Samsung celebrate the launch of its Galaxy S10 smartphones at a special event in New York City. At Samsung 837 in Manhattan, fans played in a \"Fortnite\" tournament usi…", "url": "https://www.businessinsider.com/samsung-galaxy-fortnite-ninja-ikon-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fcbdc6123ca101a0e4899-2732-1366.jpg", "publishedAt": "2019-03-18T17:14:40Z", "content": "To celebrate the launch of their new Galaxy S10 smartphones, Samsung partnered with the world's most popular gamer and a Korean pop supergroup for a special event in New York City called Level Up. \r\n Held at Samsung 837, the company's exclusive Manhattan venu… [+956 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson", "title": "Everything tennis icon Roger Federer eats and drinks for breakfast, lunch, and dinner", "description": "Roger Federer remains an elite competitor at the highest echelons of world tennis. But to stay on top of his game at 37 years old, he has to eat right. For Federer, that means cheese. Roger Federer remains a fierce competitor at the highest echelons of world …", "url": "https://www.businessinsider.com/what-does-roger-federer-eat-drinks-2018-4", "urlToImage": "https://amp.businessinsider.com/images/5ae3264319ee8621008b45c1-1920-960.jpg", "publishedAt": "2019-03-18T17:12:00Z", "content": "Roger Federer.\r\n Getty Images \r\n Roger Federer remains a fierce competitor at the highest echelons of world tennis. \r\n Though he lost the 2019 Indian Wells Masters final to Dominic Thiem on Sunday, he scooped his 100th career title at the Dubai Tennis Champio… [+519 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Slotnick", "title": "Capital One is offering a 100% bonus when you transfer miles to Emirates' frequent-flyer program — here's what you need to know", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/transfer-capital-one-miles-to-emirates-skywards-100-percent-bonus-march-2019", "urlToImage": "https://amp.businessinsider.com/images/5c8fc702124d0407dd62cb6e-2732-1366.jpg", "publishedAt": "2019-03-18T17:09:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+3120 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "Fox News host Pete Hegseth told viewers to buy more AR-15s days after New Zealand mosque shooting that killed 50", "description": "\"Fox and Friends\" host Pete Hegseth told viewers on Sunday to buy more AR-15s after former Texas congressman and Democratic presidential candidate Beto O'Rourke said he wanted to ban sales of the rifle. Hegseth was responding to a soundbite from O'Rourke, in …", "url": "https://www.businessinsider.com/fox-news-pete-hegseth-told-viewers-to-buy-more-ar-15s-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fb8b7f73f5c01b47e84a6-1920-960.jpg", "publishedAt": "2019-03-18T17:04:42Z", "content": "\"Fox and Friends\" weekend co-host Pete Hegseth told viewers to buy more AR-15s after Democratic presidential candidate Beto O'Rourke called for sales of the rifle to be banned amid a resurge of discussion around the weapon. \r\n \"If you own an AR-15, keep it. C… [+2272 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson", "title": "Sylvester Stallone says the UFC is worried about Conor McGregor after the Irishman got 'publicly humiliated'", "description": "Sylvester Stallone, a minority owner in the UFC, has said that the company is concerned about its most famous athlete Conor McGregor. McGregor was famously submitted by Khabib Nurmagomedov in the fourth round of a one-sided fight at UFC 229. He was recently a…", "url": "https://www.businessinsider.com/sylvester-stallone-says-ufc-is-worried-about-conor-mcgregor-after-public-humiliation-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c517dfa2bdd7f7e00747254-1920-960.jpg", "publishedAt": "2019-03-18T17:04:00Z", "content": "Sylvester Stallone, a minority owner in the UFC, has said the company is concerned about Conor McGregor after the Irishman keeps getting \"publicly humiliated.\" \r\n Stallone shot to fame when he wrote and starred in \"Rocky,\" a movie about a heavyweight boxer wh… [+2957 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "The long-awaited first Battle Pass for 'Apex Legends' arrives this week — here's how it works and what's in it", "description": "\" Apex Legends \" has been available for just over one month, and it's already amassed over 50 million players across Xbox One, PlayStation 4, and PC. The game is from the Battle Royale genre shared by other smash hits like \"Fortnite\" and \"PlayerUnknown's Batt…", "url": "https://www.businessinsider.com/apex-legends-first-battle-pass-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fcb2969bdec05f85af3d3-2732-1366.jpg", "publishedAt": "2019-03-18T17:00:00Z", "content": "Over 50 million players later and \"Apex Legends\" is just now getting its first Battle Pass — it costs 950 Apex Coins ($9.50) and is scheduled to arrive on Tuesday across all platforms. \r\n The Battle Pass is named \"Wild Frontier,\" and it arrives alongside a br… [+1842 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hillary Hoffower", "title": "7 ways rich millennials spend and display their money differently than rich baby boomers", "description": "Rich millennials have different financial behaviors and habits than rich baby boomers do. Growing up in an age of technology, millennials tend to display their wealth on social media, buy luxury goods online, invest in cryptocurrency, and dress more casually.…", "url": "https://www.businessinsider.com/rich-millennials-vs-baby-boomers-different-money-habits-wealth-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c897170124d0423ad5aa7ba-1920-960.jpg", "publishedAt": "2019-03-18T16:52:00Z", "content": "When it comes to viewing and spending wealth, wealthy millennials prioritize different values than wealthy baby boomers, according to Boston Private's 2018 \"The Why of Wealth\" report, which surveyed respondents with net investable assets of $1 million to $20 … [+1113 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Lyft is seeking a $23 billion valuation as it officially launches its IPO — here’s where its executives are headed to court investors (LYFT)", "description": "Lyft filed an update to its IPO prospectus on Monday, targeting a $21 billion-$23 billion valuation when shares price as early next week. Executives and bankers will begin the company's roadshow this week with stops in Los Angeles, San Francisco, New York, Ba…", "url": "https://www.businessinsider.com/lyft-ipo-roadshow-company-begins-full-schedule-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fc794f73f5c041d15b3c4-2732-1366.jpg", "publishedAt": "2019-03-18T16:48:00Z", "content": "Lyft is going full-steam-ahead on its initial public offering. \r\n In an updated filing with regulators on Monday, the US ride-hailing company said it will sell 35 million shares for a price between $62 and $68 each, resulting in a valuation of up to $23 billi… [+2650 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "How to contact Google support for help with any Google-related issue", "description": "If you're looking to contact Google for help with a Google-related issue, there are a few routes you can take. Google does not offer phone support save for assistance with a few specific apps, and many of the numbers posted online claiming to be Google custom…", "url": "https://www.businessinsider.com/how-to-contact-google-support", "urlToImage": "https://amp.businessinsider.com/images/5c8fc9cdf73f5c04524b238b-1536-768.jpg", "publishedAt": "2019-03-18T16:44:00Z", "content": "Don't take this personally, but Google doesn't want to talk to you. Part of it is they'd be crazy busy if they had to run an active customer support call center — hundreds of millions of people use some form of Google product every day. \r\n The other thing is … [+3716 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "Here are the most likely March Madness upsets, according to Las Vegas", "description": "March Madness is back, and it's time to start filling out your bracket. Picking upsets is one of the toughest parts of building a bracket, but with a little help from Las Vegas, you can know which teams to target. Based on the bookmakers' numbers, there are a…", "url": "https://www.businessinsider.com/most-likely-upsets-march-madness-ncaa-tournament-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fb08ef73f5c7ec33c25f8-1334-667.jpg", "publishedAt": "2019-03-18T16:41:00Z", "content": "When it comes to March Madness, upsets are often the difference between winning your pool and finishing out of the money. \r\n Upsets are often seen as bold choices, but if you know where to look, some of the picks are easier than you might think. Based on the … [+439 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shelagh Dolan", "title": "The urgent care industry trends looking to fulfill the demand of a growing segment in the healthcare market", "description": "The popularity of urgent care clinic business model has been on the rise as the demand for cheaper alternatives to hospitals grows. The number of urgent care facilities increased from 6,400 in 2014 to 8,100 in 2018, with another 500 to 600 expected to open th…", "url": "https://www.businessinsider.com/urgent-care-industry-trends", "urlToImage": "https://amp.businessinsider.com/images/5c8fc8d6003f5c077239a098-1136-568.jpg", "publishedAt": "2019-03-18T16:38:00Z", "content": "What are urgent care clinics? \r\n Business Insider Intelligence \r\nUrgent care centers are convenient, on-demand care outlets similar to walk-in retail clinics, but rather than treating low-acuity conditions such as bronchitis and minor infections, urgent care … [+5625 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jim Edwards", "title": "The closer we get to Brexit, the more solid the majority against it is", "description": "The UK public would support a second Brexit referendum if Theresa May's government tries to leave the European Union with no deal, according to YouGov. Polls show a consistent majority for \"remain.\" But the public does not support a repeat of the 2016 vote, i…", "url": "https://www.businessinsider.com/brexit-polls-leave-remain-second-referendum-vote-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fa32e69bdec7e5f62292b-1920-960.jpg", "publishedAt": "2019-03-18T16:32:00Z", "content": "The general public supports holding a second referendum on the decision to leave the European Union if the UK government attempts to Brexit without a deal, according to YouGov. \r\nWhen the question is whether UK voters favour a referendum if the choice is betw… [+1697 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "One US airline will likely bear the brunt of the Boeing 737 Max ban (BA, LUV)", "description": "Southwest Airlines will face greater logistical challenges following the grounding of Boeing 737 Max aircraft than United Airlines and American Airlines, said Henry Harteveldt, the founder of the travel research company Atmosphere Research Group. American and…", "url": "https://www.businessinsider.com/southwest-faces-challenge-adapting-to-boeing-737-max-ban-expert-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fb85d69bdec03632ee612-1920-960.jpg", "publishedAt": "2019-03-18T16:21:39Z", "content": "Southwest Airlines will face greater logistical challenges following the grounding of Boeing 737 Max aircraft than United Airlines and American Airlines, the other United States airlines who use the aircraft, said Henry Harteveldt, the founder of the travel r… [+2121 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Facebook analysts are sounding off on executive turnover, privacy, and regulation (FB)", "description": "Facebook shares fell Monday after a handful of Wall Street analysts expressed concern over the company's recent management changes as well as regulation- and privacy-related uncertainty. Needham downgraded its rating from \"buy\" to \"hold,\" pointing in part to …", "url": "https://markets.businessinsider.com/news/stocks/facebook-stock-price-regulation-management-change-noted-by-analysts-2019-3-1028038766", "urlToImage": "https://images.markets.businessinsider.com/image/5ac7ac687ec3bb8f368b489a-2277/ap18095701904136.jpg", "publishedAt": "2019-03-18T16:15:00Z", "content": "AP\r\nFacebook shares fell Monday after a handful of Wall Street analysts expressed concern over the company's recent management changes as well as regulation- and privacy-related uncertainty.\r\nNeedham downgraded its rating from \"buy\" to \"hold,\" pointing in par… [+3499 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Facebook analysts are sounding off on executive turnover, privacy, and regulation (FB)", "description": "Facebook shares fell Monday after a handful of Wall Street analysts expressed concern over the company's recent management changes as well as regulation- and privacy-related uncertainty. Needham downgraded its rating from \"buy\" to \"hold,\" pointing in part to …", "url": "https://www.businessinsider.com/facebook-stock-price-regulation-management-change-noted-by-analysts-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fa3a7003f5c017822d5d4-1920-960.jpg", "publishedAt": "2019-03-18T16:15:00Z", "content": "Facebook shares were under pressure Monday after Wall Street analysts sounded off about some of the most pressing issues surrounding the beleaguered social network: violent images on the platform, privacy concerns, regulation, and management changes. \r\n \"We a… [+3058 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "YouTube's human moderators couldn't stem the deluge of Christchurch massacre videos, so YouTube benched them", "description": "YouTube said videos of the mass shooting at two mosques in Christchurch, New Zealand, were being uploaded at an \"unprecedented\" speed last Friday. YouTube's Chief Product Officer Neal Mohan told The Washington Post that his team removed human moderators, inst…", "url": "https://www.businessinsider.com/youtube-benched-humans-and-used-ai-to-deal-with-christchurch-massacre-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fc30b69e11c197921a824-2732-1366.jpg", "publishedAt": "2019-03-18T16:14:47Z", "content": "YouTube has provided an insight into how it dealt with the \"unprecedented\" deluge of videos of the mass shooting in Christchurch, New Zealand, last Friday. \r\n In an interview with The Washington Post, YouTube's Chief Product Officer Neal Mohan explained how t… [+2564 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dennis Green", "title": "Amazon's HQ2 in Virginia just cleared a major hurdle, and it reveals a key difference from its New York project (AMZN)", "description": "The Arlington County Board approved a $23 million incentives package for Amazon on Saturday. The tax incentive is directly related to Amazon's plan to build a second headquarters, known as HQ2, in Arlington County and will be fueled by a higher tax on hotel r…", "url": "https://www.businessinsider.com/amazon-hq2-virginia-passes-key-vote-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fb41169bdec02807ce2aa-2732-1366.jpg", "publishedAt": "2019-03-18T16:13:06Z", "content": "Virginia's Amazon HQ2 is one step closer to becoming a reality. \r\n The Arlington County Board approved a $23 million incentives package for Amazon during a six-hour hearing on Saturday, it said in a press release. Amazon representatives were in attendance and… [+1737 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Beto O'Rourke says he'll likely pick a woman as his vice presidential running mate after being criticized for joking about his lack of parenting", "description": "Beto O'Rourke, who announced his 2020 presidential bid last Friday, said he would very likely pick a woman as his vice presidential running mate if he's chosen as the Democratic nominee. \"It would be very difficult not to select a woman with so many extraordi…", "url": "https://www.businessinsider.com/beto-orourke-likely-pick-woman-vice-president-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f9fd66123ca08724d3dec-1136-568.jpg", "publishedAt": "2019-03-18T16:07:02Z", "content": "Beto O'Rourke, who announced his 2020 presidential bid last Friday, said he would very likely pick a woman as his vice presidential running mate if he's chosen as the Democratic nominee. \r\n The El Paso, Texas Democrat paused for a moment after a voter asked h… [+2852 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanza Loudenback", "title": "7 stupid things people do with their money that feel smart at the time", "description": "Some mistakes we make with our money are knowingly reckless, but others aren't. For example, taking on a ton of student loans or dipping into your 401(k) to pay off debt may seem smart, but there's a lot to consider. One of the worst things you can do with yo…", "url": "https://www.businessinsider.com/stupid-things-people-do-with-their-money-that-feel-smart-at-the-time-2017-5", "urlToImage": "https://amp.businessinsider.com/images/5c8f11b3113a5079d65fa7b4-1920-960.jpg", "publishedAt": "2019-03-18T16:05:00Z", "content": "We've all made mistakes with our money. While some are knowingly reckless — say, an expensive night at the casino or going into debt to buy a fancy car you can't quite afford — others are less obvious. \r\n For instance, not getting a credit card because you're… [+7860 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katya Kupelian", "title": "9 things you probably didn't know about Amazon", "description": "Amazon was almost named \"Cadabra,\" which is short for the magic term, \"abracadabra.\" CEO Jeff Bezos started the company in 1995 by selling books. There are about 6,000 dogs that \"work\" at Amazon HQ in Seattle — they even have a dog park on site. Watch the vid…", "url": "https://www.businessinsider.com/amazon-jeff-bezos-facts-brand-history-name-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8faacf401d587f42493847-2732-1366.jpg", "publishedAt": "2019-03-18T16:00:00Z", "content": "Following is a transcript of the video.\r\n 1. Amazon was almost given a completely different name. \r\n The company was originally called Cadabra, like the magic term \"abracadabra.\" But Jeff Bezos' lawyer told him that the magic reference was too obscure, and wh… [+3971 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "Microsoft is hoping to turn the Pacific Northwest into ground zero for quantum computing (MSFT)", "description": "Microsoft announced Monday that it's teamed up with the Pacific Northwest National Laboratory and the University of Washington to create the Northwest Quantum Nexus, to promote quantum computing. The three partners are hosting a summit at the University of Wa…", "url": "https://www.businessinsider.com/microsoft-has-formed-a-coalition-to-promote-quantum-computing-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c4a554f07ae6a892d8943-2732-1366.jpg", "publishedAt": "2019-03-18T16:00:00Z", "content": "Microsoft and some big research institutions are hoping to turn the Pacific Northwest into a hotbed for quantum computing. \r\n On Monday, Microsoft Quantum, the company's research team devoted to the field, announced that it's getting together with the Pacific… [+4143 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Thomas Colson", "title": "Theresa May cannot hold third vote on her Brexit deal, says John Bercow", "description": "Theresa May could be barred from holding another vote on her Brexit deal. In an explosive intervention, House of Commons Speaker John Bercow said governments cannot ask MPs to vote repeatedly on the same proposition. Bercow told MPs: \"The government cannot le…", "url": "https://www.businessinsider.com/theresa-may-cannot-hold-third-vote-on-her-brexit-deal-says-john-bercow-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fbdf9124d040641287ee5-1136-568.jpg", "publishedAt": "2019-03-18T15:53:39Z", "content": "LONDON — Theresa May cannot hold a third vote on her Brexit deal, according to an explosive intervention from House of Commons Speaker John Bercow. \r\n Speaking on Monday, Bercow said that parliamentary precedent barred the government from holding repeated vot… [+1436 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Audrey Schomer", "title": "Snapchat is planning to unveil an in-app mobile gaming platform (SNAP, TCEHY)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here. Snap is reportedly planning to unveil a mobile gaming platform a…", "url": "https://www.businessinsider.com/snapchat-mobile-gaming-platform-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c4a2c6f2bdd7f7f704dc212-750-375.jpg", "publishedAt": "2019-03-18T15:52:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here. Snap is reportedly planning to unveil a mobile gaming platform a… [+2533 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Holly Johnson", "title": "4 reasons to open the recently refreshed AmEx Gold card, especially if you're a foodie", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/should-i-get-amex-gold-2018-10", "urlToImage": "https://amp.businessinsider.com/images/5bcf6429d2e6483ecf658ec7-1536-768.jpg", "publishedAt": "2019-03-18T15:50:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+6014 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "Investigators are sifting through black box data from the Ethiopian Airlines Boeing 737 Max to unlock the cause behind the crash. Here's what a black box really is.", "description": "Ethiopian transport minister Dagmawit Moge told reporters on Sunday that an evaluation of the black boxes from crashed Boeing 737 Max 8 jets in Ethiopian Airlines Flight ET302 and Lion Air Flight JT610 showed \"clear similarities.\" Flight ET302's black boxes w…", "url": "https://www.businessinsider.com/airplane-black-box-explainer-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f9e0d6123ca08461bd946-2732-1366.jpg", "publishedAt": "2019-03-18T15:48:00Z", "content": "Ethiopian transport minister Dagmawit Moge told reporters on Sunday that an evaluation of the black boxes from Ethiopian Airlines Flight ET302 and Lion Air Flight JT610 showed \"clear similarities.\" \r\nFlight ET302's black box was flown last week to Paris for e… [+2623 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Ciolli", "title": "JPMORGAN: Tesla investors are ignoring the possibility that CEO Elon Musk will be forced out. Here's how they can protect against that worst-case scenario.", "description": "Tesla has experienced a series of issues stemming from CEO Elon Musk's use of Twitter, and several legal milestones are approaching. JPMorgan argues that investors are underestimating the possibility that Musk is forced to step down as either CEO or as a dire…", "url": "https://www.businessinsider.com/tesla-stock-options-trade-recommendation-investors-overlooking-elon-musk-legal-woes-jpmorgan-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8faf18e0575a01d2725ee8-1920-960.jpg", "publishedAt": "2019-03-18T15:42:20Z", "content": "The headlines around Tesla and its embattled CEO Elon Musk have been escalating on a seemingly weekly basis. But if that turmoil is affecting the company's investors, they sure aren't showing it. \r\n So says the derivatives strategy team at JPMorgan, which fin… [+2736 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "Here's who the experts are picking to pull off upsets in March Madness", "description": "March Madness is here, and that means it's time to fill out brackets. Upsets in the tournament are common but are nearly impossible to pick. We surveyed the brackets and upset predictions of several college basketball experts to get an idea of who could be a …", "url": "https://www.businessinsider.com/march-madness-upset-predictions-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fb1c4f73f5c7ee114a813-1334-667.jpg", "publishedAt": "2019-03-18T15:40:42Z", "content": "March Madness is here! \r\n With the NCAA Tournament bracket now official, it's time to start filling out brackets, picking winners, and most importantly, taking a stab at upsets. \r\n Picking upsets is not an exact science. Sometimes wins can be flukey and somet… [+765 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Áine Cain", "title": "Home Depot is embarking on a massive hiring spree as retail's war for talent rages on (HD)", "description": "Home Depot is on a massive hiring spree for the spring rush. In order to hire around 80,000 store associates, Home Depot is reportedly putting some new in-house technology to use. The home improvement retailer's campaign features a few strategies that other r…", "url": "https://www.businessinsider.com/home-depot-hiring-store-associates-spring-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fa1a601df7208a26d52e2-1920-960.jpg", "publishedAt": "2019-03-18T15:37:17Z", "content": "A Home Depot spokesperson told Business Insider that the company is well on its way to hiring 80,000 associates \"to staff our stores for our busiest selling season.\" \r\n The company is looking to fill both permanent and seasonal part-time jobs. The spokesperso… [+2118 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "Plant delivery startup The Sill makes it easy to learn about which plants are right for your home — here's how it works", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/the-sill-review-order-plants-online", "urlToImage": "https://amp.businessinsider.com/images/5c8c08a769bdec5bce079b35-750-375.jpg", "publishedAt": "2019-03-18T15:29:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+4317 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "There are 6 Marvel movies in the works for after 'Avengers: Endgame' — here are all the details", "description": "Marvel Studios has eight release dates set for untitled Marvel Cinematic Universe movies after 2019. Not much is known about the MCU's future after \"Avengers: Endgame,\" but there are at least six movies currently in the works. The Marvel Cinematic Universe wi…", "url": "https://www.businessinsider.com/marvel-cinematic-universe-movies-after-2019-details-release-dates-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fab46124d0402e707cf32-1334-667.jpg", "publishedAt": "2019-03-18T15:28:20Z", "content": "The Marvel Cinematic Universe will enter bold new territory after this year. \r\n\"Avengers: Endgame\" and \"Spider-Man: Far From Home\" come to theaters in April and July, respectively, but beyond that, details are scarce about the MCU's future. But we do know tha… [+1264 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nicky Lineaweaver", "title": "Cleveland Clinic has launched the Center for Clinical Artificial Intelligence", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Health Briefing subscribers. To receive the full story plus other insights each morning, click here. Cleveland Clinic launched the Center for Clinical Artificial In…", "url": "https://www.businessinsider.com/cleveland-clinic-artificial-intelligence-center-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a49cc6123ca30f402b226-960-480.jpg", "publishedAt": "2019-03-18T15:23:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Health Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Cleveland Clinic launched the Center for Clinical Artificial … [+4662 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shayanne Gal and Grace Panetta", "title": "Here are the biggest endorsements all the 2020 Democratic presidential candidates have received so far", "description": "The first caucuses and primaries of the 2020 presidential election are almost 11 months away, and the 15 candidates currently vying for the Democratic nomination are scrambling to shore up support among the rest of their party. While candidates with the most …", "url": "https://www.businessinsider.com/biggest-political-endorsements-democratic-2020-candidates-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c139e01df7264256f3b87-1136-568.png", "publishedAt": "2019-03-18T15:22:19Z", "content": "The first caucuses and primaries of the 2020 presidential election are almost 11 months away, and the 15 currently-declared candidates currently vying for the Democratic nomination are scrambling to shore up support among the rest of their party. \r\n As FiveTh… [+1497 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Adam Payne", "title": "Nick Boles is too 'Thatcherite' to join the Independent Group, says Chuka Umunna", "description": "Nick Boles is not \"progressive\" enough to join the Independent Group, according to Chuka Umunna. Boles quit his local Conservative party last week amid a growing row over his stance on Brexit. It was suggested that the former minister could join ex-Conservati…", "url": "https://www.businessinsider.com/chuka-umunna-boles-is-too-thatcherite-to-join-the-independent-group-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fa4cbdaa5077f366c3124-750-375.jpg", "publishedAt": "2019-03-18T15:08:16Z", "content": "LONDON — The Independent Group's Chuka Umunna has dismissed suggestions that Nick Boles could be the next MP to join the grouping, claiming that the former minister is too \"Thatcherite\" to be a member. \r\nBoles quit his local Conservative party over the weeken… [+2314 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matthew DeBord", "title": "Trump's accusations about socialism should be taken seriously — because when it comes to business, he's a socialist (GM)", "description": "President Donald Trump attacked General Motors for idling a factory in Ohio, demanding that the carmaker reopen the plant. GM idled the plant because it was producing a slow-selling car and running well below capacity. The company will figure out what to ulti…", "url": "https://www.businessinsider.com/trump-socialist-gm-reopen-factory-ohio-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b6319505c5e5223008b4c27-1920-960.jpg", "publishedAt": "2019-03-18T15:06:04Z", "content": "In the US, we actually have a long history with socialism. It isn't woolly, storm-the-barricades, hard-left stuff. Rather, it's democratic socialism, and for the most part, it has involved a long expansion of the welfare state. \r\n FDR's New Deal of the 1930s … [+5968 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "The best 2-in-1 laptops you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-2-in-1-laptop", "urlToImage": "https://amp.businessinsider.com/images/5c8fad395b066e047a1ba599-1136-568.jpg", "publishedAt": "2019-03-18T15:06:00Z", "content": "Why you'll love it: The Asus ZenBook Flip features the latest-gen processor, a nice design, and it's one of the few 2-in-1s to boast discrete graphics from Nvidia. \r\n If you need high-quality graphics, then you know that a desktop computer is probably the bes… [+1648 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Boeing and the FAA were reportedly told about issues with the 737 max software 4 days before the plane's second deadly crash (BA)", "description": "The Seattle Times presented internal safety analysis of the 737 Max's MCAS software to Boeing and the FAA four days before the plane's second fatal crash in five months. According to the report, internal documents from Boeing showed significant problems with …", "url": "https://www.businessinsider.com/boeing-faa-told-of-possible-mcas-software-issues-in-737-max-plane-before-crash-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fafd369e11c158622734a-1920-960.jpg", "publishedAt": "2019-03-18T15:01:50Z", "content": "Safety issues in Boeing's MCAS software — the program under scrutiny following a second 737 Max crash this month— were presented to both the company and the Federal Aviation Administration four days before the fatal Ethiopian Airlines crash last Sunday, The S… [+2489 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kelly McLaughlin", "title": "A father of 4 who chased down the Christchurch gunman says his sons begged him not to do it. He says was doing what anyone else would have done.", "description": "Abdul Aziz, a 48-year-old Afghan refugee, chased the Christchurch gunman out of the Linwood Islamic Centre in New Zealand on Friday after the attacker opened fire. Aziz, who was with his family, chased the attacker outside with a credit card machine and grabb…", "url": "https://www.businessinsider.com/abdul-aziz-christchurch-gunman-linwood-mosque-hero-2019-3", "urlToImage": null, "publishedAt": "2019-03-18T14:56:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dan DeFrancesco", "title": "The CEO of the firm backing robos like Betterment and Stash says the future of managing money could be more like ordering dinner from a restaurant", "description": "Bill Capuzzi, CEO of Apex Clearing, said advisors and robos should aim to offer multiple options for clients when it comes to investing their money. As different live events happen, people should be able adjust whether they work purely with an advisor, robo o…", "url": "https://www.businessinsider.com/ceo-of-apex-clearing-talks-about-the-future-of-wealth-management-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c256b6123ca667410f969-1136-568.jpg", "publishedAt": "2019-03-18T14:49:45Z", "content": "The future of managing money could be more like picking what you want for dinner at a restaurant than being locked into a specific service for years. \r\n That's the way Bill Capuzzi, CEO of Apex Clearing, sees the industry evolving. Instead of only offering au… [+2499 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nicholas Shields", "title": "Tesla's Model Y pulls from the Model 3's playbook (TSLA)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Transportation & Logistics Briefing subscribers. To receive the full story plus other insights each morning, click here. Last Thursday, Tesla lifted the veil on its much-an…", "url": "https://www.businessinsider.com/tesla-model-y-crossover-suv-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fab92e0575a01412ed3b1-1920-960.jpg", "publishedAt": "2019-03-18T14:43:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Transportation &amp; Logistics Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Last Thursday, Tesla lifted the veil on its m… [+3189 chars]"}]}