{"status": "ok", "totalResults": 966, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Natt Garun", "title": "Dyson’s new ambient lamp promises to last up to 60 years and has a USB-C port built in", "description": "The Dyson Lightcycle is a desk and floor lamp that can automatically adjust its lighting temperature based on ambient light or time of day. You can now set wake and sleep times to gradually adjust as you prepare to rise or wind down the day.", "url": "https://www.theverge.com/2019/3/20/18274202/dyson-lightcycle-lamp-ambient-pusb-c-port-air-purifier-lasts-60-years", "urlToImage": "https://cdn.vox-cdn.com/thumbor/7tws6xFN7rY4NUQEpBq88CrSFMs=/0x172:2400x1429/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974819/Multi_Product_Shot_Kids_Bedroom.jpg", "publishedAt": "2019-03-20T23:00:00Z", "content": "Alongside todays announcement of a new V11 cordless vacuum, Dyson also announced updates to its lighting and air purifier products. The first is the Dyson Lightcycle, its desk and floor lamp that can automatically adjust its lighting temperature based on ambi… [+3195 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Moto Mods aren’t dead yet, if this Moto Z4 leak is to be believed", "description": "According to a new leak, the Moto Z4 for 2019 may have a teardrop-notched display, but the most important feature might be its Moto Mods pogo pins, which may signal continued support for the modular accessory lineup.", "url": "https://www.theverge.com/2019/3/20/18274764/motorola-moto-z4-leak-mods", "urlToImage": "https://cdn.vox-cdn.com/thumbor/T54JpRHXJrT-JKpMmA-qii3cNBE=/0x0:642x336/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15975826/Moto_Z4_press_render_leak.jpg", "publishedAt": "2019-03-20T21:40:52Z", "content": "Motorolas Moto Z4 phone has leaked, and while it isnt much of a surprise that the company would make a fourth iteration of its flagship Android phone, its the first indication weve seen that its Moto Mod initiative may still be alive and kicking because you c… [+2446 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Faraday Future just sold its headquarters to help keep the company alive", "description": "An NYC real estate firm bought the troubled EV startup’s home base and is leasing it back to them. The move comes one week after Faraday Future announced that it’s selling 900 acres of land in Las Vegas where it once wanted to build a $1 billion factory for i…", "url": "https://www.theverge.com/2019/3/20/18269081/faraday-future-sold-headquarters-la-leasing-ev-electric-car", "urlToImage": "https://cdn.vox-cdn.com/thumbor/pIS0XJev7WdgMpfNgZqHNi1K580=/17x421:2882x1921/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15975556/ff_91_gallery6.jpg", "publishedAt": "2019-03-20T21:22:46Z", "content": "Faraday Future has sold its Los Angeles headquarters in a move to help fill the EV startups exhausted coffers, according to property documents obtained by The Verge. A subsidiary of New York-based real estate firm Atlas Capital purchased the headquarters on M… [+5446 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Today’s AirPods launch underscores Apple’s latest AirPower misfire", "description": "Apple finally announced its second-generation AirPods, most notably adding wireless charging to the popular headphones. But there was just one piece missing: Apple’s long-absent AirPower charger. If there was ever a moment to re-announce AirPower, this was th…", "url": "https://www.theverge.com/circuitbreaker/2019/3/20/18274842/airpods-airpower-apple-product-delay-issues", "urlToImage": "https://cdn.vox-cdn.com/thumbor/KX42oSN-e_hfNrW7Qan0I1NBiDg=/0x70:1000x594/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10419513/airpower.png", "publishedAt": "2019-03-20T20:52:53Z", "content": "Today, Apple finally announced its second-generation AirPods, most notably adding wireless charging to the popular headphones. Apple is even selling the wireless charging case separately, so that existing AirPod owners can join in the fun. The move brings App… [+3773 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "AT&T and Comcast announce system to combat robocalls", "description": "AT&T says the deal is likely the “nation’s first” to authenticate calls through the SHAKEN/STIR protocol. The protocol lets consumers know when a call they’re receiving is actually being placed by the displayed number. So any call placed through a spoofed num…", "url": "https://www.theverge.com/2019/3/20/18274775/att-comcast-robocalls-system-combat", "urlToImage": "https://cdn.vox-cdn.com/thumbor/AQp1yC-WXzQriaOJfE1kVX_UQpk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10357163/DSCF2964.jpg", "publishedAt": "2019-03-20T20:45:22Z", "content": "AT&T and Comcast are partnering to authenticate calls made between the two networks, letting customers know when there’s a genuine caller — not a spammer — on the phone. It won’t cover every call AT&T and Comcast customers receive, but it’s a step in the righ… [+1872 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Angela Chen", "title": "Anesthesia can help patients forget a disturbing memory", "description": "Giving patients an anesthetic can help them forget a disturbing memory, according to research published today in the journal Science Advances. It’s the latest study to investigate the conditions that might prevent memories from sticking, and it could be a ste…", "url": "https://www.theverge.com/2019/3/20/18274563/memory-neurosciece-anesthesia-ptsd-addiction-stress-retrieval-reconsolidation-psychiatry", "urlToImage": "https://cdn.vox-cdn.com/thumbor/uZPxqfX8yjUumCS8a2blp6e9kSI=/0x141:2040x1209/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10572641/wjoel_180329_1777_Brain_001_2.jpg", "publishedAt": "2019-03-20T18:35:57Z", "content": "Giving patients an anesthetic can help them forget a disturbing memory, according to research published today in the journal Science Advances. Its the latest study to investigate the conditions that might prevent memories from sticking, and it could be a step… [+4445 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Stadia is about the future of YouTube, not gaming", "description": "Google’s Stadia cloud gaming service is presented as a revolution and the future of gaming. But the company’s announcement suggests it’s more concerned with the future of YouTube and preserving the hugely lucrative gaming video audience it has.", "url": "https://www.theverge.com/2019/3/20/18274184/google-stadia-youtube-streaming-future-gaming-cloud", "urlToImage": "https://cdn.vox-cdn.com/thumbor/MKMBnvr1vzFctYz9XcAI6fy8P3Q=/0x162:2263x1347/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15975432/stadia_cont.jpg", "publishedAt": "2019-03-20T18:12:27Z", "content": "Yesterday, Google announced plans for a new game-streaming service called Stadia. Besides the logo, the controller, and a single game Doom Eternal the announcement left us with more questions than answers. Primary in my mind has been the query of why Google n… [+7913 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "AT&T CEO interrupted by a robocall during a live interview", "description": "Over the past few months, regulators at the Federal Communications Commission have been feeling the pressure from lawmakers and consumers who are urging them to put an end to the relentless onslaught of robocalls people receive every day.", "url": "https://www.theverge.com/2019/3/20/18274519/att-ceo-robocall-randall-stephenson-live-interview-fcc-ajit-pai", "urlToImage": "https://cdn.vox-cdn.com/thumbor/H-fMk9YCx-yHRjx6q6N_cZnOkYw=/0x421:5875x3497/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15975411/876843460.jpg.jpg", "publishedAt": "2019-03-20T18:02:58Z", "content": "At an Economic Club event in Washington, DC today, AT&amp;T CEO Randall Stephenson was interrupted on stage by a robocall, pausing an interview in front of dozens of people and driving home that absolutely no one is safe from the spam epidemic.\r\nOver the past… [+1279 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Facebook is adding quoted replies to Messenger conversations", "description": "Facebook is updating Messenger today with a new feature: the ability to quote and reply to specific messages in a conversation, making it easier to keep track of things (especially in larger group chats).", "url": "https://www.theverge.com/2019/3/20/18274521/facebook-quote-reply-messenger-conversations-app-update-whatsapp-feature", "urlToImage": "https://cdn.vox-cdn.com/thumbor/SIsXHYbYf40Kn9rjqur_eCpATbk=/0x63:2000x1110/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15975325/image001.png", "publishedAt": "2019-03-20T17:36:31Z", "content": "Facebook is updating Messenger today with a new feature: the ability to quote and reply to specific messages in a conversation, making it easier to keep track of things (especially in larger group chats), as reported by VentureBeat. The feature comes as an ex… [+880 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Quantic Dream is bringing PlayStation games like Detroit and Heavy Rain to Epic’s PC store", "description": "At GDC 2019, Quantic Dream announced plans to bring former PS4 exclusives Detroit: Become Human, Beyond: Two Souls, and Heavy Rain to the PC through the Epic Games Store.", "url": "https://www.theverge.com/2019/3/20/18272214/quantic-dream-epic-pc-store-detroit-beyond-heavy-rain-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/bGiU55PFx_277U4gB5iHeG8mTbo=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11374537/DETROIT_CONNOR_REACT02.jpg", "publishedAt": "2019-03-20T17:30:00Z", "content": "Over the past decade, French studio Quantic Dream has become closely associated with the PlayStation platform, thanks to games like Detroit: Become Human and Beyond: Two Souls. But now, the developer is expanding its reach to the PC, and its starting with Epi… [+2394 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Epic Games CEO Tim Sweeney on PC store moderation: ‘We’re not in the porn business’", "description": "In an interview ahead of the company’s “State of Unreal” presentation at the Game Developers Conference in San Francisco, Epic Games CEO Tim Sweeney outlined some of his positions on the Epic Store. In particular, he was willing to address the issue of conten…", "url": "https://www.theverge.com/2019/3/20/18273639/epic-games-ceo-tim-sweeney-epic-store-moderation-valve-apple-google-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/054AQHkhOCMRKPaYQm5Q3V-0Bl4=/0x0:2667x1396/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974233/1014109804.jpg.jpg", "publishedAt": "2019-03-20T17:20:00Z", "content": "Fortnite creator Epic Games is in a unique position. Not only is the company overseeing development of one of the most popular and lucrative games on the planet, but it’s also now utilizing the success of that software to make its Unreal Engine development to… [+5305 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Epic’s stunning new Unreal demos show off high-end ray tracing and photorealism", "description": "At its Unreal Engine keynote at GDC 2019, Epic Games showed off two new technical demos that are designed to highlight photorealism and ray tracing with trailers for short films Troll and Rebirth.", "url": "https://www.theverge.com/2019/3/20/18273832/epic-unreal-engine-demo-troll-rebirth-ray-tracing-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/V9EWliKAXifQdf-sSl8482fwFqg=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974193/Troll_UE4_02_copy.jpg", "publishedAt": "2019-03-20T17:02:49Z", "content": "At its annual GDC showcase for the widely used Unreal Engine, Epic Games revealed a pair of gorgeous demos featuring a haunting future and an eerie fantasy realm. For developers, the two shorts demonstrate various new possibilities for the engine, but they al… [+508 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Apple is jumping into streaming video with a huge library of shows and films", "description": "Apple is getting ready to launch a TV and movie streaming service, and that means putting together an expansive catalog of original content. The company is widely expected to unveil its offering at an event on March 25th, and it could give us a first look at …", "url": "https://www.theverge.com/2019/3/20/18254720/apple-streaming-video-service-greenlit-development-list-tv-film", "urlToImage": "https://cdn.vox-cdn.com/thumbor/EH6wOPkCtsfHYaCN9zEo8GR10NE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13959855/acastro_190218_1777_apple_streaming_0003.jpg", "publishedAt": "2019-03-20T17:00:12Z", "content": "Apple is getting ready to launch a TV and movie streaming service, and that means putting together an expansive catalog of original content. The company is widely expected to unveil its offering at an event on March 25th, and it could give us a first look at … [+10711 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "Postmates launches a free group delivery option", "description": "The new delivery option, called Postmates Party, allows you to opt in to having your meal delivered as part of a group. In exchange, Postmates drops the delivery fee.", "url": "https://www.theverge.com/2019/3/20/18274391/postmates-party-meal-carpool-group-delivery-option", "urlToImage": "https://cdn.vox-cdn.com/thumbor/JQ0AjcKiy206c8xJZhjexGtwt6Y=/0x97:4170x2280/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15975074/Final_Postmates_Party.png", "publishedAt": "2019-03-20T17:00:00Z", "content": "Postmates is launching a new delivery option that comes without its sometimes pricey service fees: essentially, carpooling for your food.\r\nThe new delivery option, called Postmates Party, allows you to opt in to having your meal delivered as part of a group. … [+1412 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "Alamo Drafthouse theaters will launch an unlimited movies plan this year", "description": "Alamo Drafthouse Cinema is planning to launch what it calls the Alamo Season Pass, a Moviepass-style subscription service, nationwide by the end of this year.", "url": "https://www.theverge.com/2019/3/20/18274372/alamo-drafthouse-season-pass-unlimited-plan-moviepass", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YeduRw5hGJAhukbGls0p5jiP9Hk=/0x224:3000x1795/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15975108/460831236.jpg.jpg", "publishedAt": "2019-03-20T16:44:15Z", "content": "Alamo Drafthouse Cinema is planning to launch what it calls the Alamo Season Pass, a MoviePass-style subscription service, nationwide by the end of this year. The company is already beta testing the program in a small selection of its theaters. Its working fo… [+1905 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Epic Games will give away $100M in grants to fund creative projects that use Unreal Engine", "description": "Epic Games today announced a new grant initiative that will dole out $100 million to creators that make use of its Unreal Engine 4 toolset. The company is calling the initiative the MegaGrant program, and it builds off a similar, albeit smaller, one it launch…", "url": "https://www.theverge.com/2019/3/20/18274370/epic-games-megagrants-100-million-fund-games-media-entertainment-students-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/iAyCuwGunPXNJIVwQ3MbUlf5epg=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11503311/vpavic_180607_2652_0053.jpg", "publishedAt": "2019-03-20T16:36:46Z", "content": "Epic Games today announced a new grant initiative that will dole out $100 million to game developers, artists, students, educators, and those developing tools for other creators that make use of its Unreal Engine 4 toolset. The company is calling the initiati… [+2400 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Nintendo is bringing another huge wave of indie games to the Switch", "description": "At GDC, Nintendo announced another huge slate of indie games that are coming to the Switch. It’s becoming something of a theme lately. Since its launch, the Switch has steadily become a platform of choice for independent developers, and Nintendo has regular i…", "url": "https://www.theverge.com/2019/3/20/18273672/nintendo-switch-indie-games-neo-cab-overland-blaster-master", "urlToImage": "https://cdn.vox-cdn.com/thumbor/l-hNQfYyDiHjL51OOQvwCY_pZgI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10329931/jbareham_180301_2346_nintendo_switch_0132.jpg", "publishedAt": "2019-03-20T16:28:47Z", "content": "At GDC today, Nintendo announced another huge slate of indie games that are coming to the Switch. Its becoming something of a theme lately. Since its launch, the Switch has steadily become a platform of choice for independent developers, and Nintendo has regu… [+4065 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Cadence of Hyrule is an indie-developed Zelda spinoff for the Switch", "description": "Cadence of Hyrule is a Legend of Zelda coming to the Nintendo Switch, developed by the indie team behind Crypt of the Necrodancer.", "url": "https://www.theverge.com/2019/3/20/18273199/cadence-of-hyrule-zelda-spinoff-nintendo-switch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/6IJb40bWv1CUpjU-lliSCqC7k2Y=/31x0:933x472/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15975085/Screen_Shot_2019_03_20_at_9.23.51_AM.png", "publishedAt": "2019-03-20T16:26:01Z", "content": "If the upcoming remake of Links Awakening wasnt enough for you, today, Nintendo revealed that another new Zelda adventure is coming this year though its not what youd expect. In fact, the new game, dubbed Cadence of Hyrule, isnt actually developed by Nintendo… [+651 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Apex Legends loot boxes can be turned into crafting metals, thanks to Belgium ban", "description": "Instead of loot boxes, Apex Legends players in Belgium receive crafting metals for in-game cosmetics. Regardless of your region, you can currently adjust your settings to convert your battle pass winnings into crafting metals.", "url": "https://www.theverge.com/games/2019/3/20/18274246/apex-legends-loot-boxes-crafting-metals-belgium-ban", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2JYp8IF2XJI8kyX5NEVn8B4mkho=/0x150:3840x2160/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13734968/apex_legends_4.jpg", "publishedAt": "2019-03-20T16:23:00Z", "content": "Most Apex Legends players who buy the new battle pass will receive Apex Packs (this game’s version of loot boxes) as they level up — but not if you’re in Belgium. Following the country’s 2018 ban on paid loot boxes, rewards received come in the form of crafti… [+1735 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "Apple releases new spring colors for watch bands and iPhone cases", "description": "Apple has released new spring colors for Watch bands, iPhone cases, and its new Smart Battery Case. Nike Sport Loop and Hermes straps have new color options as well.", "url": "https://www.theverge.com/circuitbreaker/2019/3/20/18274242/apple-spring-colors-watch-bands-iphone-battery-cases", "urlToImage": "https://cdn.vox-cdn.com/thumbor/HoSJHC8Ctc0khHfMOaOFzC7KJlQ=/123x0:2476x1232/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974725/iphone_cases_accessories_201903.jpg", "publishedAt": "2019-03-20T16:21:54Z", "content": "Along with new wirelessly charging AirPods, Apple has also released a plethora of candy-colored pastel Watch bands and iPhone cases for spring. Most notably, the iPhone XS Smart Battery Case now comes in pink sand, after being limited to just black and white … [+771 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Cuphead is coming to the Nintendo Switch, with Xbox Live support coming", "description": "The former Microsoft and Xbox exclusive Cuphead is on its way to the Switch, with a launch on Nintendo’s platform slated for April.", "url": "https://www.theverge.com/2019/3/20/18273170/cuphead-nintendo-switch-release-date-xbox-live", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mjA7WogrfVF5uaoT9XGKWgns50w=/0x54:3792x2039/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15973018/NintendoSwitch_Cuphead_KeyArt_2.png", "publishedAt": "2019-03-20T16:15:02Z", "content": "Yet another big-name indie game is on its way to the Nintendo Switch: this time, its the brutally hard Cuphead.\r\nThe run-and-gun platform game first launched back in 2017 as a Microsoft exclusive, debuting on both the Xbox One and PC. During the announcement … [+628 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Volvo will use in-car cameras to combat drunk and distracted driving", "description": "Volvo said on Wednesday it will use cameras installed inside its vehicles to monitor driver behavior and intervene if the driver appears to be drunk or distracted. It’s a risky move by an automaker, even one with a reputation for safety like Volvo, which coul…", "url": "https://www.theverge.com/2019/3/20/18274235/volvo-driver-monitoring-camera-drunk-distracted-driving", "urlToImage": "https://cdn.vox-cdn.com/thumbor/7q1lzD7K-YHF4Woup9zMu36GU3E=/0x365:5100x3035/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974699/250104_Driver_Monitoring_Camera_in_a_Volvo_research_vehicle.jpg", "publishedAt": "2019-03-20T16:12:51Z", "content": "Volvo said on Wednesday it will use cameras installed inside its vehicles to monitor driver behavior and intervene if the driver appears to be drunk or distracted. Its a risky move by an automaker, even one with a reputation for safety like Volvo, which could… [+2693 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Google browser vulnerability could have let hackers steal personal data", "description": "Researchers have discovered a critical vulnerability in Google’s Chromium browser that could be used to steal personal data. Positive Technologies researcher Sergey Toshin uncovered the bug last December and disclosed it to Google in January, which patched th…", "url": "https://www.theverge.com/2019/3/20/18271258/google-chromium-vulnerability-hackers-steal-personal-data", "urlToImage": "https://cdn.vox-cdn.com/thumbor/4aHw2KuKV8TKwH7IvKsy_XywvnA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10818589/akrales180510_2565_0044.jpg", "publishedAt": "2019-03-20T16:00:37Z", "content": "Researchers have discovered a critical vulnerability in Googles Chromium browser that could be used to steal personal data. Positive Technologies researcher Sergey Toshin uncovered the bug last December and disclosed it to Google in January, which patched the… [+1413 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Angela Chen", "title": "Judge temporarily blocks drilling on 300,000 acres in Wyoming, citing climate change", "description": "A federal judge has temporarily blocked new drilling on 300,000 acres of land in Wyoming after ruling that the US Department of the Interior “did not sufficiently consider climate change” when allowing oil and gas companies to lease federal land in the state.", "url": "https://www.theverge.com/2019/3/20/18274237/wyoming-drilling-oil-gas-public-lands-department-interior-ruling-climate-change-environment", "urlToImage": "https://cdn.vox-cdn.com/thumbor/H33kjRMrxB74Kr0MmlRrgo5PzWQ=/0x73:640x408/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14317285/rocksprings.1419979502.jpg", "publishedAt": "2019-03-20T15:43:38Z", "content": "A federal judge has temporarily blocked new drilling on 300,000 acres of land in Wyoming after ruling that the US Department of the Interior “ did not sufficiently consider climate change ” when allowing oil and gas companies to lease federal land in the stat… [+1861 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Stefan Etienne", "title": "Google Doodles are showing up on the Pixel home screen search bar", "description": "If you like Google Doodles, get ready to start seeing them in more places, beginning with the Pixel home screen launcher. The first Google Doodle to do so marks the first day of spring.", "url": "https://www.theverge.com/2019/3/20/18274143/google-doodle-pixel-home-screen-search-bar-spring", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-BvfcWlWT64EKQkntzRdNTAPayo=/0x2206:1440x2960/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974571/Screenshot_20190320_093957.png", "publishedAt": "2019-03-20T15:13:09Z", "content": "If you noticed a small flower growing out of your Google Pixels search bar on the home screen, thats because Google is bringing its Google Doodles animations on the Google logo for special events to the Pixels home screen search box. Its not the first time Go… [+861 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "The Oculus Rift is out of stock almost everywhere, still shipping ‘while supplies last’", "description": "As Oculus prepares to launch a successor to its original Rift headset, it’s phasing out the first-generation device — which is now almost exclusively available through Oculus’ own store.", "url": "https://www.theverge.com/2019/3/20/18273327/oculus-rift-available-out-of-stock-amazon-bestbuy-newegg", "urlToImage": "https://cdn.vox-cdn.com/thumbor/x984V_H8lvxmIoIQMDYoUmQS-Ag=/0x78:2500x1387/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6250789/jbareham_160322_0986_0225_fin.0.png", "publishedAt": "2019-03-20T15:04:02Z", "content": "Oculus announced a new VR headset called the Oculus Rift S this morning, and although we dont know when it will launch, all signs point to the original Rift getting phased out very quickly. The Oculus Rift is currently out of stock just about everywhere excep… [+1672 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Oculus unveils the Rift S, a higher-resolution VR headset with built-in tracking", "description": "Oculus VR unveiled its next-generation Rift headset, a higher-resolution pair of virtual reality goggles that remove the need for external cameras by incorporating built-in tracking. The name of the device, as rumored by numerous reports over the last 12 mont…", "url": "https://www.theverge.com/2019/3/20/18273152/oculus-rift-s-vr-headset-announced-pricing-release-date-features-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vY81ndIs7sms44k2BG2Brwk_7Js=/0x21:2040x1089/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972842/nstatt_190318_3307_9382.jpg", "publishedAt": "2019-03-20T15:00:00Z", "content": "Oculus VR unveiled its next-generation Rift headset today, a higher-resolution pair of virtual reality goggles that remove the need for external cameras by incorporating built-in tracking. The name of the device, as rumored by numerous reports over the last 1… [+6844 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dan Seifert", "title": "HP’s latest Spectre x360 is an excellent laptop with one major flaw", "description": "Yes, it’s the trackpad again.", "url": "https://www.theverge.com/2019/3/20/18274004/hp-spectre-x360-13-2018-review-price-specs-features", "urlToImage": "https://cdn.vox-cdn.com/thumbor/qkuCqttCpQ8pb8gYxvR3PudzmP8=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15962310/akrales_190314_3270_0004.jpg", "publishedAt": "2019-03-20T14:09:07Z", "content": "It wasnt that long ago when the idea of a good laptop from HP was little more than a pipe dream. The company has come a long way from the ugly, plasticky designs of a few years ago, and its Spectre line of high-end Windows laptops have been on my shortlist of… [+8102 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Google’s next Doodle uses AI to generate music in the style of Johann Sebastian Bach", "description": "Google’s next Doodle celebrates the birthday of 18th century composer Johann Sebastian Bach. It uses machine learning to analyze Bach’s compositions, then it generates new harmonies that match the melodies that users input.", "url": "https://www.theverge.com/2019/3/20/18274077/google-doodle-johann-sebastian-bach-birthday-ai-machine-learning", "urlToImage": "https://cdn.vox-cdn.com/thumbor/k1a2wQUVklGmdVmp4_mIPuNfJ2A=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974467/box.png", "publishedAt": "2019-03-20T14:01:01Z", "content": "Googles Doodles are often elaborate creations, but the upcoming Doodle to celebrate the birthday of composer Johann Sebastian Bach is positively baroque. \r\nWith the help of artificial intelligence, the interactive Doodle allows users to generate harmonies for… [+1529 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dieter Bohn", "title": "Samsung Galaxy S10 vs. Pixel 3: how do you choose?", "description": "A look at the pros and cons of the Samsung Galaxy S10 and Google’s Pixel 3. It’s a matter of what you care more about. If you want nicer hardware and more configurable software, go with the S10. If you care more about picture quality and software updates, get…", "url": "https://www.theverge.com/2019/3/20/18273427/samsung-galaxy-s10-vs-pixel-3-software-hardware-camera", "urlToImage": "https://cdn.vox-cdn.com/thumbor/CyHcnwkwWgE2qWnK0YwWdCqHQh4=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15954474/akrales_190307_3272_0020.jpg", "publishedAt": "2019-03-20T14:00:00Z", "content": "I bought a Samsung Galaxy S10 — the one that sits in between the Galaxy S10 Plus and the Galaxy S10E — and what Dan Seifert wrote in his review is absolutely true: it is the awkward middle child in this family. The Galaxy S10 Plus has a more impressive screen… [+3177 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Here’s the first trailer for Quentin Tarantino’s Once Upon a Time in Hollywood", "description": "Sony Pictures has released the first trailer for Quentin Tarantino’s Once Upon a Time in Hollywood, set in in LA during the Manson murders. The film will hit theaters on July 26th, 2019", "url": "https://www.theverge.com/2019/3/20/18274068/quentin-tarantino-once-upon-a-time-in-hollywood-brad-pitt-leonardo-dicaprio-first-trailer-watch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/aPF0GGW9R1ItMyHq5Z2ys82sKrQ=/379x0:1920x807/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974471/Screen_Shot_2019_03_20_at_9.12.37_AM.png", "publishedAt": "2019-03-20T13:43:55Z", "content": "Quentin Tarantino’s cinematic repertoire is loaded with meta references from Hollywood’s history, with films like The Hateful Eight, Kill Bill, and Pulp Fiction paying homage to the movies that came before them. For his next film, the director is going straig… [+506 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "New York City is finally getting its own self-driving shuttle service", "description": "Autonomous vehicles are finally coming to the Big Apple. Optimus Ride, a Boston-based self-driving startup, announced plans to deploy an autonomous shuttle service in New York City in the second quarter of 2019. The company also plans to provide ride-hailing …", "url": "https://www.theverge.com/2019/3/20/18272941/optimus-ride-nyc-av-shuttle-brooklyn-navy-yards", "urlToImage": "https://cdn.vox-cdn.com/thumbor/OyTpMzEWB4BHwxptDckdXyiwDSo=/490x0:1636x600/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972753/Optimus_Ride_Vehicle_Lineup_Contact_Us_Black__1_.jpg", "publishedAt": "2019-03-20T13:30:00Z", "content": "Autonomous vehicles are finally coming to the Big Apple. Optimus Ride, a Boston-based self-driving startup, announced plans to deploy an autonomous shuttle service in New York City in the second quarter of 2019. The company also plans on providing ride-hailin… [+4348 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "The first trailer for Stranger Things 3 teases a terrifying Independence Day", "description": "The third season of Stranger Things is due to be released on July 4th, and Netflix has just released its first trailer. Independence Day plays a significant role in the trailer as the gang attends celebrations at a fairground.", "url": "https://www.theverge.com/2019/3/20/18274041/stranger-things-netflix-season-3-first-trailer-watch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/aYB0C7d914i6d9vSVknqEgmnTbs=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974419/naom_5c2c762def730.jpg", "publishedAt": "2019-03-20T13:11:31Z", "content": "The eight-episode third season of Stranger Things is due to be released on July 4th, and Netflix just released its first trailer. Given that holiday release date, Hawkins, Indiana’s Independence Day celebrations are featured prominently in the trailer as the … [+502 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Google’s Stadia looks like an early beta of the future of gaming", "description": "Google unveiled its new Stadia cloud gaming service at the Game Developers Conference in San Francisco. It streams games to a cloud browser on a phone, tablet, PC, or TV, and there’s no need to download or install them. Google isn’t saying how much the servic…", "url": "https://www.theverge.com/2019/3/20/18273977/google-stadia-cloud-game-streaming-service-report", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Se-Nf7J8rssId0IRiWhjVmV0qVg=/0x12:600x326/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974346/Stadia_03_19_19.jpg", "publishedAt": "2019-03-20T13:08:07Z", "content": "The future of gaming is not a box, according to Google. Its a place. Just like how humans have built stadiums for sports over hundreds of years, Google believes its building a virtual stadium, aptly dubbed Stadia, for the future of games to be played anywhere… [+10197 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Amazon’s entry-level Kindle gets a light and a higher price tag", "description": "Amazon is announcing an update to its entry level Kindle (you know, the one that’s just called “Kindle” without any cool subtitles), adding a feature that has long become standard across the rest of the company’s e-reader line: a built-in light. But you shoul…", "url": "https://www.theverge.com/circuitbreaker/2019/3/20/18271559/amazon-kindle-entry-level-light-price-raise-ereader-books", "urlToImage": "https://cdn.vox-cdn.com/thumbor/y5bL9EqEOI1Em4jNWUEXt1liuuM=/0x269:3750x2232/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15973131/All_new_Kindle_cafe.jpg", "publishedAt": "2019-03-20T13:01:11Z", "content": "Amazon is announcing an update to its entry-level Kindle (you know, the one thats just called Kindle without any cool subtitles), adding a feature that has long become standard across the rest of the companys e-reader line: a built-in light. \r\nUnfortunately, … [+1405 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Stefan Etienne", "title": "How to control your Philips Hue lights with the Google Home app", "description": "If you’re a proud owner of Philips Hue lights and a Google Home, then you should know that a recent update made it possible to control the color of your Hue lights from the Home app. Here’s how.", "url": "https://www.theverge.com/2019/3/20/18267509/how-to-control-philips-hue-lights-google-home-app", "urlToImage": "https://cdn.vox-cdn.com/thumbor/6cQ12mweS9-KMyXZEEK-OrW4JPs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972082/setienne_190211_3305_0180.jpg", "publishedAt": "2019-03-20T13:00:00Z", "content": "If youve equipped your home with Philips Hue color-changing lights and a Google Home smart speaker (or some other Assistant-equipped device), then you know that its possible to control the color of your lights from the Home app. Google added the feature to th… [+2689 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "How Apple makes billions of dollars selling services", "description": "Apple doesn’t break down how much money individual services make. But we do know what businesses the segment is composed of, how much they charge, and whether they’re any good. With the services business entering a new era, here’s an overview of where it stan…", "url": "https://www.theverge.com/2019/3/20/18273179/apple-icloud-itunes-app-store-music-services-businesses", "urlToImage": "https://cdn.vox-cdn.com/thumbor/XH9IO5InW72pomaPKJsCesJ9XE8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15973036/acastro_190319_1777_apple_services_0001.0.jpg", "publishedAt": "2019-03-20T13:00:00Z", "content": "Apples focus is shifting. In recent years, iPhone sales have begun to plateau, and now Apples services business which encompasses everything from the App Store to licensing deals is being positioned as its next big frontier for revenue growth. More than ever,… [+11304 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Apple announces second-gen AirPods with wireless charging case and hands-free Siri", "description": "Apple’s week of surprise product launches continues with the announcements of an updated, second-generation of AirPods that will include a wireless charging case and a new H1 chip that the company claims offers improved battery life and “Hey, Siri” support to…", "url": "https://www.theverge.com/2019/3/20/18274040/apple-second-gen-airpods-wireless-charging-case-siri-h1", "urlToImage": "https://cdn.vox-cdn.com/thumbor/NoIznp7me1GM8RD4WrdZNXb1X54=/0x187:2370x1428/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15974411/Screen_Shot_2019_03_20_at_8.33.45_AM.png", "publishedAt": "2019-03-20T12:35:31Z", "content": "Apple’s week of surprise product launches continues with the announcement of the second-generation AirPods, which will include a wireless charging case and a new H1 chip that the company claims offers improved battery life and “Hey, Siri” support to trigger t… [+60 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Kaspersky Lab files antitrust complaint over iOS Screen Time", "description": "Kaspersky Lab has filed an antitrust complaint after Apple told the firm its screen time management app was in violation of its App Store policies. Kaspersky Lab claims that Apple only raised an objection to Kaspersky’s Safe Kids app after the launch of iOS 1…", "url": "https://www.theverge.com/2019/3/20/18273997/kaspersky-lab-app-apole-antitrust-complaint-screen-time-safe-kids", "urlToImage": "https://cdn.vox-cdn.com/thumbor/7_pKCPB7h5Zdle4eubnaw02EVDA=/0x116:1020x650/fit-in/1200x630/cdn.vox-cdn.com/assets/841918/kaspersky-lab.jpg", "publishedAt": "2019-03-20T12:15:38Z", "content": "The cybersecurity firm Kaspersky Lab has filed an antitrust complaint after Apple told the firm its screen time management app was in violation of App Store policies. In a blog post that was first spotted by 9to5Mac, Kaspersky Lab claims that Apple only raise… [+1480 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Microsoft’s Xbox boss responds to Google Stadia, promises ‘we will go big’ for E3", "description": "Microsoft has responded to Google’s new Stadia cloud gaming service. In an internal memo, Microsoft’s gaming chief, Phil Spencer, says he feels validated by Google’s work and promises a big E3", "url": "https://www.theverge.com/2019/3/20/18273991/google-stadia-microsoft-xbox-phil-spencer-response-comments", "urlToImage": "https://cdn.vox-cdn.com/thumbor/JgztdWCDl_lD1wYKK-ziCvbXPEk=/0x230:3200x1905/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/4117184/philspencer2.0.jpg", "publishedAt": "2019-03-20T11:55:05Z", "content": "Google unveiled its new Stadia cloud gaming service yesterday, and Microsoft was watching closely. In an internal memo to the Xbox team, Microsofts head of gaming, Phil Spencer, responded to Googles announcements by promising a big E3. Google went big today a… [+2098 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Google hit with €1.5 billion antitrust fine by EU", "description": "Google has been hit with another major antitrust fine from the European Union. The fine was related to the company’s AdSense business, which, from 2006, restricted how customers could integrate rival search engines into their sites.", "url": "https://www.theverge.com/2019/3/20/18270891/google-eu-antitrust-fine-adsense-advertising", "urlToImage": "https://cdn.vox-cdn.com/thumbor/HNPaWHizBMbmrxunsXiSQGEuFec=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11742007/acastro_1800724_1777_EU_0001.jpg", "publishedAt": "2019-03-20T11:11:17Z", "content": "Google has been hit with a 1.5 billion antitrust fine from the European Union over restrictive contracts it forced on customers through its AdSense business. \r\nIna press conference this morning, EU antitrust commissioner Margrethe Vestager said the tech giant… [+2137 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "MoviePass brings back unlimited plan with heavy caveats", "description": "Less than four months after it announced its last set of cinema subscription changes, MoviePass is shaking up its pricing model once again and is reintroducing its unlimited plan. MoviePass Uncapped offers you an unlimited number of movie screenings each mont…", "url": "https://www.theverge.com/2019/3/20/18273941/moviepass-uncapped-price-film-screenings-movies-restrictions", "urlToImage": "https://cdn.vox-cdn.com/thumbor/yr-JaWDqdq813TfZi7h5pAM9jGk=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10212729/vpavic_180125_2283_0013.jpg", "publishedAt": "2019-03-20T10:04:30Z", "content": "Less than four months after it announced its last set of cinema subscription changes, MoviePass is shaking up its pricing model once again and is reintroducing its unlimited plan. TechCrunch notes that MoviePass Uncapped, as the plan is now called, offers you… [+2482 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sam Byford", "title": "Google will give Android users a choice of browser and search engine in Europe", "description": "Google has announced that it will start asking European Android users which browser and search engine they would prefer to use on their devices. Last year Google was fined a record $5 billion by EU regulators for violating antitrust laws and was ordered to st…", "url": "https://www.theverge.com/2019/3/20/18273888/google-eu-browser-search-choice", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-JJq1AeSyNyOxZoMOv6-FQQbMeM=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13593177/acastro_181130_1777_google_bias_0001.0.jpg", "publishedAt": "2019-03-20T06:55:52Z", "content": "Google has announced that it will start asking European Android users which browser and search engine they would prefer to use on their devices, following regulatory action against the company for the way it bundles software in its mobile operating system. La… [+1387 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Disney now owns 21st Century Fox, X-Men, and most of Hulu", "description": "The $71 billion acquisition between Disney and Fox has finally closed, bringing two Hollywood powerhouses together. Now, Disney has big plans for Hulu and its film franchises.", "url": "https://www.theverge.com/2019/3/20/18273142/disney-fox-acquistion-final-hulu-marvel-streaming-21st-century", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ATi8PWdqMgJAtmB3oTeNTeUNJgA=/0x93:4256x2321/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15973173/181745064.jpg.jpg", "publishedAt": "2019-03-20T04:02:00Z", "content": "After more than a year of working to get final approval, Disney’s lengthy process of acquiring 21st Century Fox is finally done. The merger went through at 12:02 am ET, giving Disney full control over a number of 21st Century Fox entities including the compan… [+3810 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "The Google Stadia game controller feels surprisingly great", "description": "Google today took the wraps off its Stadia cloud gaming platform. We still don’t know a lot about how it will work, but we did get our hands on the custom controller Google built. Surprisingly, the Stadia controller feels and looks great.", "url": "https://www.theverge.com/circuitbreaker/2019/3/19/18273461/google-stadia-cloud-gaming-service-controller-hands-on-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/gpLQExh2dpcJ6c8D3lyyJjdXHQY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15973530/B88A6413.jpg", "publishedAt": "2019-03-20T00:28:55Z", "content": "Photo by Vjeran Pavic / The Verge Google today took the wraps off its Stadia cloud gaming platform, showing off a bold but largely untested vision of the future of gaming that involves distributing and playing software in real-time over the internet. We still… [+3301 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Bijan Stephen", "title": "Kickstarter’s CEO, Perry Chen, is resigning", "description": "Chen has been with the company since its beginning, and served as CEO for its first five years. He stepped down for the first time in 2014, leaving the role to co-founder Yancey Strickler, and returned in 2017 after Strickler decided to leave the company.", "url": "https://www.theverge.com/2019/3/19/18273318/kickstarter-ceo-resigning-perry-chen-chairman-board", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YEsYh2xxXdEKmUlHW6Xe-mSGnuc=/0x292:2039x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948468/akrales_190308_3280_0020.0.jpg", "publishedAt": "2019-03-19T21:47:12Z", "content": "Kickstarter CEO and co-founder Perry Chen has resigned from his role as chief executive of the company. Chen wrote in a blog post today that he will remain chairman of Kickstarter’s board, and that he intends to focus on “high-level and long-term company need… [+1078 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "The UE Boom 3 and MegaBoom 3 speakers are cheaper than ever at Amazon", "description": "You can save $30 on Ultimate Ears’ latest Bluetooth speakers, the UE Boom 3 and UE MegaBoom 3. Both feature better sound and an improved design over the UE Boom 2, and you can find both at their lowest prices yet.", "url": "https://www.theverge.com/good-deals/2019/3/19/18273276/ue-boom-megaboom-3-speakers-amazon-sale-discount-deal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/hFa-guHOnFuJgle57irtMuna5EY=/0x290:2040x1358/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13123809/vpavic_180918_2955_0003.jpg", "publishedAt": "2019-03-19T21:22:43Z", "content": "Only the best deals on Verge-approved gadgets get the Good Deals stamp of approval, so if you're looking for a deal on your next gadget or gift from major retailers like Amazon, Walmart, Best Buy, Target, and more, this is the place to be.\r\nThe UE Boom 3 is $… [+1378 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "Facebook, YouTube, and others asked to brief Congress on New Zealand shooting response", "description": "Rep. Bennie G. Thompson (D-MS) wrote a letter to Facebook CEO Mark Zuckerberg, YouTube CEO Susan Wojcicki, Twitter CEO Jack Dorsey, and Microsoft CEO Satya Nadella, urging them to prioritize the removal of the terrorist content and to brief the House Homeland…", "url": "https://www.theverge.com/2019/3/19/18273257/facebook-youtube-microsoft-twitter-congress-zealand-shooting-response", "urlToImage": "https://cdn.vox-cdn.com/thumbor/a-qoEN1ai_V3-VszuaXuqCOCyJw=/0x200:3000x1771/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15973141/98890886.jpg.jpg", "publishedAt": "2019-03-19T20:57:28Z", "content": "Chairman of the House Homeland Security Committee, Rep. Bennie G. Thompson (D-MS), penned letters today to tech executives from companies like Facebook and YouTube requesting a briefing on March 27th regarding their response to the New Zealand shooter’s live … [+2090 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dani Deahl", "title": "Peloton is being sued for using music without permission in its video fitness classes", "description": "Several members of the National Music Publishers Association (NMPA) have collectively filed a lawsuit against fitness startup Peloton today, seeking over $150 million in damages. The complaint says that Peloton has been using their musical works for years in …", "url": "https://www.theverge.com/2019/3/19/18273063/peloton-music-lawsuit-licensing-video-fitness-classes-nmpa", "urlToImage": "https://cdn.vox-cdn.com/thumbor/UEnaYwm-bv15ns_Gdm2__dWeQrk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8399093/akrales_170407_1569_0468.0.jpg", "publishedAt": "2019-03-19T19:31:53Z", "content": "Several members of the National Music Publishers Association (NMPA) have collectively filed a lawsuit against fitness startup Peloton today, seeking over $150 million in damages. The complaint, filed by Downtown Music Publishing, Ultra Music, and eight other … [+3045 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Uber Eats rolls out confusing new fees — here’s what they mean", "description": "Uber Eats rolled out its new fees structure, and most people are confused about what the new fees mean. Instead of a booking fee for each order, Uber is now splitting up its fee into a delivery and service fee, and adding a small order fee of $2 when your ord…", "url": "https://www.theverge.com/2019/3/19/18272791/uber-eats-new-booking-delivery-service-fees-confusion-meaning", "urlToImage": "https://cdn.vox-cdn.com/thumbor/dgpJqdHSagfcS1GOKjN70mlVWc4=/0x380:5302x3156/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13300243/919042992.jpg.jpg", "publishedAt": "2019-03-19T19:09:25Z", "content": "Uber Eats rolled out its new fees structure this week, and most people are confused about what the new fees mean. Instead of a booking fee for each order, Uber is now splitting up its fee into a delivery and service fee, and adding a small order fee of $2 whe… [+6898 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Zachary Mack", "title": "Facebook’s former chief security officer on how to protect content moderators", "description": "Former Facebook chief security officer Alex Stamos and Casey Newton discuss protecting content moderators and the difficult issues that plague Facebook and democracy.", "url": "https://www.theverge.com/2019/3/19/18272978/facebook-alex-stamos-chief-security-officer-content-moderators-democracy-vergecast", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vDg3OJWp-RyNvO_x0GEjO20BziY=/0x13:1100x589/fit-in/1200x630/cdn.vox-cdn.com/assets/921394/facebook.jpg", "publishedAt": "2019-03-19T19:01:40Z", "content": "Facebook’s former chief security officer Alex Stamos joined The Verge ’s Casey Newton onstage at SXSW to discuss the difficult issues that plague Facebook and democracy. You can listen to their discussion in its entirety on The Vergecast right now. Below is a… [+3074 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dani Deahl", "title": "Pandora now lets you change its algorithm for selecting music", "description": "Pandora is giving listeners more control over what songs their customized radio stations play with a new feature called Pandora Modes.", "url": "https://www.theverge.com/2019/3/19/18272808/pandora-modes-algorithm-music-selection-radio", "urlToImage": "https://cdn.vox-cdn.com/thumbor/H-JWR5TAzzCrzdTDE5lIusiwZs8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9020347/akrales_170802_1743_0194.jpg", "publishedAt": "2019-03-19T18:59:47Z", "content": "Pandora is giving listeners more control over what songs their customized radio stations play with a new feature called Pandora Modes. Pandora’s classic algorithm has long chosen what plays when you start up a new artist station, but these alternative modes l… [+1246 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Loren Grush", "title": "NASA spacecraft discovers its target asteroid is spewing material and is much more rugged than expected", "description": "NASA’s OSIRIS-REx spacecraft made an astonishing discovery about the asteroid it has been orbiting since December: the rock is actively spewing material out into space. The asteroid, named Bennu, has erupted materials up to 11 times since the spacecraft has b…", "url": "https://www.theverge.com/2019/3/19/18271503/nasa-asteroid-bennu-osiris-rex-spacecraft-boulders-geysers", "urlToImage": "https://cdn.vox-cdn.com/thumbor/QfJVtPjCldqS9GWAxYL8neK6et8=/0x117:1024x653/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972703/3_Lauretta_Bennu_Particle_Jets_print.jpg", "publishedAt": "2019-03-19T18:58:48Z", "content": "NASA’s OSIRIS-REx spacecraft made an astonishing discovery about the asteroid it has been orbiting since December: the rock is actively spewing material out into space. The asteroid, named Bennu, has ejected materials up to 11 times since the spacecraft has b… [+7297 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Colin Lecher", "title": "Facebook drops targeting options for housing, job, and credit ads after controversy", "description": "The company is also building a tool to view housing ads", "url": "https://www.theverge.com/2019/3/19/18273018/facebook-housing-ads-jobs-discrimination-settlement", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mRsbBEAHbrYY0kVnjEEyueKxHno=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10595581/jbareham_180405_1777_facebook_0003.jpg", "publishedAt": "2019-03-19T18:44:42Z", "content": "As part of a legal settlement with civil rights groups, Facebook said today that it will end some targeting options for potentially discriminatory advertisements.\r\nThe company said anyone placing housing, job, or credit ads will not be able to target users by… [+1295 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Google Stadia: the latest updates on the cloud gaming platform", "description": "Google announced Stadia, its new cloud gaming platform, at GDC 2019. As we learn more about Stadia, including how much it will cost, how you’ll be able to buy games, and when you can expect to play, you’ll find the latest developments here.", "url": "https://www.theverge.com/games/2019/3/19/18273011/google-stadia-latest-updates-cloud-gaming-platform", "urlToImage": "https://cdn.vox-cdn.com/thumbor/blmvsUIt0i0QWX0N-s691QhdHxs=/0x106:1475x878/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972837/stadia.jpg", "publishedAt": "2019-03-19T18:35:42Z", "content": "Google took to the stage at GDC 2019 to announce Stadia, its new gaming platform that is powered by its vast cloud infrastructure. \r\nUnlike traditional consoles, like the Xbox One and PS4 Pro, Stadia doesnt live in a box. Google says that when the service lau… [+773 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Google Stadia uses a custom AMD chip to offer 10.7 teraflops of cloud gaming power", "description": "It turns out that Google’s just-announced Stadia cloud gaming service may have struck a balance between power and price by partnering with AMD for new custom components. According to Google, each Stadia server will contain a custom x86 AMD processor running a…", "url": "https://www.theverge.com/2019/3/19/18272809/google-stadia-specs-amd-teraflops-cloud-gaming", "urlToImage": "https://cdn.vox-cdn.com/thumbor/zjoUVxmVIkAsjgMghnPv6XLLyZI=/0x45:1885x1032/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972691/google_gaming_announce_gdc_12.jpg", "publishedAt": "2019-03-19T18:28:13Z", "content": "The beauty of a cloud gaming service is two-fold: 1) you can theoretically play any game, anywhere where you’ve got a good enough internet connection to stream it over the net, and 2) even if you’re playing it on a wimpy smartphone, you can harness the power … [+3333 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Google created its own studio for Stadia-exclusive games", "description": "At its GDC 2019 keynote, Google announced Stadia Games and Entertainment, a new first-party games studio that will be creating exclusive games for the new platform, led by former EA and Ubisoft executive and producer Jade Raymond.", "url": "https://www.theverge.com/2019/3/19/18272996/google-stadia-studio-games-entertainment-exclusives-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/WdWc_yUtW9s_M3OOYHXwHaceXhI=/0x17:1038x560/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972780/2Bn6gUz.png", "publishedAt": "2019-03-19T18:04:14Z", "content": "Google isn’t just launching a new gaming platform with its just-announced streaming service Stadia : it’s also becoming a game developer. At its GDC 2019 keynote, Google announced Stadia Games and Entertainment, a new first-party games studio that will be cre… [+409 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Bijan Stephen", "title": "Kickstarter’s staff is unionizing", "description": "If recognized, Kickstarter would be the first major tech company with union representation in the United States. Members of the union, which goes by Kickstarter United, say they want to improve inclusivity and transparency at the company. To unionize, they’re…", "url": "https://www.theverge.com/2019/3/19/18254995/kickstarter-unionizing-union-representation-inclusivity-transparency-tech-us-crowdfunding", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lrpTe7SGYrYNu-xFvYFJOyq18YA=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948469/akrales_190308_3280_0018.0.jpg", "publishedAt": "2019-03-19T18:00:00Z", "content": "The staff of Kickstarter announced plans to unionize today. If recognized, Kickstarter would be the first major tech company with union representation in the United States.\r\nMembers of the union, which goes by Kickstarter United, say they want to improve incl… [+3561 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Megan Farokhmanesh", "title": "Doom Eternal is coming to Google’s cloud gaming service, Stadia", "description": "Google unveiled its “vision for the future of gaming” today, a cloud gaming service called Stadia. First up among games for the service will be id Software’s upcoming first-person shooter Doom...", "url": "https://www.theverge.com/2019/3/19/18272797/google-stadia-doom-eternal-games-cloud-service-announcement-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vBGgHhCrWzHgFfLMMUrC1Z_Id6w=/0x543:5000x3161/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11960195/DOOM_Eternal_3D_Logo_jpg_1528291689.jpg", "publishedAt": "2019-03-19T17:38:28Z", "content": "Google unveiled its vision for the future of gaming today, a cloud gaming service called Stadia. First up among games for the service will be id Softwares upcoming first-person shooter Doom Eternal. The game will run at 4K resolution with HDR color at 60FPS.\r… [+257 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Here is Google’s controller for its Stadia game streaming service", "description": "At GDC 2019 in San Francisco, Google not only unveiled its long-awaited cloud gaming platform called Stadia, it also showed off a new kind of gamepad designed to support the streaming service.", "url": "https://www.theverge.com/2019/3/19/18272205/google-stadia-game-controller-gamepad-features-cloud-service-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/TJxyj7294DjXrL_tSnA6l2tWScs=/0x27:2330x1247/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972650/Screen_Shot_2019_03_20_at_2.22.49.png", "publishedAt": "2019-03-19T17:20:21Z", "content": "Earlier this month, a patent surfaced that revealed a possible design for a forthcoming Google game controller. Now that Google has officially unveiled its long-expected cloud gaming service, called Stadia, we can finally get a look at what the gamepad actual… [+610 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Google unveils Stadia cloud gaming service", "description": "Google has unveiled its Stadia cloud gaming service at the Game Developers Conference in San Francisco. It’s a game stream service that will instantly stream titles to PCs, laptops, tablets, TVs, and phones", "url": "https://www.theverge.com/2019/3/19/18271702/google-stadia-cloud-gaming-service-announcement-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/WUGi4wkyfIZ2hbqudMVRk04hrOk=/0x30:1622x879/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972607/Screen_Shot_2019_03_19_at_1.12.34_PM.png", "publishedAt": "2019-03-19T17:13:43Z", "content": "Google is launching its Stadia cloud gaming service at the Game Developers Conference (GDC) in San Francisco. Google CEO Sundar Pichai, who says he plays FIFA 19 quite a bit, introduced the Stadia service during a special keynote at GDC this morning. Describi… [+2022 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Apple might update the iPod touch tomorrow", "description": "Apple’s last iPod, the iPod touch, may get a hardware refresh tomorrow. Following the announcement of the new iPad Air and iPad mini, this portable music player could get a big processor boost, among other changes.", "url": "https://www.theverge.com/2019/3/19/18272772/apple-ipod-touch-update-hardware-2019-rumor", "urlToImage": "https://cdn.vox-cdn.com/thumbor/hf5HsldKH2-KQ1kvrzZRcii-kwc=/0x0:2500x1309/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13077251/gold-new-ipod-touch-0056.0.0.1437077456.jpg", "publishedAt": "2019-03-19T17:12:22Z", "content": "Apple has already announced a few product refreshes this week, but it might not be done just yet. The iPod touch may be the next device to get a hardware update, and according to MacRumors, the seventh-generation model may be announced tomorrow via a press re… [+1357 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "YouTube creators are trying to move on from ‘subscribe to PewDiePie’", "description": "The YouTube community is left reeling after a devastating attack in New Zealand left nearly 50 people dead. The shooter referenced a popular PewDiePie meme, leading creators to ask what happens next.", "url": "https://www.theverge.com/2019/3/19/18270905/subscribe-to-pewdiepie-youtube-new-zealand-attack-meme", "urlToImage": "https://cdn.vox-cdn.com/thumbor/CZvy65hwX9qS7htUpG_WrouYCsw=/20x0:1670x864/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972328/Screen_Shot_2019_03_19_at_11.57.21_AM.png", "publishedAt": "2019-03-19T16:19:21Z", "content": "About 12 hours before a gunman told people watching his live stream to “subscribe to PewDiePie” before killing 50 people in New Zealand, popular sketch comedy creator and podcaster Ethan Klein posted a video called “Subscribe to PewDiePie for revenge.” Klein’… [+6270 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "Patreon launches ‘Pro’ and ‘Premium’ tiers to compete with Facebook and YouTube", "description": "Crowdfunding service Patreon is splitting its core service into “Lite,” “Pro,” and “Premium” tiers to serve a widely divergent base of users and make the platform sustainable.", "url": "https://www.theverge.com/2019/3/19/18272636/patreon-service-tiers-lite-pro-premium-jack-conte-platform-sustainable", "urlToImage": "https://cdn.vox-cdn.com/thumbor/5pjyeELxqGDVg5wgrXjV1yVIi6Y=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8985115/Patreon_frame_01.jpg", "publishedAt": "2019-03-19T16:02:13Z", "content": "Patreon is how thousands of artists, vloggers, musicians, podcasters, and other creators make their living. The six-year-old startup currently supports more than 100,000 creators, who receive recurring donations from over 3 million supporters, and it has beco… [+10141 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "YouTube terminates channel dedicated to circumventing Alex Jones ban", "description": "YouTube has terminated a channel known as Resistance News for helping to circumvent Alex Jones’ Infowars ban. The channel had more than 64,000 subscribers.", "url": "https://www.theverge.com/2019/3/19/18272690/alex-jones-youtube-ban-info-wars-resistance-news", "urlToImage": "https://cdn.vox-cdn.com/thumbor/EwEOWD0cVJJgvmXr1nyfW5_jwuo=/0x109:6720x3627/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12862215/1027117806.jpg.jpg", "publishedAt": "2019-03-19T15:55:19Z", "content": "YouTube has terminated an account that was seemingly operating as a secondary channel for Alex Jones and Infowars after its first one was banned last August. A statement from YouTube confirmed that the channel, Resistance News, was banned for aiding in Jones’… [+1616 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "Democratic leader calls on FTC to investigate Facebook’s market power", "description": "Rep. David Cicilline (D-RI) claims that “there is a smoking gun” that Facebook has repeatedly violated antitrust law. He cites its plans to merge the underlying infrastructure of its messaging products like Messenger, Instagram, and WhatsApp and its decision …", "url": "https://www.theverge.com/2019/3/19/18272605/facebook-ftc-investigation-congress-republican-david-cicilline", "urlToImage": "https://cdn.vox-cdn.com/thumbor/LgMNMmOzSVYU2y6U-6r-IdDr_oo=/0x321:4480x2667/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972091/997227414.jpg.jpg", "publishedAt": "2019-03-19T15:37:38Z", "content": "Rep. David Cicilline (D-RI) called on the Federal Trade Commission to open an investigation into Facebook on the grounds of possible violations of anti-monopoly law. Cicilline, who heads the antitrust panel on the House Judiciary Committee, is one of the cent… [+2596 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Nvidia’s latest AI software turns rough doodles into realistic landscapes", "description": "This new prototype software from Nvidia uses machine learning to turn rough doodles into realistic landscapes in seconds, and it could be used by everyone from game developers to landscape designers.", "url": "https://www.theverge.com/2019/3/19/18272602/ai-art-generation-gan-nvidia-doodle-landscapes", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-KzJWRy0KzQ3MGOL30dCVmHB9BM=/0x87:2852x1580/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15972191/Screen_Shot_2019_03_19_at_3.09.59_PM.png", "publishedAt": "2019-03-19T15:24:13Z", "content": "AI is going to be huge for artists, and the latest demonstration comes from Nvidia, which has built prototype software that turns doodles into realistic landscapes. Using a type of AI model known as a generative adversarial network (GAN), the software gives u… [+506 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Tesla delays price hike because of ‘unusually high volume’ of last-minute orders", "description": "Tesla announced on Wednesday that the planned 3 percent bump won’t happen until the end of the day on Wednesday. Tesla cut prices earlier this year after closing stores and moving to online-only sales, but it quickly reversed course.", "url": "https://www.theverge.com/2019/3/19/18272586/tesla-price-hike-delay-orders-high-volume-last-minute", "urlToImage": "https://cdn.vox-cdn.com/thumbor/t2Ps69Tyhxfh4BInPd1fUJG7EOM=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15963753/tesla_model_y_3605.jpg", "publishedAt": "2019-03-19T15:17:46Z", "content": "Tesla has delayed a planned 3 percent price hike on all of its cars until midnight on Wednesday because it had trouble processing a rush of last-minute orders, the company claimed on Twitter on Tuesday morning. \r\nDue to unusually high volume, Tesla was unable… [+1633 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "Moleskine’s new smart notebook vectorizes lines in Adobe Illustrator in real time", "description": "Moleskine’s Creative Cloud Paper Tablet is a smart notebook that uses the Pen+ Ellipse to vectorize lines in Adobe Illustrator. Pen strokes are captured in real time where they can be further edited on the desktop.", "url": "https://www.theverge.com/2019/3/19/18267593/moleskine-paper-tablet-adobe-creative-cloud-connected-illustrator", "urlToImage": "https://cdn.vox-cdn.com/thumbor/6xpFGwVY89RPWeDosfKrKLNFKCY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969718/jbareham_190315_3295_0012.jpg", "publishedAt": "2019-03-19T15:00:00Z", "content": "Adobe and Moleskine have teamed up again to launch the Creative Cloud Connected Moleskine Paper Tablet, which turns hand-drawn sketches into vectors in Illustrator in real time. The Creative Cloud notebook is the latest addition to Moleskine’s Smart Writing S… [+507 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "New iPad Air and iPad mini are $25 off, and TCL’s 65-inch 4K Roku TV is cheaper than ever", "description": "To kick off March Madness, the 65-inch TCL 6-series 4K HDR Roku TV is at its most affordable price yet. If you want the new iPad Air or iPad mini, Best Buy is offering $25 off preorders. Xbox One controllers are discounted as well.", "url": "https://www.theverge.com/good-deals/2019/3/19/18272504/ipad-air-mini-tcl-65-inch-4k-roku-tv-best-buy-march-madness-price-sale-deal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vXJp1seXWj31GIoTcvgT2Dw3ewc=/0x360:2400x1617/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15969230/New_iPad_Air_with_Smart_Keyboard_Apple_Pencil_03192019.jpg", "publishedAt": "2019-03-19T14:59:15Z", "content": "Only the best deals on Verge-approved gadgets get the Good Deals stamp of approval, so if you're looking for a deal on your next gadget or gift from major retailers like Amazon, Walmart, Best Buy, Target, and more, this is the place to be.\r\nThe March Madness … [+1105 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Rachel Becker", "title": "Who’s to blame for the neurotoxin that’s poisoning the Pacific?", "description": "There’s a fight brewing in the Pacific about toxic algae, climate change, and crabs. It has the commercial crab industry squaring off against Big Oil. To understand why, Verge Science got on a boat at the crack of dawn to retrieve a string of crab pots with a…", "url": "https://www.theverge.com/2019/3/19/18271856/crabs-domoic-acid-climate-change-big-oil-fossil-fuels-pacific-harmful-algal-bloom", "urlToImage": "https://cdn.vox-cdn.com/thumbor/4QOKi8zRKP6WbtIPecjIL5ZhyZM=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15971021/Container.jpg", "publishedAt": "2019-03-19T14:00:34Z", "content": "Theres a fight brewing in the Pacific about toxic algae, climate change, and crabs. It has the commercial crab industry squaring off against Big Oil. So for our latest Verge Science video, I took some motion-sickness meds and hopped on a boat to find out what… [+2025 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Apple will let you add 256GB of RAM to an iMac Pro for $5,200", "description": "Apple is adding some new configuration options to its iMac Pro today, including a truly absurd 256GB of RAM. It can be added to your computer (which, as a reminder, costs $4,999 to start) for $5,200.", "url": "https://www.theverge.com/circuitbreaker/2019/3/19/18272523/apple-256gb-ram-imac-pro-5200-update-configure-build", "urlToImage": "https://cdn.vox-cdn.com/thumbor/TzciesCd4jP_FXgQpJCtPe1r-iM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9867147/jbareham_171213_2180_0158.jpg", "publishedAt": "2019-03-19T14:00:33Z", "content": "Apple is adding some new configuration options to its iMac Pro today, including a truly absurd 256GB of RAM. It can be added to your computer (which, as a reminder, costs $4,999 to start) for the low, low price of $5,200, as spotted by 9to5Mac.\r\nYou could buy… [+805 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "HP updates Envy laptops with Alexa and webcam privacy switch", "description": "This year, there are four models: the Envy 13 x360 and Envy 15 x360, both of which can flip around into a tablet, and the Envy 13 Laptop and Envy 17 Laptop, which can’t flip around.", "url": "https://www.theverge.com/2019/3/19/18271184/hp-envy-2019-x360-laptop-updates-price-release-dates", "urlToImage": "https://cdn.vox-cdn.com/thumbor/NJiwyWk1doHHlRI3NpqG0zIgYoo=/0x136:1894x1128/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15971982/HP_ENVY_x360_13_NightfallBlack_FrontLeft.jpg", "publishedAt": "2019-03-19T14:00:27Z", "content": "HP is updating its Envy line of laptops with new processors, a webcam privacy switch, and, in some cases, built-in support for Alexa. The Envy series sits one step below HPs top-of-the-line laptops, offering slightly lesser specs for prices that are usually a… [+1768 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "HP’s new Reverb VR headset sports super high resolutions and a lightweight design", "description": "HP’s newest Windows Mixed Reality headset is called the Reverb, and it sports impressive 2160 x 2160 resolution optics, inside-out tracking, and a lightweight design. The device, announced today, will come in two variations: a consumer model for $599 and an e…", "url": "https://www.theverge.com/2019/3/19/18272229/hp-reverb-vr-windows-mixed-reality-headset-price-release-date", "urlToImage": "https://cdn.vox-cdn.com/thumbor/a7h7hCK5Mi6M_tkLcabl6jehbHE=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15971544/hp_reverb_vr_headset_1.jpg", "publishedAt": "2019-03-19T14:00:00Z", "content": "HPs newest Windows Mixed Reality headset is called the Reverb, and it sports impressive 2160 x 2160 resolution optics, inside-out tracking, and a lightweight design. The device, announced today, will come in two variations: a consumer model costing $599 and a… [+1912 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Microsoft Teams gets inventive new conference call features to make Slack users jealous", "description": "Microsoft Teams is turning two years old, and it’s getting a load of new features to rival Slack. Background customization, a new whiteboard feature, real-time captions, and Live Events are on the way. Microsoft also revealed that more than 500,000 organizati…", "url": "https://www.theverge.com/2019/3/19/18272357/microsoft-teams-video-background-customization-whiteboard-live-events-features", "urlToImage": "https://cdn.vox-cdn.com/thumbor/K7S_dLDhWEiSbOT1luPoErAA4ms=/0x179:2502x1489/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7399611/microsoftteamsstock.0.jpg", "publishedAt": "2019-03-19T14:00:00Z", "content": "Microsoft is celebrating the second anniversary of its Microsoft Teams launch with some impressive new features to rival Slack. The software maker now has more than 500,000 organizations using Microsoft Teams, including 91 of the Fortune 100. Thats likely due… [+3150 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Toy Story 4’s latest trailer proves that Pixar wants adults to cry in movie theaters", "description": "Pixar has released a new trailer for Toy Story 4 — purportedly the last Toy Story film, despite the fact that similar things were said for Toy Story 3 — and along with a better look at what the film is actually about, the trailer makes one thing clear: Pixar …", "url": "https://www.theverge.com/2019/3/19/18272463/toy-story-4-trailer-pixar-woody-bo-peep-kids-adults", "urlToImage": "https://cdn.vox-cdn.com/thumbor/AOfuq46OSRMGeuXwPY_RgCjXhEo=/137x0:2322x1144/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15971906/Screen_Shot_2019_03_19_at_9.07.55_AM.png", "publishedAt": "2019-03-19T13:30:03Z", "content": "Pixar has released a new trailer for Toy Story 4 — purportedly the last Toy Story film, despite the fact that similar things were said for Toy Story 3 — and along with a better look at what the film is actually about, the trailer makes one thing clear: Pixar … [+1312 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "JR Raphael", "title": "How to get more space in your Google storage", "description": "A quick round of old-fashioned housekeeping could be enough to clear away the excess stuff on your Google Drive and give yourself ample room to grow.", "url": "https://www.theverge.com/2019/3/19/18271015/google-drive-photos-storage-space-how-to-get-more", "urlToImage": "https://cdn.vox-cdn.com/thumbor/kBHaAPs7oUkSQwEAlWp36eJGCAE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970314/acastro_190318_1777_google_drive_0001.jpg", "publishedAt": "2019-03-19T13:15:00Z", "content": "For many of us, Google storage is the modern-day hard drive. Its the place where our most important thoughts, documents, and memories reside. But just like with a traditional hard drive, the space isnt infinite, and running out of room can be a real problem.\r… [+3087 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Call of Duty: Mobile is a free-to-play tour of the franchise’s greatest hits", "description": "Activision and Tencent have announced Call of Duty: Mobile, a free-to-play version of the first-person shooter that’s coming to iOS and Android later this year. The game is set to offer a greatest hits tour of the franchise’s most popular multiplayer modes an…", "url": "https://www.theverge.com/2019/3/19/18272449/call-of-duty-mobile-release-date-news-features-ios-android", "urlToImage": "https://cdn.vox-cdn.com/thumbor/bbyG60gxpQc2eK1KjMSqfdNqMtA=/0x10:480x261/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15971887/ezgif.com_crop.jpg", "publishedAt": "2019-03-19T13:06:35Z", "content": "Activision and Tencent have announced Call of Duty: Mobile, a free-to-play version of the first-person shooter that’s coming to iOS and Android later this year, via Polygon. The game is set to offer a greatest hits tour of the franchise’s most popular multipl… [+651 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Firefox can now block the web’s autoplaying videos", "description": "The latest version of Firefox lets you block videos that autoplay with sound around the web. The setting can be turned on in Firefox 66 across every website, but you can also set exceptions for sites you visit primarily for video.", "url": "https://www.theverge.com/2019/3/19/18272377/firefox-66-release-date-news-features-autoplaying-videos", "urlToImage": "https://cdn.vox-cdn.com/thumbor/zOlbyNqaWNQAQZHh4ssiA-6O-rk=/0x19:1400x752/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12757717/firefox_mozilla_logo_1.png", "publishedAt": "2019-03-19T13:00:00Z", "content": "The latest version of Firefox lets you block videos that autoplay with sound around the web. The setting can be turned on in Firefox 66 across every website, but you can also set exceptions for sites you visit primarily for video. The latest version of the br… [+1713 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "An exclusive look at an original iPhone prototype", "description": "Apple developed its original iPhone in great secrecy, and The Verge has obtained exclusive access to a prototype developer board. It has all of the original iPhone chips on it, and it was used by engineers to develop the operating system for the phone hardwar…", "url": "https://www.theverge.com/2019/3/19/18263844/apple-iphone-prototype-m68-original-development-board-red", "urlToImage": "https://cdn.vox-cdn.com/thumbor/dL0vsPH5Ur24rN3sYpg71x90unY=/0x185:2040x1253/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15958868/twarren_190308_3283_2280.jpg", "publishedAt": "2019-03-19T13:00:00Z", "content": "This is a day Ive been looking forward to for two and half years, said Steve Jobs, Apples late CEO, as he introduced the original iPhone on January 9th, 2007.\r\nApple had developed the iPhone in secret over those two and a half years, and for many inside the c… [+7290 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "Netgear announces a high-end $599 Wi-Fi 6 router", "description": "Netgear is announcing a new high-end router today with two standout features: it supports Wi-Fi 6, the brand-new Wi-Fi standard, and it’s a tri-band model, meaning it’s capable of delivering much more data at once.", "url": "https://www.theverge.com/circuitbreaker/2019/3/19/18272409/netgear-triband-ax12-wifi-6-router-announced-price", "urlToImage": "https://cdn.vox-cdn.com/thumbor/TtwZDce2SKaacDJnwYD7X5agehA=/0x88:700x454/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15971872/ax12triband.jpg", "publishedAt": "2019-03-19T12:46:41Z", "content": "Netgear is announcing a new high-end router today with two standout features: first, it supports Wi-Fi 6, the brand-new Wi-Fi standard; and second, its a tri-band model, meaning its capable of delivering much more data at once.\r\nTri-band routers have become p… [+1755 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Apple updates iMacs with new Intel processors and AMD GPUs", "description": "Apple has finally refreshed its regular iMac desktops. It’s offering new processors and GPUs for the 21.5-inch and 27-inch models, featuring Intel’s 8th Gen and 9th Gen processors and AMD’s latest Vega Pro GPUs.", "url": "https://www.theverge.com/2019/3/19/18271657/apple-imac-update-intel-processor-amd-gpu", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2R-zvIDNUaklxJOdBu00YsS5oCk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8642933/vpavic_170605_1752_0080.jpg", "publishedAt": "2019-03-19T12:30:00Z", "content": "Apple has finally refreshed its regular iMac desktops, offering new processors and graphics chips for the 21.5-inch and 27-inch models. \r\nThe 21.5-inch iMac now features either an 8th Gen quad-core i3 or six-core i5 processor and either a Radeon Pro 555X GPU … [+2232 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "How Sen. Josh Hawley wants to take on Big Tech", "description": "Sen. Josh Hawley (R-MO) has emerged as a surprising Republican critic of big tech companies like Google and Facebook, urging for stronger privacy rules and a new approach to anti-trust.", "url": "https://www.theverge.com/2019/3/19/18271487/josh-hawley-senator-missouri-republican-facebook-google-antitrust-data-privacy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/hsN-Y_LNWS2oNLUapGrqK206x7M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970840/lvogel_190315_3304_3786.jpg", "publishedAt": "2019-03-19T12:00:47Z", "content": "After years of escalating scandals, Congress is looking for ways to crack down on the size and power of tech companies like Facebook and Google. On the Democratic side, Sen. Elizabeth Warren (D-MA) has taken the lead by calling for new antitrust regulations t… [+12139 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "How to watch Google’s big gaming event at GDC 2019", "description": "At GDC 2019 in San Francisco, Google is holding a keynote to show off its “vision for the future of gaming,” which is expected to include a new cloud gaming service and potentially a Google controller and console.", "url": "https://www.theverge.com/2019/3/19/18271486/google-gdc-watch-live-stream-keynote-game-developers-conference-how-to-time-date", "urlToImage": "https://cdn.vox-cdn.com/thumbor/8prPqvLDLzqWV7wMDohjR2zgctU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10745893/acastro_180427_1777_0003.jpg", "publishedAt": "2019-03-19T12:00:00Z", "content": "Google has some big news for the world of gaming — and it’s coming very soon. Later today, at the Game Developers Conference in San Francisco, the company is holding a keynote where it’s widely expected to reveal its long-rumored cloud gaming platform. Google… [+502 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Casey Newton", "title": "Instagram adds in-app checkout as part of its big push into shopping", "description": "You can now complete a purchase on Instagram by checking out inside the app. Facebook believes it could be a major new business opportunity", "url": "https://www.theverge.com/2019/3/19/18271840/instagram-checkout-shopping-facebook-business", "urlToImage": "https://cdn.vox-cdn.com/thumbor/jcQuVEP7uDIUf1AZ8QidygMlwP8=/0x283:5466x3145/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970918/cZK7t7JA.png", "publishedAt": "2019-03-19T12:00:00Z", "content": "Instagram took its next step to becoming a full-fledged commerce business today, announcing that it is bringing a checkout feature to its mobile apps. With checkout, you can store your payment information with Instagram to make purchases more quickly. In retu… [+1848 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Flexgate is real, and Apple should acknowledge it", "description": "I have a late-2016 MacBook Pro, and, like many people with that generation of laptop, I recently fell victim to the Flexgate display problem. Flexgate refers to a design flaw in the ribbon cable connecting the body of the laptop to the display: that cable is …", "url": "https://www.theverge.com/2019/3/19/18271733/flexgate-display-problem-macbook-pro-apple", "urlToImage": "https://cdn.vox-cdn.com/thumbor/tayr1GiSH0Y_1gdUFz1pz5NcGYE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15953205/flexgate_vladsavov1__1_.jpg", "publishedAt": "2019-03-19T11:45:30Z", "content": "I have a late-2016 MacBook Pro, and, like many people with that generation of laptop, I recently fell victim to the Flexgate display problem. Flexgate refers to a design flaw in the ribbon cable connecting the body of the laptop to the display: that cable is … [+4383 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Facebook says the Christchurch attack live stream was viewed by fewer than 200 people", "description": "Facebook says footage of the Christchurch shooting was viewed just 200 times during its live broadcast, and 4000 times in total before it was removed. The company also says it didn’t receive any reports from users about the shooting live stream until 12 minut…", "url": "https://www.theverge.com/2019/3/19/18272342/facebook-christchurch-terrorist-attack-views-report-takedown", "urlToImage": "https://cdn.vox-cdn.com/thumbor/DBv81ir701jodhnNHHt4lkSZ3xo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948787/acastro_180720_1777_facebook_0001.jpg", "publishedAt": "2019-03-19T10:04:37Z", "content": "Facebook says footage of the Christchurch shooting was viewed just 200 times during its live broadcast, and 4,000 times in total before it was removed. The company also says it didn’t receive any reports from users about the shooting live stream until 12 minu… [+1856 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sam Byford", "title": "Xiaomi announces $65 Redmi Go for India", "description": "Xiaomi has announced the $65 Redmi Go, its first Android Go phone aimed at the Indian market. Specs for the Redmi Go include 1GB of RAM, a Snapdragon 425 processor, and an 8-megapixel camera.", "url": "https://www.theverge.com/circuitbreaker/2019/3/19/18272307/xiaomi-redmi-go-india-price-7", "urlToImage": "https://cdn.vox-cdn.com/thumbor/KWYSlRWuK3ps7sjBlM7oZMnDayI=/0x108:1500x893/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15971777/XiaomiIndia_2019_Mar_19.jpg", "publishedAt": "2019-03-19T09:39:09Z", "content": "At an event in New Delhi, India today, Xiaomi announced its first Android Go phone, the Redmi Go. This is a low-end device with a 5-inch 720p 16:9 screen, 1GB of RAM, a Snapdragon 425 processor, an 8-megapixel camera, a 3,000mAh battery, and 8GB of expandable… [+1452 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Apple now sells five different iPads", "description": "Recommending an iPad used to be simpler. White or black? How much storage do you want? Those were the days. Tablets were a confusing space and the iPad brought clarity. Now, Apple sells five different iPads with two different connectors and two different Appl…", "url": "https://www.theverge.com/tldr/2019/3/19/18271636/apple-five-ipads-ipad-pro-mini-air", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9dhCm57j8BxAXESWQRWKhf7j7Vw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7723631/jbareham_160329_1003_0050_2016.0.jpeg", "publishedAt": "2019-03-19T05:56:00Z", "content": "Recommending an iPad used to be simpler. White or black? How much storage do you want? Those were the days. Tablets were a confusing space and the iPad brought clarity. Now, Apple sells five different iPads with two different connectors and two different Appl… [+2230 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "The SEC says Elon Musk is in ‘blatant violation’ of securities fraud settlement", "description": "The commission reiterated its request for Musk to be held in contempt of court Monday for violating last year’s settlement over the “funding secured” debacle. Now it’s up to the judge to decide whether to hold a hearing, or rule on whether Musk should be held…", "url": "https://www.theverge.com/2019/3/18/18271914/sec-elon-musk-contempt-twitter-court-fraud", "urlToImage": "https://cdn.vox-cdn.com/thumbor/7YChMVyltceCz6Kv5UXXSoTpXBY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15971132/elon_musk_tesla_3225.jpg", "publishedAt": "2019-03-19T01:47:52Z", "content": "The Securities and Exchange Commission (SEC) says Elon Musk hasn’t made a “good faith” effort to comply with the settlement the two sides reached last year over fraud charges related to his attempt to take Tesla private, according to a new court filing. The S… [+6022 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sam Byford", "title": "SHODAN returns in System Shock 3 trailer", "description": "OtherSide Entertainment has dropped the first real teaser trailer for its upcoming System Shock revival, offering a look at some “pre-alpha in-engine” footage of a doomed space station under the...", "url": "https://www.theverge.com/2019/3/18/18272003/system-shock-3-teaser-trailer-gdc-2019-unity", "urlToImage": "https://cdn.vox-cdn.com/thumbor/rmC6T0kXW2wSAUvpmbjhPIzFU7w=/0x46:2372x1288/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15971117/ss3.jpg", "publishedAt": "2019-03-19T01:24:22Z", "content": "OtherSide Entertainment has dropped the first real teaser trailer for its upcoming System Shock revival, offering a look at some “pre-alpha in-engine” footage of a doomed space station under the control of murderous AI SHODAN. The System Shock 3 trailer was s… [+507 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Unity’s latest demo is a gorgeous sci-fi short starring a lifelike virtual hero", "description": "For its latest technical demo, Unity has crafted a gorgeous sci-fi short called The Heretic, designed to show off the game engine’s ability to create more lifelike digital humans.", "url": "https://www.theverge.com/2019/3/18/18270559/unity-the-heretic-sci-fi-short-film-gdc-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/aQn--gYeJ4b8ljgHyKnJ8pyNz44=/0x10:1030x549/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15968949/0.png", "publishedAt": "2019-03-19T01:00:00Z", "content": "The latest jaw-dropping demo from Unity, one of the most widely used game engines in the world, isn’t just an example of how developers can use new shadow effects or rendering tools. It’s also a darkly beautiful philosophical journey stuffed into a short anim… [+508 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "Devin Nunes sues Twitter for letting ‘Devin Nunes’ Mom’ and ‘Devin Nunes’ Cow’ insult him", "description": "US Representative Devin Nunes has sued Twitter and a handful of users over what he claims are defamatory tweets about his character and behavior.", "url": "https://www.theverge.com/2019/3/18/18271805/devin-nunes-twitter-lawsuit-250-million-liz-mair-defamation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Y9vvx7mMfk19OP2_e7okXU5bZBA=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970991/969195916.jpg.jpg", "publishedAt": "2019-03-19T00:30:28Z", "content": "US Representative Devin Nunes has sued Twitter and a handful of users for defamation and negligence, accusing Twitter of acting as a vessel of opposition research for hosting accounts that insulted Nunes. The suit is the latest of several filed against social… [+4130 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Nvidia is bringing ray tracing to old GPUs that can’t ray trace worth a damn", "description": "How do you convince gamers that they’re getting their money’s worth from a $500+ graphics card? Nvidia’s latest technique is pretty smart — it’s taking real-time ray tracing, an eye-popping if barely adopted feature previously exclusive to its pricey new RTX-…", "url": "https://www.theverge.com/2019/3/18/18271836/nvidia-raytracing-gtx-rtx-older-gpu-support", "urlToImage": "https://cdn.vox-cdn.com/thumbor/oauPljoYCy8FOBQOGfyHKxVbfx0=/0x166:3840x2176/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15820763/WwBCPl4.0.0.1464078477.jpg", "publishedAt": "2019-03-18T23:57:00Z", "content": "How do you convince gamers that they’re getting their money’s worth from a $500+ graphics card? Nvidia’s latest technique is pretty smart — it’s taking real-time ray tracing, an eye-popping if barely adopted feature previously exclusive to its pricey new RTX-… [+1814 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Microsoft will let PC players test Halo: The Master Chief Collection ahead of release", "description": "Microsoft today announced as part of its newly released Halo Insider Program that PC players can sign up to test the upcoming Halo: Master Chief Collection version coming to Windows some time later this year. Announced last week, the PC port of developer Bung…", "url": "https://www.theverge.com/2019/3/18/18271791/microsoft-halo-the-master-chief-collection-pc-player-test-xbox-anywhere", "urlToImage": "https://cdn.vox-cdn.com/thumbor/_kd2P1hy-UuG2nHRtzfUdK_ve5Y=/262x0:2290x1062/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970899/Screen_Shot_2019_03_18_at_4.04.49_PM.png", "publishedAt": "2019-03-18T23:10:56Z", "content": "Microsoft today announced that as part of its newly released Halo Insider Program, PC players can sign up to test the upcoming Halo: The Master Chief Collection version coming to Windows some time later this year. Announced last week, the PC port of developer… [+2068 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Nvidia announces $99 AI computer for developers, makers, and researchers", "description": "Nvidia has launched the Jetson Nano: a new AI computer for developers, researchers, and makers. A devkit starts at just $99, while the production-ready version goes for $129. It’s extra competition for Intel’s Neural Compute Stick and Google’s Coral-brand dev…", "url": "https://www.theverge.com/circuitbreaker/2019/3/18/18271329/nvidia-jetson-nano-price-details-specs-devkit-gdc", "urlToImage": "https://cdn.vox-cdn.com/thumbor/X7HoY-gHTCWpY7QyAVQH3mqQ5bs=/0x40:2000x1087/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970150/Jetson_Nano_Family.jpg", "publishedAt": "2019-03-18T23:00:00Z", "content": "The Jetson Nano devkit (left) and production-ready module (right). Credit: Nvidia In recent years, advances in AI have produced algorithms for everything from image recognition to instantaneous translation. But when it comes to applying these advances in the … [+2660 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "UFC makes ESPN+ streaming service the exclusive home of all future pay-per-view fights", "description": "The UFC and ESPN have announced that ESPN+ will become the exclusive destination for and distributor of the MMA company’s pay-per-view events. It’s a major boost for ESPN’s standalone streaming service, which costs $4.99 per month.", "url": "https://www.theverge.com/2019/3/18/18271607/ufc-espn-plus-pay-per-view-exclusive-rights", "urlToImage": "https://cdn.vox-cdn.com/thumbor/LXqhreDS5cj8jv_yU0Ynd9s8wPE=/0x470:4481x2816/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970674/1095606146.jpg.jpg", "publishedAt": "2019-03-18T21:42:42Z", "content": "The UFC and ESPN jointly announced this afternoon that ESPN+ will become the exclusive destination for and distributor of the MMA company’s pay-per-view events. The seven-year deal expands on the partnership between UFC and ESPN’s standalone streaming service… [+2635 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Rachel Becker", "title": "Nebraska flooding shows (again) how extreme weather can threaten national security", "description": "Catastrophic flooding in Nebraska has wiped out roads, overtopped dams, and left at least a third of the Offutt Air Force Base submerged, highlighting the ongoing threat that extreme weather poses to both people’s lives, and national security.", "url": "https://www.theverge.com/2019/3/18/18271637/nebraska-flooding-offutt-air-force-base-extreme-weather-national-security", "urlToImage": "https://cdn.vox-cdn.com/thumbor/gI9ZOduGR_4dUZi1Kdej5x_d1TE=/0x433:6016x3583/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970663/190317_F_IT794_1052.jpg", "publishedAt": "2019-03-18T21:34:50Z", "content": "Catastrophic flooding in Nebraska has wiped out roads, overtopped dams, and left at least a third of the Offutt Air Force Base submerged, highlighting the ongoing threat that extreme weather poses to both peoples lives, and national security. \r\nA massive wint… [+3599 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "Is this robotic therapy pet the uncanny valley of dog?", "description": "The Tombot puppy is a robotic companion animal designed by Jim Henson’s Creature Shop to provide therapy benefits for seniors and patients with dementia. It’s funding now on Kickstarter and aims to launch in August 2020.", "url": "https://www.theverge.com/2019/3/18/18271465/tombot-puppies-jim-henson-creature-shop-therapy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/KxsDhmj0H9k6nA-JkHWg9Ze5owY=/0x12:814x438/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970475/dog.jpg", "publishedAt": "2019-03-18T21:08:00Z", "content": "Theres no shortage of social robots that promise to provide companionship, and the Tombot Puppy is the latest therapy robot to offer the kind of unconditional love that only a dog can give, provided the batteries stay charged forever. The golden Labrador retr… [+1829 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "PlayStation Vue now lets you watch four channels at once on Apple TV", "description": "Sony is bringing PlayStation Vue’s multi-view feature, which allows users to view several channels at once, to the Apple TV. You can stream up to four channels on-screen at the same time.", "url": "https://www.theverge.com/2019/3/18/18271560/playstation-vue-multi-view-apple-tv-now-available", "urlToImage": "https://cdn.vox-cdn.com/thumbor/dsYq8IZq5Banewm68NjjodCQs3k=/0x115:1600x953/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970580/vue.jpg", "publishedAt": "2019-03-18T20:36:56Z", "content": "Sony is bringing PlayStation Vue’s multi-view feature, which lets users view several channels at once, to the Apple TV today. Until now, multi-view has only worked on the company’s own PlayStation 4 console, so it’s nice to see other devices getting one of Vu… [+1126 chars]"}]}