{"status": "ok", "totalResults": 966, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Apple’s next iPad will reportedly keep Touch ID and a headphone jack", "description": "A new report from says that Apple likely isn’t going to change up this year’s 7th Generation iPad, noting that it will likely keep the same enclosure and will retain Touch ID and a headphone jack. It might also be revealed alongside an update to the iPad Mini.", "url": "https://www.theverge.com/2019/3/9/18257489/apple-ipad-7th-generation-touch-id-headphone-jack-rumor", "urlToImage": "https://cdn.vox-cdn.com/thumbor/EdwyhYvMy5kRalKKDl4T5_ZmA4o=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10572403/vpavic_180330_2434_0022.jpg", "publishedAt": "2019-03-09T15:54:25Z", "content": "A new report from Macotakara (via Apple Insider) says that Apple likely isnt going to change up its next iPad, noting that it will likely keep the same enclosure and will retain Touch ID and a headphone jack. \r\nThe report comes from a supplier, which says tha… [+738 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Japanese PS4s can now use the X button to select, but why couldn’t they do that already?", "description": "Buried within the changelog for the PS4’s latest firmware update was a seemingly minor addition: as of version 6.50 of the PS4 console’s firmware, you can remap the console’s “enter” button from the O to the X on Japanese consoles.", "url": "https://www.theverge.com/2019/3/9/18255901/ps4-x-o-cross-circle-remap-firmware-6-50-dualshock-4", "urlToImage": "https://cdn.vox-cdn.com/thumbor/fLA9Uw3LfNI499iL0JQHzYrVlYs=/0x17:1024x553/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12043081/IMG_5042.0.jpg", "publishedAt": "2019-03-09T15:00:00Z", "content": "The standout feature of the PS4s latest firmware update was Remote Play for iOS devices, but buried within the changelog was another seemingly minor addition: as of version 6.50 of the PS4 consoles firmware, you can remap the consoles enter button from the O … [+6316 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Russell Brandom", "title": "Presidential candidate Andrew Yang has a meme problem", "description": "Andrew Yang is dark horse candidate in the Democratic presidential primary — but his online fan base is starting to cause problems.", "url": "https://www.theverge.com/2019/3/9/18256622/andrew-yang-2020-president-meme-yanggang", "urlToImage": "https://cdn.vox-cdn.com/thumbor/97iGdZgxB5HbXevAQrviKo65RlU=/0x371:5168x3077/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948513/yang_pittsburgh.jpg", "publishedAt": "2019-03-09T14:00:00Z", "content": "Andrew Yang supporters, be SMART with your memes.\r\nThe post appeared on the Yang For President subreddit on Thursday, warning supporters against creating anything that might reflect poorly on the candidate. I get it, the author warned, you want to show off ho… [+5259 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "Elizabeth Warren takes on Amazon at Long Island City campaign event", "description": "In her proposal, Warren says that, if elected, she would appoint regulators who would work to spin off former acquisitions by companies like Facebook and Google back into their own companies again. In the case of Facebook, that would mean forcing the company …", "url": "https://www.theverge.com/us-world/2019/3/8/18256908/amazon-facebook-instagram-elizabeth-warren-queens-lic-campaign-tech-antitrust-nyc", "urlToImage": "https://cdn.vox-cdn.com/thumbor/wy7kJJsefOwFeO3WNajnKYhKYZA=/0x392:5472x3257/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948979/1125752790.jpg.jpg", "publishedAt": "2019-03-09T01:37:52Z", "content": "Friday morning, Elizabeth Warren (D-MA) vowed that, if elected president in 2020, she would break up tech behemoths like Amazon, Facebook, and Google. Only a few hours later, she arrived in Long Island City in New York City to pitch her proposal to a communit… [+3389 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "No, Spotify and Amazon aren’t suing songwriters", "description": "Spotify, Google, Pandora and Amazon have all filed to appeal a ruling by the U.S. Copyright Royalty Board (CRB) that would increase payout rates to songwriters by 44% over the next five years, reports Variety.", "url": "https://www.theverge.com/2019/3/8/18256779/spotify-amazon-google-pandora-apple-music-streaming-crb-royalties-sue-songwriters", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Flr0Ka5P3WniH4rWI_UYiagTE3Q=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13292795/acastro_181016_1777_music_0002.jpg", "publishedAt": "2019-03-08T23:26:43Z", "content": "Musicians, producers and songwriters are rallying against Spotify and Amazons plans to sue songwriters over increased streaming royalties. But the outrage stems from some misinformation: Spotify and Amazon arent technically suing songwriters theyre trying to … [+2485 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Foursquare’s CEO really wants to know if his new phone-tracking feature is creepy or not", "description": "Foursquare has introduced a new feature called Hypertrending. It automates the check-in process by automatically detecting your phone’s location, and adding it to a visual map that shows how popular a point of interest is. It’s only available in Austin, Texas…", "url": "https://www.theverge.com/tldr/2019/3/8/18256558/foursquare-hypertrending-phone-tracking-feature-sxsw-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/k6TX2Cq4QE7Y7x7k87Wj5z1IJzU=/0x122:1878x1105/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948484/hypertrending.jpg", "publishedAt": "2019-03-08T22:55:30Z", "content": "When you walk into a restaurant at this years SXSW, Foursquares new Hypertrending feature will know. Your phone will show up as a blip on a live map that literally anyone in Austin, Texas can access. And Foursquare co-founder and CEO Dennis Crowley just reall… [+1517 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "The US arrests alleged leader of $3.7 billion cryptocurrency pyramid scheme", "description": "Authorities arrested one leader on Wednesday of a cryptocurrency project called OneCoin, which prosecutors allege was in fact a pyramid scheme rather than a functional currency. Konstantin Ignatov was arrested on a wire fraud conspiracy charge.", "url": "https://www.theverge.com/2019/3/8/18256662/us-onecoin-leader-arrested-cryptocurrency-pyramid-scheme", "urlToImage": "https://cdn.vox-cdn.com/thumbor/WlQ8RkJNRiZhZ3LJDH9n9_X8-7w=/0x152:3000x1723/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8954807/acastro_170726_1777_0008.jpg", "publishedAt": "2019-03-08T22:30:58Z", "content": "Authorities have arrested one leader on Wednesday of a cryptocurrency project called OneCoin, which prosecutors allege was in fact a pyramid scheme rather than a functional currency. Konstantin Ignatov was arrested on a wire fraud conspiracy charge, while his… [+2474 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Snapchat founder Evan Spiegel’s life is getting The Social Network treatment", "description": "Quibi is developing an original, short-form series based on Snapchat’s Evan Spiegel. The show will play out over multiple chapters.", "url": "https://www.theverge.com/2019/3/8/18256708/evan-spiegel-quibi-frat-boy-genius-snapchat-jeffrey-katzman-meg-whitman-sxsw", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2SWJ_cNT2QqA9m7Fl8vfb4Z-CEo=/0x213:3000x1784/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948664/180205469.jpg.jpg", "publishedAt": "2019-03-08T22:10:19Z", "content": "The story of how Evan Spiegel came to create Snapchat is being turned into a short-form video series by Quibi, an upcoming short-form streaming service designed for mobile users thats set to launch next year. Quibis name stands for quick bites, so all the sho… [+2977 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "You should update Google Chrome and Windows immediately to defend against zero-day vulnerabilities", "description": "Microsoft has a zero-day vulnerability that remains unpatched, Google revealed in a blog post yesterday. It’s one of two zero-day vulnerabilities, one in Google Chrome and one in Microsoft Windows 7 that hackers were exploiting.", "url": "https://www.theverge.com/2019/3/8/18256335/google-chrome-windows-against-zero-day-vulnerabilities-update", "urlToImage": "https://cdn.vox-cdn.com/thumbor/4l6iWjI4DK0Q2hGbGW3eDdB5s6s=/0x20:912x497/fit-in/1200x630/cdn.vox-cdn.com/assets/1627245/win7.jpeg", "publishedAt": "2019-03-08T21:05:38Z", "content": "Google revealed yesterday that two zero-day vulnerabilities — one in Chrome and one in Windows — let hackers send malicious code to users. The vulnerabilities were discovered on February 27th, and Google has since patched Chrome, but Windows is still vulnerab… [+1193 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Rachel Becker", "title": "What dancing sea lions and cockatoos can teach us about music", "description": "Music cognition professor Henkjan Honing at the University of Amsterdam sets out to understand the origins of musicality and music perception in his new book, The Evolving Animal Orchestra, published this week by MIT Press.", "url": "https://www.theverge.com/2019/3/8/18256494/music-evolving-animal-orchestra-dancing-rhythm-cognition-psychology", "urlToImage": "https://cdn.vox-cdn.com/thumbor/11VKCBaD0GRjnhsOGHiH-eELvC0=/0x232:2040x1300/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14821984/mdoying_190228_3202_0003.jpg", "publishedAt": "2019-03-08T19:56:49Z", "content": "In June 2014, music cognition professor Henkjan Honing witnessed a strange sight: a sea lion named Ronan headbanging to a beat. When the beat sped up or slowed down, so did the bops of Ronans head. And when Boogie Wonderland by Earth, Wind &amp; Fire started … [+7706 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Everything we think we know about Apple’s AirPods 2", "description": "Originally expected to release in 2018, the Apple AirPods 2 truly wireless headphones are predicted to arrive in the first half of 2019, perhaps alongside the delayed AirPower charging mat. The next model is rumored to be more expensive, and it may have new f…", "url": "https://www.theverge.com/2019/3/8/18250483/apple-airpods-2-wireless-headphones-rumors", "urlToImage": "https://cdn.vox-cdn.com/thumbor/4gE1h2xkz4QXhfauvI7BnhUOjaU=/0x249:2040x1317/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7680357/akrales_161216_1332_A_0143_v1.0.jpeg", "publishedAt": "2019-03-08T19:52:13Z", "content": "The Apple AirPods are ripe for a refresh in 2019, if only because these truly wireless in-ear headphones are approaching their third year on shelves without a single hardware revision. From where Apple is sitting, it’s easy to see why it has waited this long … [+8081 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "The CDC is studying electric scooter injuries for the first time", "description": "The Centers for Disease Control and Prevention (CDC) is examining the rise of injuries related to shareable electric scooters, according to CNBC. The study was launched at the request of the Public Health and Transportation departments in Austin, Texas, where…", "url": "https://www.theverge.com/2019/3/8/18256197/scooter-injury-study-cdc-austin", "urlToImage": "https://cdn.vox-cdn.com/thumbor/dO6v9OcQ0u_CntqSuspGCiUrKA0=/0x481:6720x3999/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13124501/1016374470.jpg.jpg", "publishedAt": "2019-03-08T19:47:11Z", "content": "The Centers for Disease Control and Prevention (CDC) is examining the rise of injuries related to shareable electric scooters, according to CNBC. The study was launched at the request of the Public Health and Transportation departments in Austin, Texas, where… [+2715 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Megan Farokhmanesh", "title": "The spirit of old Facebook lives on in a new game called Emily is Away", "description": "Facebook as we know it is on its way out as the company eyes a so-called pivot to privacy, but its legacy lives on. Developer Kyle Seely — creator of AIM-based visual novels Emily is Away and Emily is Away Too — is working on a new game that aims to recapture…", "url": "https://www.theverge.com/2019/3/8/18254938/emily-is-away-old-facebook-game", "urlToImage": "https://cdn.vox-cdn.com/thumbor/MiDXAlLSmtgSAKmvaK3HM7zynkA=/0x69:3360x1828/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15945494/ss_chat1.png", "publishedAt": "2019-03-08T19:33:37Z", "content": "Facebook as we know it is on its way out as the company eyes a so-called pivot to privacy, but its legacy lives on. Developer Kyle Seely creator of AIM-based visual novels Emily is Awayand Emily is Away Too is working on a new game that aims to recapture the … [+1353 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Vizio’s P-series Quantum TV is on sale, and Samsung Galaxy Buds are 25 percent off", "description": "Vizio’s P-series Quantum TV is a good alternative to OLED, and it’s cheaper than usual today. Other tech, including the Kindle Paperwhite, Samsung Galaxy Buds, Google Chromecast, and more, are discounted today as well.", "url": "https://www.theverge.com/good-deals/2019/3/8/18256196/vizio-p-series-quantum-tv-samsung-galaxy-buds-deal-sale", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-7XwTK7uVubeIWExiFCWp0ncQ70=/0x78:2356x1312/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10621335/quantum2.png", "publishedAt": "2019-03-08T19:03:10Z", "content": "Vizios 65-inch P-series Quantum 4K HDR television is $1,599 ($200 off) at B&amp;H Photo, and is todays best deal if youre in the market for a high-end TV. This model first went on sale in late July 2018, and while weve seen its price dip below where it curren… [+1708 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Flickr says Creative Commons photos won’t be subject to its 1,000 picture limit", "description": "Flickr has announced that all Creative Commons photos will be allowed on Flickr for good, regardless of upload date, even on accounts that otherwise would have surpassed the 1,000 picture limit.", "url": "https://www.theverge.com/2019/3/8/18256478/flickr-creative-commons-photos-free-1000-picture-limit-exempt", "urlToImage": "https://cdn.vox-cdn.com/thumbor/IXox72hEeSpwmaO7D005qkqyr3I=/0x94:1280x764/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13370313/flickr.png", "publishedAt": "2019-03-08T18:58:37Z", "content": "Back when Flickr first announced that it would be limiting free accounts to just 1,000 pictures, the company announced an exception : while it would be deleting any pictures on accounts over that number, any Creative Commons licensed photos uploaded before th… [+1623 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Bijan Stephen", "title": "Apple has been quietly hiring iconic artists to design Apple Music playlist covers", "description": "While Apple Music isn’t a record label (yet), it did recently decide to add original art to its playlists. Its goal was to bring that instant recognition to its own content, so the company enlisted everyone from the creator of the iconic AC/DC logo to the per…", "url": "https://www.theverge.com/2019/3/8/18256361/apple-music-art-original-playlists-design", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ichi-caf4tghR_5EuoFbNdeC85g=/0x176:1080x741/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15948229/SC_MS_WW_In_My_Room_dynamics_Adam_ID_1144570529_copy.png", "publishedAt": "2019-03-08T18:43:58Z", "content": "Records should have good art. For albums as diverse as London Calling, Horses, and Fear of a Black, the images on their covers were as recognizable as the music on the wax. While Apple Music isnt a record label (yet), it did recently decide to add original ar… [+7049 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Marino", "title": "Vergecast episodes that explain antitrust and breaking up Big Tech", "description": "Here are some episodes of The Vergecast that help explain why should break up Big Tech, how it could be done, and what lawmakers are doing about it.", "url": "https://www.theverge.com/2019/3/8/18256210/antitrust-explainer-big-tech-break-up-facebook-google-amazon-vergecast-interview", "urlToImage": "https://cdn.vox-cdn.com/thumbor/BLViiGrFVJqYXbKc9ODmosPXLbE=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13117223/feature_test.jpg", "publishedAt": "2019-03-08T18:37:07Z", "content": "The idea of antitrust in the tech industry has been tossed around a lot lately. Most recently, Sen. Elizabeth Warren (D-MA) published a proposal to break up big tech companies, notably Amazon, Facebook, and Google. We cover antitrust policy often on The Verge… [+2191 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Nvidia G-Sync support for FreeSync monitors: better performance for less", "description": "Nvidia recently brought G-Sync support to 15 AMD FreeSync monitors, starting at as low as $189. Buying expensive certified gear will be the right move for some, but FreeSync monitors that are G-Sync compatible can save you money.", "url": "https://www.theverge.com/2019/3/8/18220853/nvidia-g-sync-support-freesync-monitor-gaming", "urlToImage": "https://cdn.vox-cdn.com/thumbor/WD1wgAPHr3osjiiFNW9oaDufcx4=/0x74:2040x1142/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947980/akrales_190308_3279_0017_2.jpg", "publishedAt": "2019-03-08T18:36:40Z", "content": "Nvidias G-Sync variable refresh rate tech takes the leash off of your graphics card, letting it push as many frames per second as it possibly can, while eliminating input lag and visual artifacts (like motion blur and screen tearing) on your monitor. If you b… [+2292 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Facebook wants to be WeChat", "description": "Mark Zuckerberg laid out a new direction for Facebook this week that shifts its focus from a sprawling series of social apps to a one-stop-shop messaging service that combines everything the company has to offer. If there’s an analog to what Facebook is tryin…", "url": "https://www.theverge.com/2019/3/8/18256226/facebook-wechat-messaging-zuckerberg-strategy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/BI6Zvy-KUr0JZAIT9L6VIfJATpw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947665/acastro_190308_1777_weChat_FB_0001.0.jpg", "publishedAt": "2019-03-08T18:12:23Z", "content": "Mark Zuckerberg laid out a new direction for Facebook this week that shifts its focus from a sprawling series of social apps to a one-stop shop messaging service that combines everything the company has to offer. If theres an analog to what Facebook is trying… [+6982 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Angela Chen", "title": "A technology expert gives four suggestions on how to rein in algorithms", "description": "The Verge interviews University of Pennsylvania professor Kartik Hosanagar about his new book, A Human’s Guide to Machine Intelligence: How Algorithms Are Shaping Our Lives and How We Can Stay in Control, which is out March 12th from Penguin Random House.", "url": "https://www.theverge.com/2019/3/8/18256223/humans-guide-machine-intelligence-kartik-hosanagar-algorithms-decision-making-interview", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lMLVsBCBskNL3fxZHuQoY1aCUsk=/0x47:640x382/fit-in/1200x630/cdn.vox-cdn.com/assets/2356607/code.jpg", "publishedAt": "2019-03-08T18:08:21Z", "content": "I hear a lot that algorithms are powerful technologies, and the companies are monopolies, and we are helpless against them, and Google is the only option, says Kartik Hosanagar, a professor of technology and digital business at the University of Pennsylvania.… [+5667 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "YouTube fought Brie Larson trolls by changing its search algorithm", "description": "YouTube changed the way that search results for Brie Larson appeared, essentially giving less power to trolls. The move led to questions about whether YouTube could do this across the platform.", "url": "https://www.theverge.com/2019/3/8/18255265/brie-larson-youtube-captain-marvel-mcu-algorithm-review-bomb-trolls", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-r8GOtSbRvCB5Aa18y4KTkI4B4c=/0x0:5300x2775/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947701/1133715935.jpg.jpg", "publishedAt": "2019-03-08T17:12:41Z", "content": "If you searched “Brie Larson” on YouTube a couple of days ago, the top search results were calls for a boycott of Captain Marvel, and angry rants about Larson’s involvement in the Marvel Cinematic Universe. With one small change, YouTube made all of that disa… [+2569 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "You can now make your Switch travel case cosplay as Mario", "description": "This bizarre Nintendo Switch travel case was brought to our attention by the Wario64 Twitter account, which regularly tweets out video game deals. The original Lightning Deal appears to be over, but you can still grab the case for $34.99.", "url": "https://www.theverge.com/tldr/2019/3/8/18256189/nintendo-switch-travel-case-super-mario-price", "urlToImage": "https://cdn.vox-cdn.com/thumbor/JAPhQiT3CvMzm6QecEn4-44aiFY=/0x212:3127x1849/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947578/switch.jpg", "publishedAt": "2019-03-08T17:11:34Z", "content": "It looks like Cappy has made his way to Amazon because this Nintendo Switch travel case definitely looks like Mario’s soul is trapped inside of it. This bizarre case was brought to our attention by the Wario64 Twitter account, which regularly tweets out video… [+677 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Ape Out turns raging monkeys into improvisational jazz", "description": "The new Nintendo Switch and PC game Ape Out is about rampaging apes escaping from a lab, but its violent premise turns into the video game equivalent of improvisational jazz.", "url": "https://www.theverge.com/2019/3/8/18255975/ape-out-game-pc-nintendo-switch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/wrFdf1f1McJJGABkV4Qa-z0dFG4=/0x16:616x339/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947221/Steam_Main_Capsule.png", "publishedAt": "2019-03-08T16:54:45Z", "content": "In 2014, when game designer Gabe Cuzzillo was still a student in New York, he was going through something of a rough patch. “I was in film school at the time, and I was feeling pretty bad about where my life was going,” he says. That’s when he discovered the … [+4719 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Chelsea Manning jailed after refusing to testify about WikiLeaks", "description": "Chelsea Manning, the former Army intelligence analyst who shared military and diplomatic secrets with WikiLeaks in 2010, has been taken into custody for refusing to testify before a grand jury, according to The Washington Post.", "url": "https://www.theverge.com/2019/3/8/18256173/chelsea-manning-wikileaks-jailed-testify-refusal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lcCjeU6RL4NVaaHm7C6VFRnJq5c=/0x0:5596x2930/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947649/1043977516.jpg.jpg", "publishedAt": "2019-03-08T16:48:25Z", "content": "Chelsea Manning, the former Army intelligence analyst who shared military and diplomatic secrets with WikiLeaks in 2010, has been taken into custody today for refusing to testify before a grand jury, according to The Washington Post.\r\nManning was subpoenaed t… [+1310 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Report claims that Apple could begin production of iPhone-powered AR glasses this year", "description": "Apple could begin production of its long-rumored augmented reality glasses as early as the end of this year. Ming-Chi Kuo predicts that the glasses could be released as an iPhone accessory, but they will contain their own display.", "url": "https://www.theverge.com/2019/3/8/18256256/apple-ar-glasses-2019-ming-chi-kuo-augmented-reality", "urlToImage": "https://cdn.vox-cdn.com/thumbor/7ptLK_BDo8wD_MW1bD5ZhVFKDWo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13728969/acastro_180604_1777_apple_wwdc_0002.jpg", "publishedAt": "2019-03-08T16:32:49Z", "content": "Apple could begin production of its long-rumored augmented reality glasses as early as the end of this year, noted analyst Ming-Chi Kuo has said. The predictions come in a report published by Economic Daily News (via MacRumors ) in which Kuo predicts that the… [+1951 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Marino", "title": "Vergecast: Facebook’s pivot to privacy and the streaming wars", "description": "We split this week’s Vergecast into two parts: one half focuses on privacy, and the other half covers the streaming wars between Netflix, HBO, Disney, and others.", "url": "https://www.theverge.com/2019/3/8/18256148/facebook-privacy-zuckerberg-letter-youtube-att-hbo-disney-vergecast-343", "urlToImage": "https://cdn.vox-cdn.com/thumbor/XvVt25j7b4dci2iG5s3LjXFnEe4=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13177665/acastro_180928_1777_facebook_hack_0001.jpg", "publishedAt": "2019-03-08T16:24:16Z", "content": "We split this weeks Vergecast into two parts: one half focuses on privacy, and the other half covers the streaming wars between Netflix, HBO, Disney, and others.\r\nNilay Patel, Dieter Bohn, and Paul Miller bring Silicon Valley editor Casey Newton back to the s… [+655 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Google brings continued conversation with Assistant to smart displays", "description": "Google is bringing its continued conversation feature to its Google Assistant smart displays. This will allow Assistant to stay active and listening so that you can continue to ask follow-up questions without needing to repeat “OK, Google,” before each one.", "url": "https://www.theverge.com/2019/3/8/18256074/google-continued-conversation-assistant-smart-displays", "urlToImage": "https://cdn.vox-cdn.com/thumbor/EHgGmPDtHcRhsrmk05I5PRUXvK8=/0x109:2040x1177/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13299525/dseifert_181018_3039_1192.jpg", "publishedAt": "2019-03-08T16:14:43Z", "content": "Google is bringing its continued conversation feature to its Google Assistant smart displays today. This will allow Assistant to stay active and listening so that you can continue to ask follow-up questions without needing to repeat OK, Google, before each on… [+542 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "The best VPN to use to protect your privacy", "description": "Sorting through the mess of VPN apps.", "url": "https://www.theverge.com/2019/3/8/18224088/best-vpn-security-protection-virtual-private-network-expressvpn-nordvpn-tunnelbear", "urlToImage": "https://cdn.vox-cdn.com/thumbor/zfw3vzr8ShBTk7XQ2E2d-FrG-Wc=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15946005/akrales_190306_3268_0000.jpg", "publishedAt": "2019-03-08T16:02:45Z", "content": "Its best practice to use a virtual private network (VPN) to hide your internet activity from snoops. A VPN establishes an encrypted connection between your device of choice and a private server, which can be ideal if you value security. But VPNs are also a di… [+7249 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Samsung Galaxy Buds and other accessories are 25 percent off at AT&T", "description": "AT&T is hosting a promo on Samsung accessories to mark the release of the Samsung Galaxy S10. The best part of this promo is that it takes $30 off of the Galaxy Buds. But if you’re looking for other products, Amazon sells them for less.", "url": "https://www.theverge.com/good-deals/2019/3/8/18256124/samsung-galaxy-buds-accessories-at-t-sale-discount-deal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YrSEtajyz19g9dflcOeu-rSxasc=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14967312/akrales_190301_3262_0060.0.jpg", "publishedAt": "2019-03-08T15:47:08Z", "content": "Samsungs lineup of Galaxy S10 phones is now on sale, and AT&amp;T is hosting a deal on Samsung accessories to mark the occasion. The best part of the deal is that the new Samsung Galaxy Buds are over $30 off, down to $97.49 instead of their usual $129.99 pric… [+1045 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Noel Murray", "title": "This weekend, stream a free animated Captain Marvel movie on DisneyNow", "description": "In Marvel Rising: Secret Warriors, the hero partners with Ms. Marvel and Squirrel Girl to combat a threat facing Earth. It’s a movie aimed at younger audiences, heavy on teen heroes proving their worth and considering what heroism means. But even for Marvel C…", "url": "https://www.theverge.com/2019/3/8/18255288/captain-marvel-free-online-animated-movie-disneynow-secret-warriors-squirrel-girl-kamala-khan", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ye-7W1B0Gyvqq2DcwYa3MnEhzcM=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15946105/150363_0011.jpg", "publishedAt": "2019-03-08T15:41:00Z", "content": "There are so many streaming options available these days, and so many conflicting recommendations, that it’s hard to see through all the crap you could be watching. Each Friday, The Verge ’s Cut the Crap column simplifies the choice by sorting through the ove… [+5370 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Spotify expands Samsung partnership with preinstalled app and six months of free Premium", "description": "Spotify is expanding its partnership with Samsung by announcing that its music app will now come preinstalled on “millions of new Samsung mobile devices globally,” including the just-launched Galaxy S10 lineup.", "url": "https://www.theverge.com/2019/3/8/18256021/spotify-samsung-partnership-preinstalled-s10-app-six-months-free-premium", "urlToImage": "https://cdn.vox-cdn.com/thumbor/QK6Mu9FDvN7sFTdRHxKJ5YHcJ7Q=/0x86:1200x714/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11959763/DkK45gzXgAA7Kxf.jpg", "publishedAt": "2019-03-08T14:33:44Z", "content": "Spotify is expanding its partnership with Samsung today by announcing that its music app will now come preinstalled on “millions of new Samsung mobile devices globally,” including the just-launched Galaxy S10 lineup. The company also announced a new promotion… [+660 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Colin Lecher", "title": "Elizabeth Warren says she wants to break up Amazon, Google, and Facebook", "description": "Sen. Elizabeth Warren (D-MA) said today that, if elected president in 2020, her administration will break up the giants of the tech industry, including Amazon, Facebook, and Google.", "url": "https://www.theverge.com/2019/3/8/18256032/elizabeth-warren-antitrust-google-amazon-facebook-break-up", "urlToImage": "https://cdn.vox-cdn.com/thumbor/fP7bMekcdMmL-zNXVV0L8GJpUUk=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947296/1133048612.jpg.jpg", "publishedAt": "2019-03-08T14:22:28Z", "content": "Sen. Elizabeth Warren (D-MA) said today that, if elected president in 2020, her administration will break up the giants of the tech industry, including Amazon, Facebook, and Google.\r\nThe proposal is the most stringent stance taken by a candidate in the presid… [+1309 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Stefan Etienne", "title": "How to upgrade your Nintendo Switch storage and migrate your games", "description": "Nintendo knows that you’re going to fill up your Switch’s storage, if you haven’t already. Here’s a guide on how to replace your microSD card, transfer files, and how to move games from internal storage to the microSD card.", "url": "https://www.theverge.com/2019/3/8/18253559/how-to-upgrade-nintendo-switch-storage-microsd-transfer-games-files", "urlToImage": "https://cdn.vox-cdn.com/thumbor/WOt0N9q6bsfwVvZcF1qJv0zF6MM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15861438/jbareham_190301_3267_0016.jpg", "publishedAt": "2019-03-08T14:00:00Z", "content": "The Nintendo Switch only comes with 32GB of internal storage, which is minuscule if you plan on having more than just a handful of games and apps downloaded to your handheld console. The solution is to use a microSD card to expand the Switchs storage. But wha… [+7657 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Stefan Etienne", "title": "How to upgrade your PS4 Pro hard drive without losing games", "description": "Sony makes it easy to upgrade storage and preserve data on a PlayStation 4 Pro. This is great for tinkerers who want to expand their storage without relying on a potentially slower external drive, while also having some fun transferring files in the process.", "url": "https://www.theverge.com/2019/3/8/18251935/how-to-upgrade-your-ps4-pro-hard-drive-without-losing-games", "urlToImage": "https://cdn.vox-cdn.com/thumbor/SWgZfa405u-BYGms6-jXucwJ0ZQ=/0x284:2040x1352/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15861436/jbareham_190301_3267_0009.jpg", "publishedAt": "2019-03-08T14:00:00Z", "content": "If you have an extensive game library for your PlayStation 4 Pro, you may be thinking about increasing the size of your PS4 Pros hard drive (and thus, your game library). If youve never tinkered with a game console before, dont worry. Sony makes it fairly sim… [+7323 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "What is Facebook? Just ask Mark Zuckerberg", "description": "What is Facebook? Mark Zuckerberg has been asked that question over and over since 2006, and the answer keeps changing. Along the way, Facebook has grown from a site where people in colleges would accept each other as friends to one of the biggest and most in…", "url": "https://www.theverge.com/2019/3/8/18255269/facebook-mark-zuckerberg-definition-social-media-network-sharing-privacy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/sIycmXYlUtgRYI0GQGS6bbEgsGY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10595031/jbareham_180405_1777_facebook_0002.jpg", "publishedAt": "2019-03-08T14:00:00Z", "content": "What is Facebook? Mark Zuckerberg has been asked that question over and over since 2006, and the answer keeps changing. Along the way, Facebook has grown from a site where people in colleges would accept each other as friends to one of the biggest and most in… [+11456 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Stefan Etienne", "title": "How to expand your Xbox One X’s game storage", "description": "Microsoft makes it rather difficult to replace the Xbox One X’s hard drive — as we found out firsthand — but that doesn’t mean you can’t increase your overall game storage. Here’s how you can create an external HDD for your Xbox One X.", "url": "https://www.theverge.com/2019/3/8/18254711/xbox-one-xs-game-storage-expand-how-to", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Ubherg-Vr9ZOrNZs7bnt7FI6y2k=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15861437/jbareham_190301_3267_0005.jpg", "publishedAt": "2019-03-08T14:00:00Z", "content": "If you have a huge digital Xbox game library, then you might be wondering what happens once you run out of storage on the 1TB hard drive every stock Xbox One X ships with. Deleting your games to make space for other titles isnt fun, so Im going to walk you th… [+4810 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Loren Grush", "title": "SpaceX’s Crew Dragon splashes down in the Atlantic, bringing its first crucial test flight to an end", "description": "On Friday morning, SpaceX’s Crew Dragon capsule successfully splashed down in the Atlantic Ocean after spending nearly a week at the International Space Station. The plunge brings the spacecraft’s first test flight to an end. With the splashdown, SpaceX has p…", "url": "https://www.theverge.com/2019/3/8/18255060/spacex-crew-dragon-nasa-dm-1-international-space-station-landing-splashdown-atlantic-ocean", "urlToImage": "https://cdn.vox-cdn.com/thumbor/8IA7e37ymEKfKv2GCgCMgFzFBC4=/28x0:1405x721/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947230/Screen_Shot_2019_03_08_at_8.48.40_AM.png", "publishedAt": "2019-03-08T13:56:58Z", "content": "On Friday morning, SpaceX’s Crew Dragon capsule successfully splashed down in the Atlantic Ocean after spending nearly a week at the International Space Station. The plunge brings the spacecraft’s first test flight to an end. With the splashdown, SpaceX has p… [+3232 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Local Motors wants to prove 3D-printed self-driving shuttles are safe", "description": "An exclusive look at the first crash test footage of the startup’s Olli self-driving bus, which the company flung at a wall late last year.", "url": "https://www.theverge.com/2019/3/8/18255176/local-motors-olli-3d-printed-self-driving-shuttle-crash-test-footage", "urlToImage": "https://cdn.vox-cdn.com/thumbor/K-PRiu8aTfdtSe0vOyrmVqQPgmw=/0x110:2448x1392/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947173/Screen_Shot_2019_03_08_at_8.11.41_AM.png", "publishedAt": "2019-03-08T13:30:00Z", "content": "In a sun-drenched Arizona parking lot in late 2018, a pod-like autonomous shuttle smashed into a wall at 25 miles per hour. The glass on the sides of the shuttle shattered, the wheels buckled, and a few small pieces went flying. This wasnt an accident; it was… [+6520 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Windows 10 closes in on Microsoft’s 1 billion device goal", "description": "Windows 10 is now running on 800 million devices worldwide. The figure includes not only traditional laptop and desktop PCs, but also hybrids like the Surface Pro, consoles, and phones.", "url": "https://www.theverge.com/2019/3/8/18255934/windows-10-800-million-devices-microsoft-billion-goal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Cx7xjwWQ_5-Rni4_QqQ8_zszNdY=/0x147:2040x1215/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/3905540/windows2_2040.0.jpg", "publishedAt": "2019-03-08T13:04:03Z", "content": "Windows 10 is now running on 800 million devices worldwide, Microsoft has announced. The figure includes not only traditional laptop and desktop PCs, but also hybrids like the Surface Pro, consoles like the Xbox One X, and any phones that are still running th… [+826 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Samsung Galaxy Buds review: imperfectly acceptable", "description": "Getting as many things right as wrong", "url": "https://www.theverge.com/2019/3/8/18255221/samsung-galaxy-buds-headphones-truly-wireless-review-price-specs-features", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9r0mir1fOS14SOpJ25pAY3b_MyA=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14967305/akrales_190301_3262_0178.0.jpg", "publishedAt": "2019-03-08T13:00:00Z", "content": "When I was in high school, shopping for new earphones with a single £20 note as my budget, I used to dream of earbuds without the wire. It wasnt a complicated fantasy, just my ultra basic Sony buds sans fil, as the French would put it. It took a decade and a … [+8847 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Thomas Ricker", "title": "Ampler’s 2019 e-bikes look promising", "description": "Ampler is making numerous improvements to the underlying components and firmware. The bikes are also slightly cheaper this year, even as the base prices have increased.", "url": "https://www.theverge.com/2019/3/8/18255857/ampler-electric-bikes-price-availability", "urlToImage": "https://cdn.vox-cdn.com/thumbor/NR0U_H065ZNI7uXC60RIrgjcb1w=/0x1181:8256x5504/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15947063/Ampler_Curt.jpg", "publishedAt": "2019-03-08T12:09:03Z", "content": "Ampler is back with its 2019 lineup of electric bikes that feature integrated batteries and up to 100 kilometers (62 miles) of pedal-assisted range from a 250-watt rear-hub motor. While the bikes still look the same, the Estonia-based company (with its servic… [+1810 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Older GPS devices are facing their own mini Y2K bug next month", "description": "On April 6th, 2019, older GPS devices will be hit by the Week Rollover issue — a known bug that’s easily fixed. If you own a GPS device from a company like Garmin or TomTom, simply check it is up to date. Otherwise, contact the manufacturer to avoid future pr…", "url": "https://www.theverge.com/2019/3/8/18255847/gps-week-rollover-issue-2019-garmin-tomtom-devices-affected", "urlToImage": "https://cdn.vox-cdn.com/thumbor/CCfVgotZIZBnVvFlXVAbxxXDokc=/0x402:5616x3342/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7035891/14_GO_LIFESTYLE_TRAFFIC.jpg", "publishedAt": "2019-03-08T11:18:56Z", "content": "Do you own any GPS devices or use equipment that relies on GPS to function? If so, now is probably a good time to check whether or not those products are protected against the GPS Week Number Rollover issue a sort of mini Y2K Bug for GPS receivers that will c… [+2767 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Casey Newton", "title": "Why Facebook’s pivot to privacy could backfire", "description": "Mark Zuckerberg’s post announcing Facebook would pivot to privacy could amount to little more than a PR stunt. That would represent an epic folly for the company", "url": "https://www.theverge.com/interface/2019/3/8/18255480/facebook-pivot-privacy-mark-zuckerberg-pr-stunt", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-i_zSF0Jg2kLaPMEbTs_k_EYfXA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11560009/akrales_180614_1777_0154.jpg", "publishedAt": "2019-03-08T11:00:00Z", "content": "Programming note: Its time for The Interface to take its annual spring break trip to Austin for South By Southwest! Ill be interviewing Facebooks former chief security officer, Alex Stamos, at 2:30 PM local time on Saturday; and Craigslist founder Craig Newma… [+18260 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "The new Skype for Web is live, unless you use Safari, Firefox, Opera...", "description": "Microsoft’s Skype for Web refresh is here. You now no longer need to use the service’s standalone app to get access to features such as HD video calling and call recording.", "url": "https://www.theverge.com/2019/3/8/18255848/skype-for-web-hd-video-calling-recording-search-gallery-chrome-edge", "urlToImage": "https://cdn.vox-cdn.com/thumbor/TGncCC9Me4YNPP6m36zFZgbwBZA=/0x38:640x373/fit-in/1200x630/cdn.vox-cdn.com/assets/2361219/skypestock.jpg", "publishedAt": "2019-03-08T10:15:08Z", "content": "Microsofts Skype for Web refresh is here, meaning Chrome and Edge users no longer need to use the services standalone app to get access to features such as HD video calling and call recording. The service has also received a number of interface improvements d… [+936 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Hackers are reportedly cracking the iPhone using stolen Apple prototypes", "description": "A new Motherboard investigation this week claims there’s now a gray market for “dev-fused” iPhone prototypes that have been stolen from Apple’s production lines. They’re devices which are uniquely valuable for helping security researchers find vulnerabilities…", "url": "https://www.theverge.com/2019/3/7/18255509/apple-iphone-dev-fused-stolen-prototype-switchboard-hack-vulnerability", "urlToImage": "https://cdn.vox-cdn.com/thumbor/HTt4dPvgdSQXE6P7BA3wxLdE2F0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/3446716/iphone-verge-stock-1191.0.jpg", "publishedAt": "2019-03-08T01:55:38Z", "content": "We all know the story of the prototype iPhone 4 that was left at a bar, spoiling what could have been one of the biggest surprises in Apple history. \r\nBut have you heard the one about the stolen prototype iPhones that are still winding up in unintended hands … [+1267 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tasha Robinson", "title": "One of Captain Marvel’s post-credits scenes is great news for Avengers: Endgame", "description": "Yes, Captain Marvel has both a mid-credits scene and a post-credits scene, and while they’re both brief and one is just a visual gag, they’re both important parts of the story. One makes a direct connection between Avengers: Infinity War and the upcoming Aven…", "url": "https://www.theverge.com/2019/3/7/18255336/captain-marvel-post-credits-scene-avengers-endgame-flerken-alien-cat-goose-tesseract", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2gUrDmZsKmGarQpN6ORZNattOrI=/0x0:5760x3016/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15946257/CaptainMarvel5c805147a2d03.jpg", "publishedAt": "2019-03-08T00:34:13Z", "content": "Spoilers ahead for Captain Marvels mid-credits and post-credits scenes, for Avengers: Infinity War, and for one big gag in Captain Marvel itself.\r\nBack in 2008, when Nick Fury arrived at Tony Starks house to invite him to join the Avengers Initiative after th… [+6053 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "German regulators tell Tesla to drop ‘gas savings’ from pricing", "description": "The company will be more straightforward about sticker prices in the country starting March 20th. The pricing structure Tesla used has been called “scammy” and “confusing.”", "url": "https://www.theverge.com/2019/3/7/18255252/tesla-german-regulators-drop-gas-savings-price", "urlToImage": "https://cdn.vox-cdn.com/thumbor/K_bEH32Nktz7CKaS79jXcZk5hYU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13668774/tesla_model_3_0638.jpg", "publishedAt": "2019-03-07T22:47:55Z", "content": "Tesla will stop factoring estimated fuel savings into the price of its cars in Germany, according to Reuters. The German Centre for Protection against Unfair Competition said Wednesday that Tesla agreed to be more straightforward with pricing on its website b… [+1581 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "Valve lays off 13 employees, reportedly slashing VR hardware division", "description": "Valve has confirmed that it laid off 13 employees and a number of contractors, possibly from its virtual reality hardware division, despite rumors of a prototype headset in development.", "url": "https://www.theverge.com/2019/3/7/18255205/valve-employee-layoffs-hardware-vive-vr-division", "urlToImage": "https://cdn.vox-cdn.com/thumbor/_eIIv9ISMgfkIO0F45M_nR8DJgA=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6168701/Vive_Space_Pirates.0.jpg", "publishedAt": "2019-03-07T22:03:02Z", "content": "Gaming company Valve confirmed today that it has laid off several full-time employees and contractors, possibly from its virtual reality hardware team. Last month, 13 full time employees were let go and a portion of our contractor agreements were terminated. … [+2747 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Twitter will let users be much more specific when reporting tweets with personal information", "description": "Twitter is adding new options to its reporting process for tweets that share personal information, adding much more specific fields that users can highlight when submitting reports.", "url": "https://www.theverge.com/2019/3/7/18255238/twitter-report-tweets-personal-information-more-options-specific", "urlToImage": "https://cdn.vox-cdn.com/thumbor/31wcDz-dd7XKS5dJnkQVko0eII0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12645609/acastro_180827_1777_0002.jpg", "publishedAt": "2019-03-07T21:34:02Z", "content": "Twitter is adding new options to its reporting process for tweets that share personal information, adding much more specific fields that users can highlight when submitting reports.\r\nNow, when reporting a tweet that contains private information, users will be… [+1332 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Disney is ending its vault program, giving Disney+ a huge boost in the streaming wars", "description": "Disney+ will see all of Disney’s back catalogue made available on the platform, in a move that will effectively end its “Vault” program. It’s a big move for Disney, and critical to the company’s success.", "url": "https://www.theverge.com/2019/3/7/18254942/disney-vault-streaming-service-plus-animated-live-action", "urlToImage": "https://cdn.vox-cdn.com/thumbor/aoPhJAHGBY3ZdjvuZ1FH4QXiov0=/0x24:1200x652/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15945786/lion_king.jpg", "publishedAt": "2019-03-07T20:23:47Z", "content": "Disney+, the companys upcoming streaming service, will carry Disneys entire catalog of animated films, ending Disneys long-standing vault program. CEO Bob Iger told shareholders today that Disney+ at some point fairly soon after launch will carry films that t… [+4570 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Rachel Becker", "title": "Facebook outlines plans to curb anti-vax conspiracy theories", "description": "Under fire for serving up anti-vaccine propaganda, Facebook has announced that it will remove groups and pages that share anti-vaccine misinformation from its recommendations. The company also pledged that it will stop allowing advertisers to target people wh…", "url": "https://www.theverge.com/2019/3/7/18255107/facebook-anti-vaccine-misinformation-measles-outbreaks-group-page-recommendations-removal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mRsbBEAHbrYY0kVnjEEyueKxHno=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10595581/jbareham_180405_1777_facebook_0003.jpg", "publishedAt": "2019-03-07T20:01:59Z", "content": "Under fire for serving up anti-vaccine propaganda, Facebook announced today that it will remove groups and pages that share anti-vaccine misinformation from its recommendations. The company also pledged that it will stop allowing advertisers to target people … [+3959 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "How movie sites are dealing with review-bombing trolls", "description": "After an online backlash against Captain Marvel, movie review platforms Rotten Tomatoes and Letterboxd are removing features that trolls can exploit to tank a movie’s rating before launch.", "url": "https://www.theverge.com/2019/3/7/18254548/film-review-sites-captain-marvel-bombing-changes-rotten-tomatoes-letterboxd", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Is0gmCL2ZyU3NqiwqgYpXHMNSsw=/0x0:5760x3016/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15589320/CaptainMarvel5c4f983da9e9c.jpg", "publishedAt": "2019-03-07T19:32:37Z", "content": "Last week, review site Rotten Tomatoes disabled a couple of long-standing features to fight a new kind of internet culture war. In advance of Captain Marvels release, it stopped letting users leave comments before a movie launches, and it removed a badge show… [+6049 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nilay Patel", "title": "Sonos Amp review: all kinds of power", "description": "Sonos reminds us that it can do almost anything", "url": "https://www.theverge.com/2019/3/7/18254803/sonos-amp-review-speaker-specs-features-price", "urlToImage": "https://cdn.vox-cdn.com/thumbor/aylfryc4B5EBoObZkTNsXuBqWnA=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15945632/akrales_190306_3274_0069.jpg", "publishedAt": "2019-03-07T19:23:36Z", "content": "One of the main reasons to buy into the Sonos audio ecosystem instead of the smart speakers from Amazon, Google, or Apple is overall flexibility: Sonos simply makes more kinds of audio products than any of the other players, and that means you can build a rel… [+9675 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Facebook Messenger had a vulnerability that could let hackers see who you contact", "description": "A previously reported Facebook vulnerability has now been similarly found in Facebook Messenger as well. Security research group Imperva launched a sample attack in Facebook Messenger that allowed “any website to expose who you have been messaging with.”", "url": "https://www.theverge.com/2019/3/7/18254788/facebook-messenger-vulnerability-attack-imperva-iframe-malicious", "urlToImage": "https://cdn.vox-cdn.com/thumbor/O3t-YbUpkAz9E1kFH_L2s4mUUUY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12742467/acastro_180828_1777_facebook_0001.jpg", "publishedAt": "2019-03-07T19:00:00Z", "content": "A previously reported Facebook vulnerability was similarly found in the companys Messenger product, according to security research group Imperva. Nearly a year ago, Imperva researchers discovered that, through Messenger, a hacker could use any website to expo… [+2030 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Natt Garun", "title": "Airbnb to acquire last-minute hotel booking service HotelTonight", "description": "Airbnb today announced it has signed an agreement to acquire last-minute hotel booking app HotelTonight for an undisclosed sum. The acquisition comes just a little over a year after Airbnb first launched Airbnb Plus, a subsection of its service that includes …", "url": "https://www.theverge.com/2019/3/7/18254988/airbnb-hoteltonight-acquisition-deal-hotel-booking-platform", "urlToImage": "https://cdn.vox-cdn.com/thumbor/k1E5Ihr5Ai2ptCHEHJqwMajZb78=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7944285/akrales_161202_1327_A_0122_v2.0.jpg", "publishedAt": "2019-03-07T18:46:39Z", "content": "Airbnb today announced it has signed an agreement to acquire last-minute hotel booking app HotelTonight for an undisclosed sum. The acquisition comes just a little over a year after Airbnb first launched Airbnb Plus, a subsection of its service that includes … [+926 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Everything coming to Hulu, Amazon Prime, and HBO Now in March 2019", "description": "As the weather warms up, it might be time to revisit old superhero classics and recent blockbusters. We’re not quite in springtime yet, but with Avengers: Endgame’s upcoming April release, why not start getting ready?", "url": "https://www.theverge.com/2019/3/7/18244773/hulu-amazon-prime-hbo-now-march-2019-new-streaming-dark-knight-case-against-adnan-syed", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vJzzYmdPDSxE5mrlUk4mR4AGxu4=/0x120:1490x900/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14962046/4a1dfa7aac75176383d7371779cc287d6f31592198ff59a61ce0bf0e7ee16c01.jpg", "publishedAt": "2019-03-07T18:43:05Z", "content": "As the weather warms up slightly, it might be time to revisit old superhero classics and recent blockbusters. We havent reached springtime, but the new crop of summer action movies is already being phased in. With Captain Marvel in theaters and Avengers: Endg… [+9117 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "Tim Cook is now Tim Apple on Twitter", "description": "Last night at a typical American Workforce Policy Advisory Board meeting, President Trump flubbed Cook’s name and unmistakably called him “Tim Apple. Shortly after The Verge first reported the mistake, it took off on social media, ultimately becoming a trendi…", "url": "https://www.theverge.com/2019/3/7/18254958/tim-cook-apple-trump-username-changed-twitter-name-potus-president", "urlToImage": "https://cdn.vox-cdn.com/thumbor/LG3B6yC-zR7umJxv1u_q9D3S7Ok=/0x18:833x454/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15945555/Screen_Shot_2019_03_07_at_1.29.12_PM.png", "publishedAt": "2019-03-07T18:30:44Z", "content": "Apple CEO Tim Cook has slyly changed his name to Tim on Twitter, an apparent reference to the president of the United States, perhaps mistakenly, messing up his name at a meeting.\r\nLast night at a typical American Workforce Policy Advisory Board meeting, Pres… [+669 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "T-Mobile tries to woo regulators on Sprint merger with promise of amazing 5G home internet", "description": "T-Mobile says it’ll launch a 5G home internet service with fast speeds, easy installation, and low prices that will shake up the cable industry. But it’s all part of convincing regulators to approve its Sprint merger.", "url": "https://www.theverge.com/2019/3/7/18254853/tmobile-sprint-merger-5g-home-internet-service-promises", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-l8CTvW7N4bDE-6i9rPMseIzlus=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10752769/acasatro_180430_1777_sprint_Tmobile_0002.jpg", "publishedAt": "2019-03-07T18:16:15Z", "content": "T-Mobile says itll launch a 5G home internet service with fast speeds, easy installation, and low prices that will reach half of all US homes within five years and meaningfully shake up the woefully anti-competitive cable industry. Theres just one catch: T-Mo… [+3926 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Loren Grush", "title": "SpaceX’s Crew Dragon has proved itself in space — now it has to get back to Earth in one piece", "description": "The first ever test flight of SpaceX’s new Crew Dragon capsule will come to an end tomorrow, when the spacecraft detaches from the International Space Station and attempts to splash down in the Atlantic Ocean using a suite of parachutes. This is the last majo…", "url": "https://www.theverge.com/2019/3/7/18254549/spacex-crew-dragon-iss-nasa-landing-parachutes-splashdown", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ULntbweL2EB24Ae6Zxj7mAEsv2A=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15945367/ksc_20160813_ph_spx01_0002.jpg", "publishedAt": "2019-03-07T18:06:15Z", "content": "The first ever test flight of SpaceX’s new Crew Dragon capsule will come to an end tomorrow, when the spacecraft detaches from the International Space Station and attempts to splash down in the Atlantic Ocean using a suite of parachutes. This is the last majo… [+5531 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dan Seifert", "title": "The best part of the Galaxy S10’s hole punch is the potential for wallpapers", "description": "Samsung’s new phones have a unique design for the front camera, which provides opportunity for some fun wallpapers.", "url": "https://www.theverge.com/2019/3/7/18254857/samsung-galaxy-s10-hole-punch-wallpapers-reddit-r2d2", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2S9fkWWY0Gzdmr7AB3q5bp2YQ2A=/0x261:2040x1329/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14843652/akrales_190228_3255_0167.jpg", "publishedAt": "2019-03-07T17:29:14Z", "content": "Samsung’s new Galaxy S10, S10 Plus, and S10E have many new advancements, but the biggest change to their designs compared to last year’s models is the new hole-punch display. In the hole punch cutout, which is round on the S10 and S10E and oval on the S10 Plu… [+1371 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Disney’s Star Wars: Galaxy’s Edge theme parks will open earlier than expected", "description": "Disney’s Star Wars: Galaxy’s Edge theme parks will open earlier than expected this year: May 31st at Disney World Resort in Florida and August 29th at Disney’s Hollywood Studios in California.", "url": "https://www.theverge.com/2019/3/7/18254818/disney-star-wars-galaxys-edge-theme-park-open-date-may-august-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/_SUJ5JiBJIgVWYrYKXD04zCUx0I=/0x0:1526x799/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15945279/Screen_Shot_2019_03_07_at_12.01.21_PM.png", "publishedAt": "2019-03-07T17:24:25Z", "content": "We now know when to book our tickets to Disney’s brand-new Star Wars theme parks. The company announced today that it will open Star Wars: Galaxy’s Edge on May 31st in Florida’s Disney World Resort and on August 29th at Disneyland in California. There’s a cav… [+503 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Russell Brandom", "title": "The messy details behind Facebook’s messaging plans", "description": "On Wednesday, Mark Zuckerberg described his plan to bring together Facebook Messenger, Instagram and Whatsapp into a single messaging platform, integrated with protocols like SMS.", "url": "https://www.theverge.com/2019/3/7/18254715/facebook-instagram-whatsapp-messaging-plan-single-encrypted-ephemeral-news-feed", "urlToImage": "https://cdn.vox-cdn.com/thumbor/1aqmehQMGoWIR2SQqeVJQ64gbCo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10302391/akrales_180215_2310_0031.jpg", "publishedAt": "2019-03-07T17:21:28Z", "content": "It feels strange to say this in 2019, but one of the biggest tech companies in the world is betting its future on interoperable messaging. In a major announcement on Wednesday, Mark Zuckerberg announced a shift in focus for Facebook, moving from the News Feed… [+7089 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "Facebook plans to tie itself together as regulators debate tearing it apart", "description": "In a lengthy blog post yesterday, Facebook CEO Mark Zuckerberg said that he wants Facebook to focus on encryption and privacy by combining its messaging products, but lawmakers and economists are worried that Zuckerberg may be attempting to outflank regulator…", "url": "https://www.theverge.com/2019/3/7/18254717/facebook-instagram-whatsapp-regulation-antitrust-mark-zuckerberg-klobuchar-hawley-blumenthal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/5YWLJ_thtrDlwNsqPnHhDkRvhU4=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10617075/acastro_180409_1777_facebook_zuckerberg_0002.jpg", "publishedAt": "2019-03-07T17:18:24Z", "content": "In a lengthy blog post yesterday, Facebook CEO Mark Zuckerberg said that he wants Facebook to focus on encryption and privacy by combining its messaging products, but lawmakers and economists are worried that Zuckerberg may be attempting to outflank regulator… [+4506 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Will Harris", "title": "With the two-part episode Identity, The Orville has matured into serious science fiction", "description": "Seth MacFarlane’s Star Trek homage has been divisive since it launched in 2017. Its toilet humor and pop culture references have earned comparisons to MacFarlane’s animated series Family Guy. But in its second season, the show has put a new focus on developin…", "url": "https://www.theverge.com/2019/3/7/18254737/identity-the-orville-star-trek-seth-macfarlane-two-part-episode-science-fiction", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ksFO1kBdJwsulygqpRyqTkcsYJk=/0x0:3900x2042/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15945181/OR_S2_EP208_Sc76_105_MB_0242.jpg", "publishedAt": "2019-03-07T17:10:28Z", "content": "The Star Trek homage series The Orville is the Rodney Dangerfield of science fiction shows: it doesnt get much respect, especially from genre fans. Whether thats because of the tonally awkward blend of comedy and drama, the incorporation of 21st century pop c… [+9671 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Samsung Galaxy S10 preorder bonus ends today, and save $150 on Zotac’s RTX 2080", "description": "Today is the last day to get a $130 gift card when you preorder Samsung’s new phone. Also, there are some good deals on Sonos One speakers, the PlayStation Classic, Zotac RTX 2080 graphics cards, and more today.", "url": "https://www.theverge.com/good-deals/2019/3/7/18254629/samsung-galaxy-s10-preorder-bonus-zotac-rtx-2080-sale-discount-deal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/XqIlcgEO7i6zUo57_yEsCdMelC4=/0x284:2040x1352/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13975971/jbareham_190213_3183_0081_S10_s10_.jpg", "publishedAt": "2019-03-07T16:40:25Z", "content": "Today is the last day to preorder a Samsung Galaxy S10, which means that its also the last day to get a free $130 Samsung gift card with your purchase of either the $899 Galaxy S10, or the $999 Galaxy S10 Plus (but not the S10E). The Samsung Galaxy Buds were … [+2417 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "Facebook knows Facebook isn’t the future", "description": "Zuckerberg is trying to redefine Facebook. People are now demanding privacy and ephemerality, and the Facebook of today, Zuckerberg seems to have concluded, just can’t offer that.", "url": "https://www.theverge.com/2019/3/7/18253547/facebook-zuckerberg-future-blog-post-redefining-reputation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/C5qe6J_kl4CXIBo0X1gyi7hbwUs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11742003/acastro_180720_1777_facebook_0001.jpg", "publishedAt": "2019-03-07T15:15:12Z", "content": "Five paragraphs into the monster blog post that Facebook CEO Mark Zuckerberg published yesterday afternoon, he makes a damning, strangely understated admission: frankly we dont currently have a strong reputation for building privacy protective services.\r\nThat… [+5426 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Koenigsegg’s Jesko is a 300 mph projectile on wheels", "description": "The Koenigsegg Jesko, which was announced at the 2019 Geneva Motor Show, is a candidate to become the first road-legal car to break the 300 mph barrier. Only 125 Jesko cars will ever be made, and the majority of those orders have already been grabbed by eager…", "url": "https://www.theverge.com/2019/3/7/18254447/koenigsegg-jesko-megacar-specs-top-speed-photos-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/e0kv_EULSLwgZ_BPe-Bj4zfBF_s=/0x27:2040x1095/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15944894/koenigsegg_jesko_vladsavov.jpg", "publishedAt": "2019-03-07T14:30:36Z", "content": "That’s more than one football field per second, end zones included It takes a lot for a petrol-fueled car to nudge out all of the hyper electrics that attract eyeballs at the Geneva Motor Show, but Koenigsegg has done it. The new Jesko by Koenigsegg, named af… [+3549 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "The original Diablo is now available on GOG.com", "description": "Blizzard and GOG.com have partnered to bring the original 1996 RPG Diablo to the classic games service. It’s available now with Windows 10 support and no DRM.", "url": "https://www.theverge.com/2019/3/7/18254558/diablo-classic-digital-gog-blizzard-windows-10-purchase", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ihhb-MWToZIzMUjSD5g5Mk7T_o8=/0x50:2560x1390/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15944855/unnamed.jpg", "publishedAt": "2019-03-07T14:27:13Z", "content": "If the announcement of the mobile Diablo Immortal left you wishing for something a little more old-school, Blizzard has just the thing. Today, the developer announced that the original demon-slaying RPG Diablo is now available to purchase on classic games ser… [+1197 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Elizabeth Lopatto", "title": "Can a judge order Elon Musk to delete his Twitter account?", "description": "Last week, the Securities and Exchange Commission filed paperwork to consider Musk in contempt of court. That’s because the SEC says the Tesla CEO broke his settlement agreement — by sending out a tweet that disclosed material information about the electric c…", "url": "https://www.theverge.com/2019/3/7/18253360/elon-musk-twitter-account-delete-judge-court-order-contempt-sec-tesla-tweet", "urlToImage": "https://cdn.vox-cdn.com/thumbor/GtNo7ovTDytjH7RvnT_BANM7vAw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13177671/acastro_180928_1777_elon_0001.jpg", "publishedAt": "2019-03-07T14:00:00Z", "content": "Elon Musks tweets have riled up enforcement officials again, and the real question now is what the legal system is going to do about them. Last week, the Securities and Exchange Commission filed paperwork to consider Musk in contempt of court. Thats because t… [+6335 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "Samsung Galaxy Watch Active review: less fun but still a good time", "description": "The rotating bezel is missed, but this is still a very good smartwatch.", "url": "https://www.theverge.com/2019/3/7/18253561/samsung-galaxy-watch-active-review-smartwatch-fitness-specs-features-price", "urlToImage": "https://cdn.vox-cdn.com/thumbor/V3SCYV3xMDSO0EdsLzyz6Mq_dlU=/0x248:2040x1316/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15944637/DSCF1360.jpg", "publishedAt": "2019-03-07T14:00:00Z", "content": "Samsungs Galaxy Watch Active is the follow-up to its Gear Sport, a stripped-down smartwatch focused on fitness tracking and glanceable notifications. At just $200, its much cheaper than the flagship $350 Galaxy Watch and the Apple Watch Series 4. Saving money… [+10509 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "How Bird plans to blanket the world with electric scooters without going bankrupt", "description": "Bird is outsourcing the scooter-sharing business to aspiring entrepreneurs in countries outside the US and Europe. In this way Bird can inspire the creation of new scooter companies that won’t directly compete with its own service, as well as orchestrate the …", "url": "https://www.theverge.com/2019/3/7/18253522/bird-platform-scooter-new-zealand-canada-latin-america", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mPxHK6IOgxRdvBOb_IB_B3UToig=/0x218:3000x1789/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11716641/947735006.jpg.jpg", "publishedAt": "2019-03-07T14:00:00Z", "content": "Operating an electric scooter-sharing service is expensive and hard. The scooters break down, or they get vandalized or impounded by local law enforcement. Scaling that business globally, like Bird and Lime are trying to do, is even harder. Every scooter comp… [+4072 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Corsair’s K83 Wireless keyboard has a trackpad and half a gamepad built in", "description": "The K83 Wireless is Corsair’s new attempt at a keyboard that you can use on your lap in a living room. In addition to its keyboard, the K83 also includes a joystick, two shoulder buttons, and a trackpad.", "url": "https://www.theverge.com/circuitbreaker/2019/3/7/18254411/corsairs-k83-wireless-keyboard-release-date-news-features", "urlToImage": "https://cdn.vox-cdn.com/thumbor/VPB73y1RCCrpGEPnKEQpSP2_B18=/0x122:1800x1064/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15944718/CORSAIR_K83_1111.jpg", "publishedAt": "2019-03-07T14:00:00Z", "content": "Corsairs latest keyboard, the K83 Wireless, is the manufacturers new attempt at a keyboard that you can use on your lap in a living room. In addition to a laptop-style 76-key keyboard, the K83 also includes a joystick, two shoulder buttons, and a trackpad tha… [+1896 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dan Seifert", "title": "Leica’s new Q2 has a 47-megapixel sensor", "description": "After nearly four years, Leica has finally announced the successor to one of its most popular cameras. The new Q2 has way more resolution and better performance, but retains much of what made the original so desirable.", "url": "https://www.theverge.com/2019/3/7/18253745/leica-q2-camera-announcement-price-features-specs", "urlToImage": "https://cdn.vox-cdn.com/thumbor/kT0eJ3KAale8q_lEn2MT0_337zM=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15578243/jbareham_190221_3239_0010.jpg", "publishedAt": "2019-03-07T14:00:00Z", "content": "Leicas compact-yet-powerful Q was one of the most interesting cameras released in the past few years. A true photographers camera, the Q combined a large full-frame sensor with a fast, sharp lens in a camera small enough to be carried almost everywhere. Nearl… [+4087 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "The PS4’s Remote Play update now lets you stream to iOS devices", "description": "You can now use the PS4’s Remote Play functionality on iOS devices, thanks to version 6.50 of the console’s firmware. Now, you can remotely play your PS4 games from an iPhone or iPad over Wi-Fi.", "url": "https://www.theverge.com/2019/3/7/18254514/ps4-remote-play-ios-firmware-6-50-iphone-ipad-game-streaming", "urlToImage": "https://cdn.vox-cdn.com/thumbor/oH17RMoLSsmFfbuZFhck6XchBYg=/0x103:1100x679/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13062843/IMG_5121.1419980089.jpg", "publishedAt": "2019-03-07T13:37:11Z", "content": "You can now use the PS4s Remote Play functionality on iOS devices, thanks to version 6.50 of the consoles firmware, allowing you to remotely play your PS4 games from an iPhone or iPad (via Engadget). To access it, youll need to download the Remote Play app fo… [+1505 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "YouTube’s family vloggers worry about their future amid comment section crackdown", "description": "YouTube’s decision to close comment sections on nearly all videos that feature minors has caused concern among the family vlogging community. Two family vloggers speak to The Verge about what happens next.", "url": "https://www.theverge.com/2019/3/7/18250689/youtube-family-vloggers-comments-sections-minors-predator-behavior-monetization", "urlToImage": "https://cdn.vox-cdn.com/thumbor/CBjGjHjOAsO5rfGJOrHUds16Gk0=/0x0:2770x1450/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15938934/Screen_Shot_2019_03_06_at_5.30.12_PM.png", "publishedAt": "2019-03-07T13:08:33Z", "content": "Without comments, YouTube is just ‘short films’ Jon and Danielle Murray, who started vlogging about their family life with six daughters almost four years ago, are debating whether they should abandon YouTube entirely. Policy changes on the platform mean thei… [+5756 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Microsoft’s cheapest Surface Book 2 could get a quad-core CPU soon", "description": "Microsoft looks set to refresh its cheapest Surface Book 2 laptop in the coming weeks. The biggest change is expected to be the laptop’s CPU, which appears to be being upgraded from a dual-core i5-7300U to a quad core i5-8350U.", "url": "https://www.theverge.com/2019/3/7/18254456/microsoft-surface-book-2-quad-core-i5-release-date-news-specs", "urlToImage": "https://cdn.vox-cdn.com/thumbor/NnbhnOQaNtr3ud9POHoPLfPBADc=/0x179:2040x1247/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9687307/akrales_171115_2141_0006.jpg", "publishedAt": "2019-03-07T12:34:55Z", "content": "Microsoft looks set to refresh its cheapest Surface Book 2 laptop in the coming weeks, according to retailer listings first spotted by WinFuture. The biggest change is expected to be the laptops CPU, which appears to be getting a bump from a dual-core i5-7300… [+800 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sam Byford", "title": "The best Chinese phones Americans can’t buy", "description": "The American smartphone market is an increasingly boring place to be. You have Apple and Samsung at the top, LG in a distant third, then Motorola and maybe the occasional wildcard option like Google and OnePlus. You could be forgiven for having lost interest …", "url": "https://www.theverge.com/2019/3/7/18254348/the-best-chinese-phones-not-available-us", "urlToImage": "https://cdn.vox-cdn.com/thumbor/BYwoQxtOEYJj5NueCkVY0Or435c=/0x80:2040x1148/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15944643/DSCF6931.jpg", "publishedAt": "2019-03-07T12:30:00Z", "content": "2019 edition The American smartphone market is an increasingly boring place to be. You have Apple and Samsung at the top, LG in a distant third, then Motorola, and maybe the occasional wildcard option like Google and OnePlus collectively making up less than t… [+9146 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "The last Blockbuster in America is now the last in the world", "description": "Blockbuster’s only remaining Australian store is closing on March 31st, meaning the Blockbuster located in Bend, Oregon will soon be the last Blockbuster in the world. The Australian store located in Morley, Western Australia, said that its last day of rentin…", "url": "https://www.theverge.com/2019/3/7/18254381/last-blockbuster-usa-world-australia-closing", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mLoXX6udzGgWijqGTW2TfFxE4QQ=/0x129:1800x1071/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12740243/blockbuster.jpg", "publishedAt": "2019-03-07T08:38:10Z", "content": "Blockbuster’s only remaining Australian store is closing on March 31st, meaning the Blockbuster located in Bend, Oregon will soon be the last Blockbuster in the world (via CNN ). In an announcement posted on its Facebook page, the Australian store located in … [+820 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Volkswagen’s dune buggy is an electric shot of nostalgia", "description": "The Volkswagen ID Buggy concept car unveiled at the Geneva Motor Show 2019 is an example of what VW can do with its Modular Electric Tooklit (MEB) platform. It shows the versatility of the company’s electric powertrain and technology and teases a future of in…", "url": "https://www.theverge.com/2019/3/7/18254329/volkswagen-id-buggy-electric-concept-car-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/iGI7EOteh9LoHYEOry2KrWgcsFc=/0x80:2040x1148/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15944605/vsavov_vw_buggy_geneva19.jpg", "publishedAt": "2019-03-07T07:33:25Z", "content": "Dune buggies, according to Volkswagen and some senior Verge staff members, used to be hip. Im told that young people used to once go driving on California beaches instead of worrying about crippling student loan debt, uncertain job prospects, and unaffordable… [+2783 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Tesla launches faster third generation Supercharger", "description": "The new Superchargers will be able to charge Tesla’s cars faster — especially Model 3s. The first one opened Wednesday in Fremont, California, with more coming in April.", "url": "https://www.theverge.com/2019/3/6/18253618/tesla-supercharger-250kw-v3-specs-location", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mEmmLR3ctlOFQD_WQGN2tD9lUSM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13546746/sokane_181116_3101_fremont_0005.jpg", "publishedAt": "2019-03-07T04:00:01Z", "content": "Tesla unveiled the third generation of its Supercharger charging stations during an event at its Fremont, California headquarters Wednesday evening. The new V3 Superchargers are capable of charging the companys cars at a rate of 250kW, which Tesla says is fas… [+1971 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Rachel Becker", "title": "The FDA shakeup could stall e-cigarette regulations", "description": "The sudden resignation of Food and Drug Administration Commissioner Scott Gottlieb yesterday has public health experts worried that progress on e-cigarette regulations could stall, or even stop. The vape industry, however, may benefit from the shakeup.", "url": "https://www.theverge.com/2019/3/6/18253963/fda-scott-gottlieb-resignation-vape-companies-electronic-cigarette-regulation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/kouHZM45d8UPNTBBjmE-vFYlKTI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13432271/akrales_181108_3053_0035.jpg", "publishedAt": "2019-03-07T02:17:35Z", "content": "Food and Drug Administration Commissioner Scott Gottliebs sudden resignation yesterday has public health experts worried that progress on e-cigarette regulations could stall, or even stop. \r\nThe news comes just a few days after Gottlieb reportedly brought a p… [+5558 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "BioWare confirms Anthem is crashing PS4s, will fix in next week’s patch", "description": "If you’ve been wondering when it’ll be safe to play Anthem on your PlayStation 4 — you know, given the reports of some PS4s spontaneously powering down in the middle of a game — developer BioWare now has an answer. Two answers, actually. BioWare’s online gami…", "url": "https://www.theverge.com/2019/3/6/18254041/bioware-confirms-anthem-is-crashing-ps4-fix-patch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/KiKF6d0373c5Q-j9IsF7Fj1nBAM=/0x29:1454x790/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14722871/anthem_screenshot_launch_01.jpg.adapt.crop16x9.818p.jpg", "publishedAt": "2019-03-07T02:07:47Z", "content": "If you’ve been wondering when it’ll be safe to play Anthem on your PlayStation 4 — you know, given the reports of some PS4s spontaneously powering down in the middle of a game — developer BioWare now has an answer. Two answers, actually. BioWare’s online gami… [+1288 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Colin Lecher", "title": "Huawei is suing the US for banning the government from using its equipment", "description": "Huawei is suing the United States over policies banning the use of the company’s equipment by the government. It’s the latest escalation in a continuing battle over Huawei’s position in the US.", "url": "https://www.theverge.com/2019/3/6/18249974/huawei-lawsuit-china-sales-policy-government-security-spying", "urlToImage": "https://cdn.vox-cdn.com/thumbor/4NC1XGi0Alxr7AM79W1qK2E4DhA=/0x141:2040x1209/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10538829/VRG_ILLO_1777_Huawei_004.jpg", "publishedAt": "2019-03-07T02:00:00Z", "content": "Huawei is suing the United States over policies banning the use of the company’s equipment by the government. It’s the latest escalation in a continuing battle over Huawei’s position in the US. The suit alleges that policies passed by Congress last year as pa… [+2172 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Nintendo just announced a Labo VR kit for the Switch", "description": "Nintendo announced a new virtual reality kit for the Switch, which uses the Labo line of DIY cardboard accessories to create VR goggles and add-ons.", "url": "https://www.theverge.com/2019/3/6/18254019/nintendo-labo-vr-kit-switch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/c04Ssf8T3AXX-q2I-fDBONb3KPs=/0x37:1024x573/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15944034/Switch_NintendoLabo_VRKit_ToyCon_VRGoggles.jpg", "publishedAt": "2019-03-07T01:21:08Z", "content": "Nintendos getting into virtual reality, but not in the way you might expect. Today the gaming giant announced the latest in its Labo line of DIY cardboard accessories, which turns the Nintendo Switch into a makeshift VR kit.\r\nAs with previous Labo sets, there… [+1335 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Casey Newton", "title": "Facebook’s pivot to privacy has huge implications — if it’s real", "description": "Mark Zuckerberg’s new plan to pivot Facebook privacy means investing most of its energy into groups and messaging products like Messenger and WhatsApp. It also means Facebook could face new challenges: making money differently, regulation, and getting banned …", "url": "https://www.theverge.com/interface/2019/3/6/18253922/facebook-privacy-meaning-implications-mark-zuckerberg-pivot-analysis-interface-casey-newton", "urlToImage": "https://cdn.vox-cdn.com/thumbor/t1lC62Pwua8rtIRv_1iBJ6miu80=/0x98:1020x632/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15859417/mark-zuckerberg-theverge-stock-2_1020.0.1467914004.jpg", "publishedAt": "2019-03-07T00:35:15Z", "content": "By 2015, Mark Zuckerberg had grown uncomfortable with his messaging history. His old instant messages had gotten him into trouble in the past people are still tweeting juvenile IMs from his college days and the 2014 Sony hack had made him more concerned about… [+14555 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Anthem’s best bug yet turns level one guns into the strongest weapons in the game", "description": "EA’s online shooter Anthem is building a reputation for featuring some pretty perplexing bugs, and the latest discovery from the game’s intrepid community may be the best one yet. As discovered by Reddit user YeetLordSupreme, the game’s level one firearms are…", "url": "https://www.theverge.com/2019/3/6/18253858/anthem-game-bug-level-one-weapon-best-gun-ea", "urlToImage": "https://cdn.vox-cdn.com/thumbor/JK0KaS5KXeeVKHA1-Ds1lUQplB8=/0x29:1454x790/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15943888/anthem_screenshots_05.jpg.adapt.crop16x9.818p.jpg", "publishedAt": "2019-03-06T23:43:37Z", "content": "EAs online shooter Anthem is building a reputation for featuring some pretty perplexing bugs, and the latest discovery from the games intrepid community may be the best one yet. As discovered by Reddit user YeetLordSupreme, the games level one firearms the mo… [+2345 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Google can now repair your broken Pixel 3 or Pixel 3 XL", "description": "Google’s US-only repair service has now added mail-in service to fix your broken Pixel 3 and Pixel 3 XL. Almost five months after the phones’ launch, your last and only resort for repair isn’t your local walk-in repair shop.", "url": "https://www.theverge.com/mobile/2019/3/6/18253804/pixel-3-xl-repair-solution-google-mail-in", "urlToImage": "https://cdn.vox-cdn.com/thumbor/D6ydQyKQNKFn-k30gDb9j64ZOvA=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13266075/jbareham_181011_2989_0486.jpg", "publishedAt": "2019-03-06T23:03:45Z", "content": "Google has updated its US-only repair service to include the Pixel 3 and Pixel 3 XL as being eligible for mail-in repair. The inclusion of its third-generation Pixel phones comes several months after their October 2018 launch. Until now, owners with broken Pi… [+1060 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "The president just called the CEO of Apple ‘Tim Apple’", "description": "Tim Cook is a pretty well-known figure in the business world. I know a lot of people don’t care about computers and that’s fine, but if you’re in the industry or having some sort of professional interaction with him, I have to think people usually know his na…", "url": "https://www.theverge.com/2019/3/6/18253785/donald-trump-tim-apple-cook-ceo-name", "urlToImage": "https://cdn.vox-cdn.com/thumbor/GMw93udsK9CTKzOn69-7pPcCXHc=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15934330/697929772.jpg.jpg", "publishedAt": "2019-03-06T22:36:25Z", "content": "Tim Cook is a pretty well-known figure in the business world. I know a lot of people don’t care about computers and that’s fine, but if you’re in the industry or having some sort of professional interaction with him, I have to think people usually know his na… [+1485 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "Facebook takes a shot at Apple in China, says it won’t store data in certain countries", "description": "In a manifesto on privacy and security, Facebook CEO Mark Zuckerberg committed to keeping user data out of some countries, apparently locking Facebook out of the Chinese market.", "url": "https://www.theverge.com/2019/3/6/18253608/facebook-zuckerberg-letter-user-data-security-china-ban-apple-privacy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/AQobikR8RxxlVJDllyQbz_XXg6U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10572757/wjoel_180319_2394_facebook_006.0.jpg", "publishedAt": "2019-03-06T21:35:41Z", "content": "In a long manifesto about Facebooks future, CEO Mark Zuckerberg said the company is willing to be banned in countries that object to its new focus on privacy, specifically the emphasis on secure data storage. That might sink any chance of Facebook operating i… [+4126 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "Amazon is shutting down all of its US kiosks in favor of expanding its physical stores", "description": "Amazon is shutting down all of its US pop-up kiosks as it shifts its strategy toward growing its physical stores. The company announced that it will be shuttering its pop-up kiosks, and all 87 mini-stores are expected to close by April 29th.", "url": "https://www.theverge.com/2019/3/6/18253650/amazon-pop-up-kiosk-4-star-books-retail-stores", "urlToImage": "https://cdn.vox-cdn.com/thumbor/aAIh57EENhMtuHaYwRqig2eXWo4=/0x39:558x331/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15923715/consult_image_739x370._CB482807251_.jpg", "publishedAt": "2019-03-06T21:24:43Z", "content": "Amazon is shutting down all of its US pop-up kiosks as it shifts its strategy toward growing other forms of physical stores. First reported by The Wall Street Journal, the company announced that it will be shuttering its pop-up kiosks, and all 87 mini-stores … [+1316 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "The Galaxy S10 and LG G8 are the latest phones to get T-Mobile’s spam-fighting call verification", "description": "T-Mobile announced that it’s expanding its Caller Verified feature to five new phones, including the Galaxy S10E, S10, and S10 Plus, along with the forthcoming LG G8 ThinQ and the LG Aristo 3.", "url": "https://www.theverge.com/2019/3/6/18253407/galaxy-s10-lg-g8-t-mobile-call-verification-spam-robocalls", "urlToImage": "https://cdn.vox-cdn.com/thumbor/iT0elw9H9IhI5S9u5Z--lhaG53E=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10355789/akrales_180305_2355_0012.jpg", "publishedAt": "2019-03-06T21:17:48Z", "content": "T-Mobile announced today that it’s expanding its robocall-fighting Caller Verified feature to five new phones, including the Galaxy S10E, S10, and S10 Plus, along with the forthcoming LG G8 ThinQ and the LG Aristo 3. It’s not a perfect solution to spam calls,… [+1658 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Valve says it won’t publish game about raping women, after ‘significant discussion’", "description": "Valve has at last responded to a mounting controversy around an indie game designed entirely around violent sexual assault of women. The statement, posted to the Steam Blog earlier today, makes clear that Valve will in fact not distribute the visual novel, wh…", "url": "https://www.theverge.com/2019/3/6/18253664/valve-steam-rape-day-ban-sexual-assault-moderation-content-policy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/UjLcQjas-Ltb_kcBiRrfIQEA-vw=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10817781/acastro_180509_1777_steam_0002.jpg", "publishedAt": "2019-03-06T21:09:30Z", "content": "Valve has at last responded to a mounting controversy concerning an indie game designed entirely around the violent sexual assault of women. The statement, posted to the Steam Blog earlier today, makes clear that Valve will in fact not distribute the visual n… [+3714 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Devil May Cry 5 is 25 percent off, and 512GB microSD cards are surprisingly cheap", "description": "Today’s best deals center around gaming, with the new Devil May Cry 5 on PC getting a 25 percent discount. Huge 512GB microSD cards for Nintendo Switch are more affordable at Amazon, plus you can save over $100 on the RTX 2080.", "url": "https://www.theverge.com/good-deals/2019/3/6/18253134/devil-may-cry-5-microsd-cards-rtx-2080-amazon-deals-sale", "urlToImage": "https://cdn.vox-cdn.com/thumbor/SqVPqSCqJMfOa5rWaBwzqgz21Fg=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13641641/V7_png_jpgcopy.jpg", "publishedAt": "2019-03-06T20:57:42Z", "content": "Devil May Cry 5 releases this Friday, March 8th, and if you were planning on buying the game for PC, Fanatical is offering the best price. Its $44.87 with the offer code 25OFFDMC5 used at checkout. Character action games like this, especially ones as lavishly… [+1941 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Fiat’s newest concept is a modular electric car you can almost endlessly customize", "description": "Customers would be able to pick different roofs, wheels, and also plug more than 100 different accessories into the car. Even the battery pack is modular, offering between 62 and 311 miles of range.", "url": "https://www.theverge.com/2019/3/6/18253455/fiat-centoventi-customize-concept-modular-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/dj6zFGEKzRARL8oFLk1VjQZxZLU=/0x378:1024x914/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15912345/190305_Fiat_Concept_Centoventi_12.jpg", "publishedAt": "2019-03-06T20:17:27Z", "content": "The biggest debuts each year at the Geneva Motor Show are usually eye-popping supercars, but look hard enough and you can find some more... democratic ideas in the margins. Like Fiat’s newest concept, the Centoventi, which is a customizable modular electric c… [+3434 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Zotac’s RTX 2080 AMP is cheaper than ever for Verge readers", "description": null, "url": "https://www.theverge.com/good-deals/2019/3/6/18252207/graphics-card-zotac-rtx-2080-amp-bh-photo-deal-sale", "urlToImage": null, "publishedAt": "2019-03-06T19:24:11Z", "content": "Zotac’s RTX 2080 AMP graphics card is $659 at B&H Photo for readers of The Verge. Previously priced at $809 at B&H and as low as $739 direct through Zotac, it’s the biggest price drop that we’ve seen for this particular model. There a few RTX 2080 models from… [+1362 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "Read Mark Zuckerberg’s letter on Facebook’s privacy-focused future", "description": "Facebook CEO Mark Zuckerberg just published a lengthy letter outlining what he describes as a “privacy-focused” future for Facebook Messenger, Instagram, and WhatsApp — and online communication at large.", "url": "https://www.theverge.com/2019/3/6/18253472/mark-zuckerberg-facebook-letter-privacy-encrypted-messaging", "urlToImage": "https://cdn.vox-cdn.com/thumbor/SaCQyKyFtzJb7j1AHANBhc01p1k=/0x178:3000x1749/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10842267/953502232.jpg.jpg", "publishedAt": "2019-03-06T19:05:32Z", "content": "Facebook CEO Mark Zuckerberg just published a lengthy post outlining what he describes as a privacy-focused future for his companys various messaging platforms Facebook Messenger, Instagram, and WhatsApp and online communication at large. The letter is Zucker… [+20035 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Casey Newton", "title": "Mark Zuckerberg says Facebook will shift to emphasize encrypted, ephemeral messages", "description": "Facebook will increasingly shift its focus away from public posts to encrypted, ephemeral communications on its trio of messaging apps, CEO Mark Zuckerberg said in a significant new blog. In a 3,200-word missive, Zuckerberg says that encryption will be one of…", "url": "https://www.theverge.com/2019/3/6/18253458/mark-zuckerberg-facebook-privacy-encrypted-messaging-whatsapp-messenger-instagram", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ubaxELNj6vUqs8uuJwmC4rS9Kvk=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11559995/akrales_180614_1777_0080.jpg", "publishedAt": "2019-03-06T19:00:00Z", "content": "Facebook will increasingly shift its focus away from public posts to encrypted, ephemeral communications on its trio of messaging apps, CEO Mark Zuckerberg said today in a significant new blog post. In a 3,200-word missive, Zuckerberg says that encryption wil… [+5691 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dani Deahl", "title": "Spotify’s repeat button is coming back to a song’s now playing page", "description": "Spotify is bringing back the repeat button after the company pushed out an update last month that buried it inside a submenu, much to the chagrin of repeat button lovers. The repeat button is now reappearing front and center for some users, including some at …", "url": "https://www.theverge.com/2019/3/6/18253381/spotify-repeat-button-song-now-playing-page-return-back", "urlToImage": "https://cdn.vox-cdn.com/thumbor/uAroFbJZv5x6iusWMM8fL-1Kb2Y=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10411089/akrales_180305_1437_0021.jpg", "publishedAt": "2019-03-06T18:46:00Z", "content": "Spotify is bringing back the repeat button after the company pushed out an update last month that buried it inside of a submenu, much to the chagrin of repeat button lovers. The repeat button is now reappearing front and center for some users, including some … [+710 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Microsoft open-sources its Windows calculator on GitHub", "description": "Microsoft is open-sourcing its Windows calculator. The software giant has posted source code, documentation, and more details on GitHub. It’s part of a bigger effort by Microsoft to embrace open source, and Windows developers will be able to help contribute t…", "url": "https://www.theverge.com/2019/3/6/18253474/microsoft-windows-calculator-open-source-github", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mVHJTvVh0cwysouFn5b94-U1rXo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10793345/acastro_180507_1777_microsoft_0001.jpg", "publishedAt": "2019-03-06T18:44:35Z", "content": "Microsoft is making the source code for its Windows calculator available on GitHub today. The software maker wants to build an even better user experience in partnership with the community. Opening up the calculator means anyone can contribute code to improve… [+927 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dieter Bohn", "title": "Google Duplex automated restaurant reservations expand to 43 US states", "description": "Google has announced that it’s expanding its Duplex reservation system — which has an AI-driven assistant make restaurant reservations for you — to a total of 43 US states. It will work on Pixel phones in those 43 states, but it should be expanding to more An…", "url": "https://www.theverge.com/2019/3/6/18253419/google-duplex-reservations-expand-43-us-states-iphone-disclosure-laws", "urlToImage": "https://cdn.vox-cdn.com/thumbor/kLTIad_6LG5LmPhUaYHlSMX0jhc=/0x0:2326x1218/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11606335/Screen_Shot_2018_06_26_at_6.43.55_PM.png", "publishedAt": "2019-03-06T18:35:11Z", "content": "Google has announced that its expanding its Duplex reservation system which has an AI-driven assistant make restaurant reservations for you to a total of 43 US states. It will work on Pixel phones in those 43 states, but it should be expanding to more Android… [+2440 chars]"}]}