{"status": "ok", "totalResults": 3710, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "The Latest: Israeli PM to cut short US visit after attack", "description": "The Latest on developments in Israel and the Palestinian territories (all times local): 8:15 a.m.", "url": "https://www.foxnews.com/world/the-latest-israeli-pm-to-cut-short-us-visit-after-attack", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-75fb1b27d85b47078676d477cc40bbec.png", "publishedAt": "2019-03-25T06:17:11Z", "content": "KFAR SABA, Israel The Latest on developments in Israel and the Palestinian territories (all times local):\r\n8:15 a.m.\r\nIsraeli Prime Minister Benjamin Netanyahu says he's cutting short his visit to Washington after a Gaza rocket attack on Israel.\r\nNetanyahu de… [+1406 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Seoul says some N. Korean officials back at liaison office", "description": "South Korea says some North Korean officials have returned to an inter-Korean liaison office three days after the North abruptly withdrew its entire staff citing unspecified instructions from \"higher-level authorities.\"", "url": "https://www.foxnews.com/world/seoul-says-some-n-korean-officials-back-at-liaison-office", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-25T06:05:58Z", "content": "SEOUL, South Korea South Korea says some North Korean officials have returned to an inter-Korean liaison office three days after the North abruptly withdrew its entire staff citing unspecified instructions from \"higher-level authorities.\"\r\nSeoul's Unification… [+520 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News", "title": "Dr. Dre deletes Instagram post bragging about daughter’s acceptance into USC - Fox News", "description": "Dr. Dre deletes Instagram post bragging about daughter’s acceptance into USC Fox News Dr. Dre Praises Daughter for Getting 'Into USC All on Her Own' 6 Years After Making $70M Donation PEOPLE.com After donating millions to the school, rap icon Dr. Dre boasts a…", "url": "https://www.foxnews.com/entertainment/dr-dre-deletes-instagram-post-bragging-about-daughters-acceptance-into-usc", "urlToImage": "https://a57.foxnews.com/media2.foxnews.com/thumbnails/i/051513/640/360/051513_nation_dre_640.jpg", "publishedAt": "2019-03-25T05:25:15Z", "content": "Turns out that he does want you to forget about Dre.\r\nJust a day after hip hop legend Dr. Dre took a shot at celebrities and other influential parents caught up in a recent college admission scandal, the famous rapper deleted an Instagram post about his daugh… [+930 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Family with stake in Krispy Kreme Doughnuts, Panera Bread to give $11M after hearing extent of Nazi past", "description": "One of Germany's richest families, whose company owns a controlling interest in Krispy Kreme Doughnuts, Panera Bread, Pret a Manger and other well-known businesses, plans to donate millions to charity after learning about their ancestors' enthusiastic support…", "url": "https://www.foxnews.com/world/german-family-to-give-11m-after-hearing-extent-of-nazi-past", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/Germany-Nazi-Apology.jpg", "publishedAt": "2019-03-25T05:01:45Z", "content": "BERLIN (AP) — One of Germany's richest families, whose company owns a controlling interest in Krispy Kreme Doughnuts, Panera Bread, Pret a Manger and other well-known businesses, plans to donate millions to charity after learning about their ancestors' enthus… [+2901 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Key developments from Thailand's post-coup election", "description": "A military-backed party appears to have won the most votes in Thailand's first election since a 2014 coup after tilting the electoral system in its favor.", "url": "https://www.foxnews.com/world/key-developments-from-thailands-post-coup-election", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-3cb977218296481da58b5672932ad478.png", "publishedAt": "2019-03-25T05:00:44Z", "content": "BANGKOK A military-backed party appears to have won the most votes in Thailand's first election since a 2014 coup after tilting the electoral system in its favor. If the preliminary results hold, it will likely add to nearly two decades of political instabili… [+5018 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Cyclone lashing northwest Australia weakens", "description": "A slow-moving cyclone that lashed northwest Australia was weakening on Monday.", "url": "https://www.foxnews.com/world/cyclone-lashing-northwest-australia-weakens", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-25T04:37:39Z", "content": "CANBERRA, Australia A slow-moving cyclone that lashed northwest Australia was weakening on Monday.\r\nThe Bureau of Meteorology said Cyclone Veronica had weakened from a Category 3 storm, on a scale in which 5 is the strongest, to a Category 2, with sustained w… [+1492 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Edmund DeMarche", "title": "Explosion heard in central Israel after air raid sirens wail: report", "description": "Explosions were heard early Monday in central Israel after air raid sirens sounded, The Associated Press reported.", "url": "https://www.foxnews.com/world/explosion-heard-in-central-israel-after-air-raid-sirens-wail-report", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/17/694940094001_6014933673001_6014941797001-vs.jpg", "publishedAt": "2019-03-25T04:20:29Z", "content": "Explosions were heard early Monday in central Israel after air raid sirens sounded, according to reports.\r\nIsrael’s defense forces said rockets were fired from the Gaza Strip. There was no immediate word of damages.\r\nThe Jerusalem Post reported that a rocket … [+554 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Explosions heard in central Israel after Gaza rocket attack", "description": "Explosions have been heard in central Israel after air raid sirens wailed.", "url": "https://www.foxnews.com/world/explosions-heard-in-central-israel-after-gaza-rocket-attack", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-25T04:15:03Z", "content": "KFAR SABA, Israel Explosions have been heard in central Israel after air raid sirens wailed.\r\nThe Israeli military says a rocket was launched early Monday from the Gaza Strip toward Israel and was looking into the reports.\r\nThe apparent attack comes 10 days a… [+451 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News", "title": "Gronkowski girlfriend posts loving message after retirement announcement - Fox News", "description": "Gronkowski girlfriend posts loving message after retirement announcement Fox News 'Grateful' Gronkowski announces retirement ESPN Rob Gronkowski Retires NFL Rob Gronkowski announces his retirement after nine seasons with Patriots Yahoo Sports Injuries took th…", "url": "https://www.foxnews.com/sports/gronkowski-girlfriend-posts-loving-message-after-retirement-announcement", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/rob-gronkowski-camille-kostek.jpg", "publishedAt": "2019-03-25T04:08:03Z", "content": "Camille Kostek, the longtime girlfriend of former Patriots great Rob Gronkowski, posted words of encouragement for the ex-tight end who earlier announced his retirement from the game after nine seasons.\r\n“You motivate me to be better,” she posted on Instagram… [+1658 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "March Madness: Duke squeaks by UFC in dramatic finish - Fox News", "description": "March Madness: Duke squeaks by UFC in dramatic finish Fox News Zion Williamson, Tacko Fall putting on a show in NCAA tournament matchup Yahoo Sports ALLY-\"OOPPS\", Late miss costs UCF the game | NCAA March Madness 360 CBS Sports 'You always look for a moment':…", "url": "https://www.foxnews.com/sports/march-madness-duke-squeaks-by-ufc-in-dramatic-finish", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/18/694940094001_6015280197001_6015279670001-vs.jpg", "publishedAt": "2019-03-25T03:49:16Z", "content": "Zion Williamson hit a layup over 7-foot-6 Tacko Fall in the closing seconds and RJ Barrett’s putback provided the margin of victory as top-seeded Duke held off UCF 77-76 on Sunday to reach the Sweet 16.\r\nAubrey Dawkins finished with 32 points for UCF, but his… [+607 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Ardern says royal commission will investigate mosque attacks", "description": "New Zealand's prime minister has announced a top-level inquiry into the circumstances surrounding the massacre of 50 people in two Christchurch mosques.", "url": "https://www.foxnews.com/world/ardern-says-royal-commission-will-investigate-mosque-attacks", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-25T02:56:47Z", "content": "WELLINGTON, New Zealand New Zealand's prime minister has announced a top-level inquiry into the circumstances surrounding the massacre of 50 people in two Christchurch mosques.\r\nPrime Minister Jacinda Ardern says the country's highest form of investigation, a… [+445 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Chad Pergram", "title": "Reporter's Notebook: Mueller probe findings trigger a different kind of March Madness on Capitol Hill - Fox News", "description": "Reporter's Notebook: Mueller probe findings trigger a different kind of March Madness on Capitol Hill Fox News Mueller Finds No Trump-Russia Conspiracy, but Stops Short of Exonerating President on Obstruction The New York Times What will Attorney General Will…", "url": "https://www.foxnews.com/politics/mueller-probe-findings-trigger-a-different-kind-of-march-madness-on-capitol-hill", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017512183001_6017518391001-vs.jpg", "publishedAt": "2019-03-25T02:08:11Z", "content": "CAPITOL HILL Iowa had upset Cincinnati. Oregon was tipping off against Wisconsin. And everyone had just learned that the basketball team at the University of California-Irvine is known as the Anteaters.\r\nHowever, few inside the Beltway could exhaust time on M… [+8818 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Samuel Chamberlain", "title": "Rep. Doug Collins on Mueller report summary: 'Where's the apology, Mr. Schiff?'", "description": "The top Republican on the House Judiciary Committee challenged House Intelligence Committee chairman Adam Schiff, D-Calif., to apologize for repeatedly claiming that there was evidence of collusion between the Trump campaign and Russian officials after Attorn…", "url": "https://www.foxnews.com/politics/doug-collins-on-mueller-summary-wheres-the-apology-mr-schiff", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/AP19057664285693-1.jpg", "publishedAt": "2019-03-25T01:26:43Z", "content": "The top Republican on the House Judiciary Committee challenged House Intelligence Committee chairman Adam Schiff, D-Calif., to apologize for repeatedly claiming that there was evidence of collusion between the Trump campaign and Russian officials after Attorn… [+3140 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nicole Darrah", "title": "Rep. Al Green after Mueller findings released: 'Impeachment is not dead'", "description": "Rep. Al Green, the Texas Democrat who has pushed to impeach President Trump every year that the commander-in-chief has been in office, said Sunday that \"impeachment is not dead,\" despite findings from Special Counsel Robert Mueller's probe showing the Trump c…", "url": "https://www.foxnews.com/politics/rep-al-green-after-mueller-findings-released-impeachment-is-not-dead", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/16/694940094001_6014751663001_6014752863001-vs.jpg", "publishedAt": "2019-03-25T01:23:20Z", "content": "Rep. Al Green, the Texas Democrat who has pushed to impeach President Trump every year that the commander-in-chief has been in office, said Sunday that \"impeachment is not dead,\" despite findings from Special CounselRobert Mueller's probe showing the Trumpcam… [+2398 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Pence: Mueller findings 'should be welcomed by every American who cherishes the truth' - Fox News", "description": "Pence: Mueller findings 'should be welcomed by every American who cherishes the truth' Fox News Mueller Finds No Trump-Russia Conspiracy, but Stops Short of Exonerating President on Obstruction The New York Times Congress waiting on attorney general's summary…", "url": "https://www.foxnews.com/politics/pence-mueller-findings-should-be-welcomed-by-every-american-who-cherishes-the-truth", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/02/ContentBroker_contentid-3d844425d8cb44ac9ed3ad83b7bf33fa.png", "publishedAt": "2019-03-25T01:13:01Z", "content": "Vice PresidentMike Pence said that Sunday was \"a great day for America\" after it was revealed Special CounselRobert Mueller determined the Trumpcampaign did not collude with Russia to influence the 2016 election.\r\n\"After two years of investigation, and reckle… [+1890 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nicole Darrah", "title": "Hollywood reacts to release of Mueller probe findings - Fox News", "description": "Hollywood reacts to release of Mueller probe findings Fox News Mueller Finds No Trump-Russia Conspiracy, but Stops Short of Exonerating President on Obstruction The New York Times House Judiciary Chairman says committee will call attorney general to testify C…", "url": "https://www.foxnews.com/entertainment/hollywood-reacts-to-release-of-mueller-probe-findings", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017512183001_6017518391001-vs.jpg", "publishedAt": "2019-03-25T00:27:38Z", "content": "Several celebrities made their voices heard on Sunday about the results of Special CounselRobert Mueller's probe into whether the Trumpcampaign colluded with Russia to rig the 2016 election.\r\n\"Did not imagine a world where they were able to indict Aunt Becky … [+2123 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Robert Mueller's Russia investigation by the numbers - Fox News", "description": "Robert Mueller's Russia investigation by the numbers Fox News Mueller Report Summary: Trump campaign did not \"conspire or coordinate\" with Russia, live stream CBS News Mueller Finds No Trump-Russia Conspiracy but Stops Short of Exonerating President on Obstru…", "url": "https://www.foxnews.com/politics/robert-mueller-russia-investigation-by-the-numbers", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017495318001_6017493641001-vs.jpg", "publishedAt": "2019-03-24T23:24:52Z", "content": "Special Counsel Robert Mueller'sinvestigation into possible collusion between Russia and the Trump campaign concluded with the final report submitted to the Justice Department this past Friday. In a letter released Sunday, Attorney GeneralWilliam Barr publicl… [+2756 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew O'Reilly", "title": "Trump team turns tables after Mueller report, calls for investigation into probe's origin - Fox News", "description": "Trump team turns tables after Mueller report, calls for investigation into probe's origin Fox News Mueller Report Summary: Trump campaign did not \"conspire or coordinate\" with Russia, live stream CBS News Congress waiting on attorney general's summary of Muel…", "url": "https://www.foxnews.com/politics/trump-team-turns-tables-after-mueller-report-calls-for-investigation-into-probe", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/01/28/694940094001_5995353052001_5995347769001-vs.jpg", "publishedAt": "2019-03-24T23:09:51Z", "content": "President Trump and his legal team declared total victory Sunday following the release of Special Counsel Robert Mueller’s key findings -- including no evidence of collusion with Russia during the 2016 campaign -- but sought to turn the tables by renewing cal… [+2700 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Algerian president's party rejects his protest strategy", "description": "Algerian President Abdelaziz Bouteflika's own party is rejecting his plans for a national conference aimed at quelling mass protests against his leadership.", "url": "https://www.foxnews.com/world/algerian-presidents-party-rejects-his-protest-strategy", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-f570dad541344e159e0301bb368135ce.png", "publishedAt": "2019-03-24T23:03:04Z", "content": "ALGIERS, Algeria Algerian President Abdelaziz Bouteflika's own party is rejecting his plans for a national conference aimed at quelling mass protests against his leadership.\r\nThe spokesman for the FLN party said Sunday on private TV channel Dzair News that th… [+550 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Venezuela says Russian planes land for military cooperation", "description": "A Venezuelan official says Russian aircraft arrived in Caracas this weekend as part of ongoing military cooperation between the two allies.", "url": "https://www.foxnews.com/world/venezuela-says-russian-planes-land-for-military-cooperation", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T22:52:32Z", "content": "CARACAS, Venezuela A Venezuelan official says Russian aircraft arrived in Caracas this weekend as part of ongoing military cooperation between the two allies.\r\nThe official said Sunday that Russian military officials are visiting to discuss equipment maintena… [+635 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "Top Republicans speak out on Mueller report findings - Fox News", "description": "Top Republicans speak out on Mueller report findings Fox News Mueller Report Summary: Trump campaign did not \"conspire or coordinate\" with Russia, live stream CBS News Mueller Finds No Trump-Russia Conspiracy but Stops Short of Exonerating President on Obstru…", "url": "https://www.foxnews.com/politics/top-republicans-speak-out-on-mueller-re", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017495347001_6017499165001-vs.jpg", "publishedAt": "2019-03-24T22:48:24Z", "content": "Top Republicans cheered the key findings of Special Counsel Robert Mueller's Russia investigation, which indicated Mueller did not find proof President Trump colluded with Russia to sway the 2016 election.\r\nSenate Judiciary Committee Chairman Lindsay Graham, … [+3536 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nicole Darrah", "title": "James Comey tweets forest photo after Mueller report findings released: 'So many questions'", "description": "James Comey reacted on Twitter on Sunday to make known he has some questions after Attorney General William Barr released the key findings of Special Counsel Robert Mueller's Russia investigation.", "url": "https://www.foxnews.com/politics/james-comey-tweets-forest-photo-after-mueller-report-findings-released-so-many-questions", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2018/12/18/694940094001_5981148231001_5981141395001-vs.jpg", "publishedAt": "2019-03-24T22:34:15Z", "content": "Former FBI Director James Comey seemingly responded Sunday on Twitter to the release of key findings from Special CounselRobert Mueller'sRussia investigation -- saying he had questions.\r\n\"So many questions,\" Comey tweeted, alongside a photo of himself in a fo… [+1909 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Frank Miles", "title": "Dershowitz says 'shame on Mueller,' calls Russia probe findings bad news for CNN - Fox News", "description": "Dershowitz says 'shame on Mueller,' calls Russia probe findings bad news for CNN Fox News Mueller Finds No Trump-Russia Conspiracy, but Stops Short of Exonerating President on Obstruction The New York Times Congress waiting on attorney general's summary of Mu…", "url": "https://www.foxnews.com/politics/dershowitz-shame-mueller-special-counsel-copout", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017506353001_6017503501001-vs.jpg", "publishedAt": "2019-03-24T22:27:15Z", "content": "Alan M. Dershowitz, the attorney and Harvard Law professor emeritus, slammed Robert Mueller on Sunday, saying the special counsel engaged in a “cop out” by stating that his report neither exonerated President Trump nor concluded he'd committed a crime related… [+1785 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nicole Darrah", "title": "George Conway hits back at Sarah Sanders after Mueller report findings released - Fox News", "description": "George Conway hits back at Sarah Sanders after Mueller report findings released Fox News George Conway again slammed Trump over North Korea sanctions AOL George Conway hits Sarah Sanders, says Mueller report 'does not exonerate' Trump | TheHill The Hill Kelly…", "url": "https://www.foxnews.com/politics/george-conway-reacts-to-mueller-report-findings", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/20/694940094001_6016284175001_6016281719001-vs.jpg", "publishedAt": "2019-03-24T22:22:23Z", "content": "George Conway — the husband of White House adviser Kellyanne Conway — renewed his attacks on President Trump on Sunday, implying the president may have committed a crime in connection with the Russia investigation.\r\nResponding to press secretary Sarah Sanders… [+2069 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "No 'financial ceiling' in search for missing in Mexico", "description": "Families of missing people swarmed Mexico's president Sunday after he vowed to ramp up efforts to identify thousands of bodies.", "url": "https://www.foxnews.com/world/no-financial-ceiling-in-search-for-missing-in-mexico", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-2874f4e764e744688fc500f64a294b70.png", "publishedAt": "2019-03-24T22:20:14Z", "content": "MEXICO CITY Families of missing people swarmed Mexico's president Sunday after he vowed to ramp up efforts to identify thousands of bodies. They held pictures of their loved ones or pressed large envelopes with details of their cases into his right hand. A wo… [+2117 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brooke Singman", "title": "Nadler seeks Barr testimony on Mueller report, challenges call to clear Trump on obstruction - Fox News", "description": "Nadler seeks Barr testimony on Mueller report, challenges call to clear Trump on obstruction Fox News Mueller Report Summary: Trump campaign did not \"conspire or coordinate\" with Russia, live stream CBS News Congress waiting on attorney general's summary of M…", "url": "https://www.foxnews.com/politics/nadler-seeks-barr-testimony-on-mueller-report-challenges-call-to-clear-trump-on-obstruction", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017523689001_6017521713001-vs.jpg", "publishedAt": "2019-03-24T22:07:35Z", "content": "House Judiciary Committee Chairman Jerry Nadler openly challenged Attorney General Bill Barr’s determination that Robert Mueller’s investigation did not produce evidence that President Trump committed obstruction of justice.\r\nAt a news conference Sunday eveni… [+5805 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Samuel Chamberlain", "title": "Patriots tight end Rob Gronkowski announces retirement on Instagram - Fox News", "description": "Patriots tight end Rob Gronkowski announces retirement on Instagram Fox News 'Grateful' Gronkowski announces retirement ESPN Rob Gronkowski Retires NFL Keegan: Gronk retirement a happy day Boston Herald Injuries took their toll on Rob Gronkowski's body - Adam…", "url": "https://www.foxnews.com/sports/patriots-tight-end-rob-gronkowski-announces-retirement-on-instagram", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/01/NFL-Rob-Gronkowski2.jpg", "publishedAt": "2019-03-24T21:59:44Z", "content": "Rob Gronkowski, the New England Patriots tight end whose larger-than-life personality complemented his status as one of the NFL's most potent offensive weapons, announced his retirement Sunday in an Instagram post.\r\n\"It all started at 20 years old on stage at… [+4800 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "The Latest: Trump directs US military to aid Mozambique", "description": "The Latest on Mozambique Cyclone (all times local): 11:40 p.m. United States military says President Donald Trump has directed it to support relief efforts in the aftermath of the cyclone that hit Mozambique more than a week ago.", "url": "https://www.foxnews.com/world/the-latest-trump-directs-us-military-to-aid-mozambique", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-22bea58c022345a38cd7ecbb9c2f0a43.png", "publishedAt": "2019-03-24T21:48:28Z", "content": "BUZI, Mozambique The Latest on Mozambique Cyclone (all times local):\r\n11:40 p.m.\r\nUnited States military says President Donald Trump has directed it to support relief efforts in the aftermath of the cyclone that hit Mozambique more than a week ago.\r\nThe U.S. … [+1726 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Frank Miles", "title": "2020 Democrats demand Mueller report go public in its entirety after key findings released", "description": "Democrats are pressing for full disclosure of Robert Mueller’s report and vowing to use subpoena powers and other legal means if necessary to get it.", "url": "https://www.foxnews.com/politics/democratic-candidates-for-president-demanding-mueller-report-be-made-public-for-american-people", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017459296001_6017452625001-vs.jpg", "publishedAt": "2019-03-24T21:45:17Z", "content": "Many of the Democrats running for president in 2020 responded to the release of key findings in Special Counsel Robert Mueller’s Russia investigation Sunday by saying his report should go public in its entirety.\r\nThe findings, detailed in a letter from Attorn… [+1405 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "5 key takeaways from Mueller report summary in Russia investigation", "description": "In a letter released on Sunday, Attorney General William Barr released the \"principal conclusions\" of special counsel Robert Mueller's report regarding his investigation of President Trump and his 2016 campaign and its possible collusion with Russia.", "url": "https://www.foxnews.com/politics/key-takeaways-mueller-report-summary-russia-investigation", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017357019001_6017356778001-vs.jpg", "publishedAt": "2019-03-24T21:41:46Z", "content": "In a letter released on Sunday, Attorney GeneralWilliam Barr released the \"principal conclusions\" of Special CounselRobert Mueller's report on his investigation of President Trump, his 2016 campaign and allegations of collusion with Russia.\r\nThe four-page let… [+3649 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Slain teen's mother joins supporters at vigil - Fox News", "description": "Slain teen's mother joins supporters at vigil Fox News The mother of a black teenager shot and killed by a white police officer outside Pittsburgh says she went home and \"collapsed\" after the officer's acquittal in her...", "url": "https://www.foxnews.com/us/slain-teens-mother-joins-supporters-at-vigil", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-02dfe9eab579485cb0584233ebd9502c.png", "publishedAt": "2019-03-24T21:24:21Z", "content": "RANKIN, Pa. The mother of a black teenager fatally shot by a white police officer outside Pittsburgh told supporters at a vigil that she was glad to see her son's life celebrated at a place that meant so much to him.\r\nMichelle Kenney, mother of 17-year-old An… [+1524 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Samuel Chamberlain", "title": "Trump calls Russia probe 'an illegal takedown that failed' after Mueller report summary released", "description": "President Trump told reporters Sunday that the release of a summary of Special Counsel Robert Mueller's Russia probe findings represented a \"complete and total exoneration,\" calling it \"an illegal takedown that failed.\"", "url": "https://www.foxnews.com/politics/trump-calls-russia-probe-an-illegal-takedown-that-failed-after-mueller-report-summary-released", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/AP19081517061221.jpg", "publishedAt": "2019-03-24T21:03:11Z", "content": "President Trump told reporters Sunday that the release of a summary of Special Counsel Robert Mueller's Russia probe findings represented a \"complete and total exoneration,\" calling it \"an illegal takedown that failed.\"\r\n\"So after a long look, after a long in… [+5889 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Samuel Chamberlain", "title": "White House celebrates release of Mueller report summary: 'NO COLLUSION!'", "description": "Trump administration officials reacted with jubilation Sunday after Attorney General William Barr released the \"principal conclusions\" of Special Counsel Robert Mueller's investigation into allegations that members of Trump's 2016 campaign colluded with Russi…", "url": "https://www.foxnews.com/politics/white-house-celebrates-release-of-mueller-report-summary-no-collusion", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017495304001_6017497301001-vs.jpg", "publishedAt": "2019-03-24T20:21:34Z", "content": "Trump administration officials reacted with jubilation Sunday after Attorney General William Barr released the \"principal conclusions\" of Special Counsel Robert Mueller's investigation into allegations that members of Trump's 2016 campaign colluded with Russi… [+1435 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Houston police sergeant charged in fatal shooting of wife - Fox News", "description": "Houston police sergeant charged in fatal shooting of wife Fox News HPD sergeant called person of interest in deadly Pearland shooting KTRK-TV Houston Police sergeant charged with murdering his wife, a school librarian ABC News Houston police officer faces mur…", "url": "https://www.foxnews.com/us/houston-police-sergeant-charged-in-fatal-shooting-of-wife", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T20:17:15Z", "content": "HOUSTON Investigators say a Houston police officer has been charged with murder in the fatal shooting of his librarian wife.\r\nPearland police said in a statement that the body of 52-year-old Belinda Hernandez was located Saturday by a relative at her home in … [+606 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Gregg Re", "title": "Mueller report summary released, showing no definitive proof Trump team conspired with Russia", "description": "Attorney General William Barr on Sunday released the \"principal conclusions\" of Special Counsel Robert Mueller's completed Russia probe in a four-page letter to Capitol Hill lawmakers, which stated definitively that Mueller found no evidence that Trump's team…", "url": "https://www.foxnews.com/politics/barr-releases-letter-summarizing-muellers-key-findings-after-long-running-russia-probe", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017459296001_6017452625001-vs.jpg", "publishedAt": "2019-03-24T19:52:29Z", "content": "Attorney General William Barr on Sunday released the \"principal conclusions\" of Special Counsel Robert Mueller's completed Russia probe in a bombshell four-page letter to Capitol Hill lawmakers, which stated definitively that Mueller did not establish evidenc… [+9542 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News", "title": "Read the Mueller report findings: Barr’s letter to Congress", "description": "The following is Attorney General Bill Barr’s letter to key congressional leaders summarizing the findings of Special Counsel Robert Mueller’s Russia investigation report.", "url": "https://www.foxnews.com/politics/read-the-mueller-report-findings-barrs-letter-to-congress", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/23/694940094001_6017327397001_6017334772001-vs.jpg", "publishedAt": "2019-03-24T19:47:49Z", "content": "The following is Attorney General Bill Barr’s letter to key congressional leaders summarizing the findings of Special Counsel Robert Mueller’s Russia investigation report:\r\nCLICK HERE TO SEE THE LETTER\r\nOn Friday, the Special Counsel submitted to me a \"confid… [+10310 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jessica Sager", "title": "Olivia Jade thinks parents Lori Loughlin, Mossimo Giannulli 'ruined' her life with college scandal: report", "description": "YouTube star Olivia Jade reportedly blames her mother, Lori Loughlin, and father Mossimo Giannulli for \"ruining her life\" with the now-notorious college admissions scandal.", "url": "https://www.foxnews.com/entertainment/olivia-jade-thinks-parents-lori-loughlin-mossimo-giannulli-ruined-her-life-with-college-scandal-report", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/20/694940094001_6016105895001_6016108150001-vs.jpg", "publishedAt": "2019-03-24T19:35:45Z", "content": "YouTube star Olivia Jade reportedly blames her mother, Lori Loughlin, and father Mossimo Giannulli for \"ruining her life\" with the now-notorious college admissions scandal.\r\nOlivia Jade, 19, is \"really angry with her parents because she told them she did not … [+1601 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Travis Fedschun", "title": "Georgia Tech football player Brandon Adams dead at 21, school says - Fox News", "description": "Georgia Tech football player Brandon Adams dead at 21, school says Fox News Georgia Tech Mourns The Loss of Brandon Adams Georgia Tech Official Athletic Site Georgia Tech defensive tackle Brandon Adams dies at age 21 The Tennessean Georgia Tech senior defensi…", "url": "https://www.foxnews.com/sports/georgia-tech-defensive-tackle-brandon-adams-dead-at-21-school-says", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/adams_brandon-graphic.jpg", "publishedAt": "2019-03-24T18:58:57Z", "content": "Days before spring practice was set to begin for Georgia Tech's football team, school officials announced Sunday that defensive tackle Brandon Adams died at age 21.\r\nAdams, a senior majoring in business administration, died Saturday in Atlanta, the university… [+2526 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Man charged in Indiana woman's 1988 slaying dies in jail - Fox News", "description": "Man charged in Indiana woman's 1988 slaying dies in jail Fox News A man who pleaded guilty to the 1988 beating death of a pregnant mother in South Bend, Indiana, has died in jail. View full coverage on Google News", "url": "https://www.foxnews.com/us/man-charged-in-indiana-womans-1988-slaying-dies-in-jail", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T18:57:16Z", "content": "SOUTH BEND, Ind. A man who pleaded guilty to the 1988 beating death of a pregnant mother in South Bend, Indiana, has died in jail.\r\nThe St. Joseph County prosecutor's office says 78-year-old George Kearney was found unresponsive Saturday night in the county j… [+556 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Jordan Peele's 'Us' scares away box office competition with $70.3 million in ticket sales - Fox News", "description": "Jordan Peele's 'Us' scares away box office competition with $70.3 million in ticket sales Fox News Jordan Peele's 'Us' Delivers a Mind-Blowing $70 Million Debut Box Office Mojo Box Office: Jordan Peele’s ‘Us’ Stuns With $70 Million Opening Weekend Variety Jor…", "url": "https://www.foxnews.com/entertainment/jordan-peeles-us-scares-away-box-office-competition-with-70-3-million-in-ticket-sales", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/7ed4817c-ContentBroker_contentid-a376235e8de943b88c1692592653dbaf.png", "publishedAt": "2019-03-24T18:41:22Z", "content": "Jordan Peele has done it again. Two years after the filmmaker's \"Get Out\" became a box-office sensation, his frightening follow-up, \"Us,\" debuted with $70.3 million in ticket sales, according to studio estimates Sunday.\r\nThe opening, well above forecasts, had… [+4720 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jessica Sager", "title": "'Scary Spice' Mel B reveals she once had sex with Geri 'Ginger Spice' Halliwell - Fox News", "description": "'Scary Spice' Mel B reveals she once had sex with Geri 'Ginger Spice' Halliwell Fox News Mel B Claims She Slept With Geri Halliwell During Spice Girls Era E! Online Mel B Says She Totally Slept with Geri Halliwell During Spice Girls' Heyday TooFab View full c…", "url": "https://www.foxnews.com/entertainment/scary-spice-mel-b-reveals-she-once-had-sex-with-geri-ginger-spice-halliwell", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ginger-spice-geri-halliwell-mel-b-scary-spice-girls-display.jpg", "publishedAt": "2019-03-24T18:10:35Z", "content": "This should make the Spice Girlsreunion tour even more interesting.\r\nMel \"Scary Spice\" B revealed she and Geri \"Ginger Spice\" Halliwell once had sex.\r\n“She is going to hate me for this because she is all posh in a country house but it wasn’t a ‘thing,’\" Mel B… [+1458 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Anna Hopkins", "title": "Diabetic inmate with HIV died after being left on cell floor for 21 hours without food or medicine, inquest reveals", "description": "Annabella Landsberg, who was diabetic and HIV positive, died at a jail in the United Kingdom after being left lying on the ground of her cell without food or medicine for nearly a day.", "url": "https://www.foxnews.com/world/diabetic-inmate-with-hiv-died-after-being-left-on-cell-floor-for-21-hours-without-food-or-medicine", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/Annabella-Landsberg.jpg", "publishedAt": "2019-03-24T18:07:35Z", "content": "An inmate has died at a jail in the United Kingdom after being left lying on the ground of her cell without food or medicine for nearly a day, according to an inquest.\r\nAnnabella Landsberg, who was diabetic and HIV positive, was reportedly restrained by four … [+1935 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Katherine Lam", "title": "Cruise ship stranded off Norway’s coast reaches port after harrowing helicopter rescues - Fox News", "description": "Cruise ship stranded off Norway’s coast reaches port after harrowing helicopter rescues Fox News Norway cruise ship: Viking cruise ship carrying 1,300 passengers sends mayday call; passengers evacuated by helicopters and boats today CBS News Evacuation of pas…", "url": "https://www.foxnews.com/travel/cruise-ship-stranded-off-norways-coast-reaches-port-after-harrowing-helicopter-rescues", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/AP19083555110424.jpg", "publishedAt": "2019-03-24T17:52:36Z", "content": "A cruise ship reached the Norwegian port of Molde on Sunday a day after the crew issued a mayday call that led to hundreds of passengers being airlifted to safety.\r\nThe Viking Sky limped into the port on Sunday accompanied by tug boats after the harrowing ord… [+3376 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Italy's Premier Conte rules out another term in government", "description": "Italian Prime Minister Giuseppe Conte says that he does not plan to serve in any future governments.", "url": "https://www.foxnews.com/world/italys-premier-conte-rules-out-another-term-in-government", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T17:47:05Z", "content": "ROME Italian Prime Minister Giuseppe Conte says that he does not plan to serve in any future governments.\r\nConte oversees a coalition government of two populist parties, the 5-Star Movement and the right-wing League. He has been premier since June 2018.\r\nHe's… [+491 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Prince Charles and Camilla launch first royal visit to Cuba", "description": "Prince Charles and his wife Camilla are beginning the first official trip to Cuba by the British royal family in a pomp-filled display of disagreement with the Trump administration's strategy of economically isolating the communist island.", "url": "https://www.foxnews.com/world/prince-charles-and-camilla-launch-first-royal-visit-to-cuba", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T17:24:05Z", "content": "HAVANA Prince Charles and his wife Camilla are beginning the first official trip to Cuba by the British royal family in a pomp-filled display of disagreement with the Trump administration's strategy of economically isolating the communist island.\r\nThe heir to… [+563 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Katherine Lam", "title": "Second student who survived Florida school shooting dies in apparent suicide, police say", "description": "A high school student who survived the 2018 school shooting in Parkland, Fla., died Saturday in an apparent suicide a week after another survivor killed herself, police said.", "url": "https://www.foxnews.com/us/second-student-who-survived-florida-school-shooting-dies-by-apparent-suicide-police-say", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/AP19080600858295.jpg", "publishedAt": "2019-03-24T16:45:56Z", "content": "A high school student who survived the 2018 school shooting in Parkland, Fla., died Saturday in an apparent suicide a week after another survivor killed herself, police said.\r\nPolice received a call about a deceased person at a home Saturday night and arrived… [+2157 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Romania, Honduras recognize Jerusalem as Israel's capital", "description": "The leaders of Romania and Honduras have announced they will recognize Jerusalem as Israel's capital, following the lead of President Donald Trump.", "url": "https://www.foxnews.com/world/romania-honduras-recognize-jerusalem-as-israels-capital", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T16:43:03Z", "content": "JERUSALEM The leaders of Romania and Honduras have announced they will recognize Jerusalem as Israel's capital, following the lead of President Donald Trump.\r\nRomanian Prime Minister Viorica Dancila and Honduran President Juan Orlando Hernandez delivered thei… [+610 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "France shows Britons splendor of citizenship as Brexit looms", "description": "Catherine Norris Trent, a British citizen who has lived in Paris since 2007, rushed to become French before her native country left the European Union.", "url": "https://www.foxnews.com/world/france-shows-britons-splendor-of-citizenship-as-brexit-looms", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-f5f3c38800d14384b6074e161071ab1c-1.png", "publishedAt": "2019-03-24T16:33:44Z", "content": "PARIS Catherine Norris Trent, a British citizen who has lived in Paris since 2007, rushed to become French before her native country left the European Union. She worried Brexit might force her to leave her French partner and their two young children.\r\nWhile t… [+4349 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Plenty of politics at play in Venezuela-Catalonia friendly", "description": "There will be lots of politics to talk about when Venezuela takes on a Catalonia squad in a friendly soccer game in Spain on Monday.", "url": "https://www.foxnews.com/world/plenty-of-politics-at-play-in-venezuela-catalonia-friendly", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-0d8ccf9f79f04cccb8c4608db2a3a8bc.png", "publishedAt": "2019-03-24T16:32:55Z", "content": "MADRID There will be lots of politics to talk about when Venezuela takes on a Catalonia squad in a friendly soccer game in Spain on Monday.\r\nVenezuela has a coach who offered his resignation over the alleged political use of his national team, while Catalonia… [+2762 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew O'Reilly", "title": "Rep. Jordan calls for all documents from Mueller investigation to be released", "description": "Rep. Jim Jordan, R-Ohio, argued on Sunday that all the documents relating to Special Counsel Robert Mueller's investigation should be released if the report is eventually made public.", "url": "https://www.foxnews.com/politics/rep-jordan-calls-for-all-documents-from-mueller-investigation-to-be-released", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/11/Jim-Jordan.jpg", "publishedAt": "2019-03-24T16:23:47Z", "content": "Rep. Jim Jordan, R-Ohio, argued on Sunday that all the documents relating to Special Counsel Robert Mueller’s investigation should be released if the report is eventually made public.\r\nWhile Jordan did not say if he would directly ask President Trump to relea… [+1948 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew O'Reilly", "title": "Rubio on Trump's attack on McCain legacy: 'I don't get it' - Fox News", "description": "Rubio on Trump's attack on McCain legacy: 'I don't get it' Fox News Yvonne Abraham: Trump keeps getting away with it The Boston Globe John McCain and Arizona are likely to remain a Donald Trump obsession. Here's why USA TODAY The Departed: History will likely…", "url": "https://www.foxnews.com/politics/rubio-on-trumps-attack-on-mccain-legacy-i-dont-get-it", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/21/694940094001_6016507832001_6016500172001-vs.jpg", "publishedAt": "2019-03-24T16:07:22Z", "content": "Sen. Marco Rubio, R-Fla., said Sunday that he doesn’t understand why President Trump has revived his criticism of the late Arizona Sen. John McCain.\r\nWhile admitting that he didn’t always see eye to eye with McCain, Rubio said he respected the longtime lawmak… [+3121 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Anti-government protesters march in Belarusian capital", "description": "About 2,000 opponents of Belarus' authoritarian government have rallied in the country's capital of Minsk.", "url": "https://www.foxnews.com/world/anti-government-protesters-march-in-belarusian-capital", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-1077277c5dd74dfda86d5797dff2758a-1.png", "publishedAt": "2019-03-24T15:56:01Z", "content": "KIEV, Ukraine About 2,000 opponents of Belarus' authoritarian government have rallied in the country's capital of Minsk.\r\nThe Sunday rally marked the 101st anniversary of the formation of the short-lived Belarusian People's Republic, an attempt to form an ind… [+498 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Christopher Carbone", "title": "Thousands attend New Zealand vigil to remember Christchurch victims and protest racism", "description": "Tens of thousands of people attended a vigil in Christchurch to mourn the 50 Muslims killed in an attack on two mosques by a suspected white supremacist.", "url": "https://www.foxnews.com/world/thousands-attend-new-zealand-vigil-to-remember-christchurch-victims-and-protest-racism", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/nz-vigil-getty-display-image.jpg", "publishedAt": "2019-03-24T15:41:54Z", "content": "Tens of thousands of people attended a vigil in Christchurch to mourn the 50 Muslims killed in an attack on two mosques by a suspected white supremacist.\r\nA huge group of mourners, estimated to number between 20,000 and 40,000 by local police, came to Hagley … [+2458 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "James Rogers", "title": "‘Wonder, awe, excitement’: Apollo 16 astronaut describes walking on the Moon", "description": "Charles Duke watched from Mission Control in Houston when his fellow Apollo astronauts Neil Armstrong and Buzz Aldrin made their historic Moon landing on July 20, 1969. Less than three years later he followed in their footsteps as the Apollo 16 lunar module p…", "url": "https://www.foxnews.com/science/wonder-awe-excitement-apollo-16-astronaut-describes-walking-on-the-moon", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/NASACharlesDukeMoon.jpg", "publishedAt": "2019-03-24T15:41:30Z", "content": "Charles Duke watched from Mission Control in Houston when his fellow NASA astronauts Neil Armstrong and Buzz Aldrin made their historic Moon landing on July 20, 1969. Less than three years later he followed in their footsteps as the Apollo 16 lunar module pil… [+4696 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Christopher Carbone", "title": "UGA fraternity suspended after racist video spread online - Fox News", "description": "UGA fraternity suspended after racist video spread online Fox News Fraternity expels 4 at University of Georgia chapter after racist video surfaces NBC News UGA fraternity suspended as racist video circulates online Atlanta Journal Constitution University of …", "url": "https://www.foxnews.com/us/uga-fraternity-suspended-after-racist-video-spread-online", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/UGA-getty-images.jpg", "publishedAt": "2019-03-24T15:39:55Z", "content": "Four students were expelled from a University of Georgia fraternity on Saturday after a video depicting them using racial slurs and mocking the mistreatment of slaves went viral on social media.\r\nAccording to UGA student newspaper The Red and Black, the video… [+1438 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Katherine Lam", "title": "Enterprise employee, 19, put LSD in co-workers drinks because they had ‘negative energy,’ police say - Fox News", "description": "Enterprise employee, 19, put LSD in co-workers drinks because they had ‘negative energy,’ police say Fox News A Missouri employee at an Enterprise Rent-A-Car said he spiked three co-workers' drinks with LSD because they were giving off “negative energy,” poli…", "url": "https://www.foxnews.com/us/enterprise-employee-19-put-lsd-in-co-workers-drinks-because-they-had-negative-energy-police-say", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/water-bottles-istock.jpg", "publishedAt": "2019-03-24T15:36:52Z", "content": "A Missouri employee at an Enterprise Rent-A-Car said he spiked three co-workers’ drinks with LSD because they were giving off “negative energy,” police said.\r\nPolice began investigating the unidentified 19-year-old man this week after officers were called to … [+672 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Top GOP Judiciary Committee member: Trump 'proved right' on Mueller probe, as Nadler warns of 'cover-up' - Fox News", "description": "Top GOP Judiciary Committee member: Trump 'proved right' on Mueller probe, as Nadler warns of 'cover-up' Fox News Nadler: It would be 'cover-up' for Barr to withhold Mueller report New York Post Nadler: Executive privilege can't be used to 'hide wrongdoing' i…", "url": "https://www.foxnews.com/politics/top-gop-judiciary-committee-member-trump-proved-right-on-mueller-probe-as-nadler-warns-of-cover-up", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017444692001_6017442567001-vs.jpg", "publishedAt": "2019-03-24T15:23:33Z", "content": "House Judiciary Chairman Jerry Nadler, D-N.Y., speaking to \"Fox News Sunday,\" vowed that congressional investigators will press on and continue to investigate President Trump while warning of a possibly unfolding Justice Department \"cover-up,\" even as he ackn… [+8654 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Kenyan who gave earnings to poor wins $1M teacher prize", "description": "A Kenyan teacher from a remote village who gave away most of his earnings to poor students has won a highly competitive $1 million global prize that honors one exceptional educator a year.", "url": "https://www.foxnews.com/world/kenyan-who-gave-earnings-to-poor-wins-1m-teacher-prize", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T15:21:51Z", "content": "DUBAI, United Arab Emirates A Kenyan teacher from a remote village who gave away most of his earnings to poor students has won a highly competitive $1 million global prize that honors one exceptional educator a year.\r\nPeter Tabichi is a science teacher who gi… [+512 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Goodwin", "title": "Michael Goodwin: Why Obama and Clinton should now be probed", "description": "What did President Obama and his administration do, and why did they do it?", "url": "https://www.foxnews.com/opinion/michael-goodwin-why-obama-and-clinton-should-now-be-probed", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/24/694940094001_6017357019001_6017356778001-vs.jpg", "publishedAt": "2019-03-24T15:05:29Z", "content": "Now that special counsel Robert Mueller has completed his investigation, it is tempting to breathe a sigh of relief and assume that our long national nightmare is over. Resist the temptation, the assumption is false.\r\nWe are not close to the end. Not by a lon… [+1141 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "German woman known as 'scammer socialite' will likely get deported", "description": "Anna Delvey, the infamous \"scammer socialite\" who posed as a wealthy heiress to infiltrate the upper echelon of New York City's social scene, is facing deportation after her trial concludes.", "url": "https://www.foxnews.com/us/german-woman-who-posed-as-a-heiress-and-socialite-will-likely-get-deported-regardless-of-conviction", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/Anna-Delvey-Gettya.jpg", "publishedAt": "2019-03-24T14:55:54Z", "content": "Anna Delvey, the infamous \"scammer socialite\" who posed as a wealthy heiress to infiltrate the upper echelon of New York City's social scene, is facing deportation after her trial concludes.\r\nThe German citizen, whose real name is Anna Sorokin, is currently f… [+2523 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew O'Reilly", "title": "Schiff says there is still 'significant evidence of collusion', plans to subpoena to see Mueller report - Fox News", "description": "Schiff says there is still 'significant evidence of collusion', plans to subpoena to see Mueller report Fox News Inside Trump's evening for the ages: When he learned Mueller was done CNN These Are All of the Other Investigations Donald Trump Faces TIME Will t…", "url": "https://www.foxnews.com/politics/schiff-says-there-is-still-significant-evidence-of-collusion-plans-to-subpoena-to-see-mueller-report", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/23/694940094001_6017319017001_6017313445001-vs.jpg", "publishedAt": "2019-03-24T14:54:13Z", "content": "Rep. Adam Schiff, D-Calif., the chairman of the House Intelligence Committee, said Sunday that he believes there is still “significant evidence of collusion” linking the Russian government with President Trump’s 2016 presidential campaign, despite reports out… [+5608 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Diana Ross urges Michael Jackson critics to 'stop in the name of love' amid resurrected sex abuse claims - Fox News", "description": "Diana Ross urges Michael Jackson critics to 'stop in the name of love' amid resurrected sex abuse claims Fox News Diana Ross Urges Jackson’s Accusers ‘to Stop in Name of Love’, Torches Twitter Sputnik International The Awfully Big Adventure: Michael Jackson i…", "url": "https://www.foxnews.com/entertainment/diana-ross-urges-michael-jackson-critics-to-stop-in-the-name-of-love-amid-resurrected-sex-abuse-claims", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/diana-ross-michael-jackson-sex-abuse-allegations.jpg", "publishedAt": "2019-03-24T14:42:54Z", "content": "Diana Ross urged critics of Michael Jackson to \"stop in the name of love.\"\r\nThe former Supremes frontwoman tweeted Saturday, \"This is what’s on my heart this morning. I believe and trust that Michael Jackson was and is A magnificent incredible force to me and… [+3151 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "As crucial Brexit votes loom, Theresa May backed by ministers amid coup reports", "description": "As a series of Brexit votes loom following a weekend that saw hundreds of thousands take to the streets of London demanding a second referendum, U.K. Prime Minister Theresa May received the backing of several ministers who dismissed reports of a \"coup\" agains…", "url": "https://www.foxnews.com/world/as-crucial-brexit-votes-loom-theresa-may-urged-to-quit-to-help-deal-pass", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/brexit-protest-3-AP.jpg", "publishedAt": "2019-03-24T14:04:29Z", "content": "As a series of Brexit votes loom following a weekend that saw hundreds of thousands take to the streets of London demanding a second referendum, British Prime Minister Theresa May received the backing of several ministers who dismissed reports of a \"coup\" aga… [+2541 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Katherine Lam", "title": "Multi-vehicle pileup on California highway leaves child, several others injured, officials say - Fox News", "description": "Multi-vehicle pileup on California highway leaves child, several others injured, officials say Fox News Major multi-vehicle pileup on 5 Freeway in Gorman leaves several injured, officials say KABC-TV Infant Airlifted in Critical Condition, Horse Killed in Maj…", "url": "https://www.foxnews.com/us/multi-vehicle-pileup-on-california-highway-leaves-child-several-others-injured-officials-say", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/694940094001_6017437245001_6017435368001-vs.jpg", "publishedAt": "2019-03-24T13:58:07Z", "content": "A child was in critical condition and several others were injured Saturday after a massive pileup snarled traffic on a California highway for hours, authorities said.\r\nThe southbound 5 Freeway near Gorman became a mangled mess around 3 p.m. when two separate … [+1192 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Serbia, Kosovo mark start of NATO intervention 20 years ago", "description": "Twenty years after NATO intervened to stop Serbia's onslaught in Kosovo, Belgrade is commemorating the victims of what it says was an aggression while Kosovo is hailing the beginning of its national liberation.", "url": "https://www.foxnews.com/world/serbia-kosovo-mark-start-of-nato-intervention-20-years-ago", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-56fbfc9e11144b99a209d8a942627083.png", "publishedAt": "2019-03-24T13:39:49Z", "content": "BELGRADE, Serbia Twenty years after NATO intervened to stop Serbia's onslaught in Kosovo, Belgrade is commemorating the victims of what it says was an aggression while Kosovo is hailing the beginning of its national liberation.\r\nThe staunchly opposed views of… [+603 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Travis Fedschun", "title": "Avocados recalled in 6 states over listeria concerns", "description": "A California-based company announced Saturday it is voluntarily recalling California-grown whole avocados over fears of possible listeria contamination.", "url": "https://www.foxnews.com/health/avocados-recalled-in-6-states-over-listeria-concerns", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/avocado1.jpg", "publishedAt": "2019-03-24T13:32:22Z", "content": "A California-based company announced Saturday it is voluntarily recalling California-grown whole avocados over fears of possible listeria contamination.\r\nHenry Avocado Corporation said in news release it announced the recall as part of a precaution after posi… [+2640 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "France investigates after older protester is injured in Nice", "description": "French authorities are investigating the case of an older female protester who suffered head injuries when police charged people defying a yellow vest protest ban in Nice.", "url": "https://www.foxnews.com/world/france-investigates-after-older-protester-is-injured-in-nice", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-e622b0f0ecb2416a9148b83a7449171f.png", "publishedAt": "2019-03-24T13:31:55Z", "content": "NICE, France French authorities are investigating the case of an older female protester who suffered head injuries when police charged people defying a yellow vest protest ban in Nice.\r\nThe woman was waving a rainbow flag marked \"Peace\" and wearing a yellow v… [+559 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Dana Blanton", "title": "POLL: Biden, Sanders lead...", "description": "So many Democrats are running for president the race feels like a March Madness bracket.  If it were, the number one seeds would be former Vice President Joe Biden and Vermont Sen. Bernie Sanders.", "url": "https://www.foxnews.com/politics/fox-news-poll-biden-sanders-top-democratic-preference", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/18/694940094001_6015182689001_6015179864001-vs.jpg", "publishedAt": "2019-03-24T13:25:38Z", "content": "So many Democrats are running for president the race feels like a March Madness bracket. If it were, the No. 1 seeds would be former Vice President Joe Biden and Vermont Sen. Bernie Sanders.\r\nEither would be favored to beat President Donald Trump in the 2020 … [+4121 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Katherine Lam", "title": "Alyssa Milano urges Hollywood to boycott Georgia over ‘heartbeat bill’", "description": "Alyssa Milano urged Hollywood film companies to boycott Georgia after the state Senate passed the bill that would ban abortions once a doctor detects a heartbeat in a fetus.", "url": "https://www.foxnews.com/entertainment/alyssa-milano-urges-hollywood-to-boycott-georgia-over-heartbeat-bill", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/GettyImages-1078617590.jpg", "publishedAt": "2019-03-24T13:14:58Z", "content": "Alyssa Milano urged Hollywood film companies to boycott Georgia after the state Senate passed the bill that would ban abortions once a doctor detects a heartbeat in a fetus.\r\nThe “Insatiable” star tweeted Friday that the new “heartbeat bill” would “strip wome… [+1797 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Iraq parliament votes to sack official after ferry sinking", "description": "Iraq's parliament deputy speaker says the house's majority has voted to sack a provincial official following the tragic sinking of a ferry in the Tigris River that killed nearly 100 people.", "url": "https://www.foxnews.com/world/iraq-parliament-votes-to-sack-official-after-ferry-sinking", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-7d35d4174b3a4e1a860a81011bcf2095.png", "publishedAt": "2019-03-24T13:12:51Z", "content": "BAGHDAD Iraq's parliament deputy speaker says the house's majority has voted to sack a provincial official following the tragic sinking of a ferry in the Tigris River that killed nearly 100 people.\r\nHassan al-Kaabi told The Associated Press Sunday that the ma… [+583 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Katherine Lam", "title": "‘Fuller House’ stars seem to reference Lori Loughlin in Kids’ Choice Awards speech amid college admissions... - Fox News", "description": "‘Fuller House’ stars seem to reference Lori Loughlin in Kids’ Choice Awards speech amid college admissions... Fox News Stars of “Fuller House” took the stage to accept the Kids' Choice Awards” on Saturday and appeared to reference co-star Lori Loughlin, sayin…", "url": "https://www.foxnews.com/entertainment/fuller-house-stars-seem-to-reference-lori-loughlin-in-kids-choice-awards-speech-amid-college-admissions-scandal", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/f47d46d8-1024-preview.jpg", "publishedAt": "2019-03-24T13:03:48Z", "content": "Stars of “Fuller House” took the stage at Nickelodeon  Kids’ Choice Awards and appeared to reference co-star Lori Loughlin in their speech, saying “family sticks together no matter what” amid the 54-year-old actress’ alleged involvement in the college admissi… [+2874 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Death toll from central Mali massacre up to 134, says UN", "description": "The United Nations says the toll from a massacre in central Mali is now at least 134 dead with dozens wounded.", "url": "https://www.foxnews.com/world/death-toll-from-central-mali-massacre-up-to-134-says-un", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T13:00:12Z", "content": "BAMAKO, Mali The United Nations says the toll from a massacre in central Mali is now at least 134 dead with dozens wounded.\r\nFrançois Delattre, the president of the U.N. Security Council who spoke in Mali's capital on Saturday, condemned the massacre as an \"u… [+473 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Pope Francis prays for peaceful end to Nicaragua crisis", "description": "Pope Francis says he is praying for the success of talks underway in Nicaragua aimed at solving a yearlong political crisis in the country.", "url": "https://www.foxnews.com/world/pope-francis-prays-for-peaceful-end-to-nicaragua-crisis", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-1fe88eba1e6b4798aa7e2008b6ebee71.png", "publishedAt": "2019-03-24T12:59:02Z", "content": "VATICAN CITY Pope Francis says he is praying for the success of talks underway in Nicaragua aimed at solving a yearlong political crisis in the country.\r\nFrancis addressed the crisis in Nicaragua after leading a prayer Sunday to a crowd at St. Peter's Square.… [+573 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Dana Blanton", "title": "Fox News Poll: Voters want Mueller report released, but will it change views? - Fox News", "description": "More voters trust Special Counsel Robert Mueller than President Donald Trump when it comes to learning the truth about Russian interference in the 2016 presidential election. At the same time, many say there is no chance Mueller’s investigation will change ho…", "url": "https://www.foxnews.com/politics/fox-news-poll-voters-want-mueller-report-released-but-will-it-change-views", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/21/694940094001_6016512507001_6016511383001-vs.jpg", "publishedAt": "2019-03-24T12:49:57Z", "content": "More voters trust Special Counsel Robert Mueller than President Trump when it comes to learning the truth about Russian interference in the 2016 presidential election. At the same time, many say there is no chance Mueller’s investigation will change how they … [+2985 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Anna Hopkins", "title": "One dead, three injured after shooting in downtown San Francisco, police say - Fox News", "description": "One dead, three injured after shooting in downtown San Francisco, police say Fox News 1 Dead In Quadruple-Shooting On Fillmore Street In San Francisco KPIX CBS SF Bay Area 1 dead, 3 wounded in San Francisco shooting SF Gate Shooting in San Francisco leaves 1 …", "url": "https://www.foxnews.com/us/one-dead-at-least-three-injured-after-shooting-in-downtown-san-francisco-police-say", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/Fillmore-Heritage-Center-GE.jpg", "publishedAt": "2019-03-24T12:48:18Z", "content": "A shooting in San Francisco's Fillmore neighborhood on Saturday night has left one person dead and at least three more injured, one critically, police say.\r\nAuthorities arrived on the scene at the Fillmore Heritage Center on the city's popular Eddy Street aro… [+1265 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Midwest, South face 'potentially unprecedented' flooding through May, NOAA says", "description": "While floodwaters may have receded in parts of the Midwest that have been inundated since the \"bomb cyclone\" triggered a devastating deluge earlier this month, forecasters are warning that snowmelt and heavy spring rains are creating the threat for major floo…", "url": "https://www.foxnews.com/us/midwest-faces-potentially-unprecedented-flooding-through-may-noaa-says", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/Final-2019-Flood-Risk-Map-2019.png", "publishedAt": "2019-03-24T12:22:33Z", "content": "While floodwaters may have receded in parts of the Midwest that have been inundated since the \"bomb cyclone\" triggered a devastating deluge earlier this month, forecasters are warning that snowmelt and heavy spring rains are creating the threat for major floo… [+4834 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "New Zealand mosque killings spark debate over free speech", "description": "New Zealanders are debating the limits of free speech after their chief censor banned a 74-page manifesto written by the man accused of slaughtering 50 people at two mosques in the city of Christchurch.", "url": "https://www.foxnews.com/world/new-zealand-mosque-killings-spark-debate-over-free-speech", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-32b7e3c5f6144b4895aa19acc285a9dd.png", "publishedAt": "2019-03-24T12:15:48Z", "content": "DUNEDIN, New Zealand New Zealanders are debating the limits of free speech after their chief censor banned a 74-page manifesto written by the man accused of slaughtering 50 people at two mosques in the city of Christchurch.\r\nThe ban, issued Saturday, means an… [+6889 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "4 buried in Swiss alpine avalanche", "description": "Swiss police say four people are missing after being buried in an avalanche high in the Alps in the southwest of the country.", "url": "https://www.foxnews.com/world/4-buried-in-swiss-alpine-avalanche", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T12:08:12Z", "content": "BERLIN Swiss police say four people are missing after being buried in an avalanche high in the Alps in the southwest of the country.\r\nValais canton (state) police said Sunday on Twitter that the four were hit by the morning avalanche at 2,800 meters (9,200 fo… [+192 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "The Latest: Cruise ship line's founder: 'We've been lucky'", "description": "The Latest on the Viking Sky cruise ship that was stranded off the coast of Norway (all times local): 12:50 p.m.", "url": "https://www.foxnews.com/world/the-latest-cruise-ship-lines-founder-weve-been-lucky", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-fccc0772a66046d9bc03a916e4394fcb.png", "publishedAt": "2019-03-24T12:06:21Z", "content": "STAVANGER, Norway The Latest on the Viking Sky cruise ship that was stranded off the coast of Norway (all times local):\r\n12:50 p.m.\r\nThe chairman of the company that operates a cruise ship that got stranded off Norway's western coast in bad weather Saturday p… [+5192 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Death toll in Mozambique from Cyclone Idai rises to 446", "description": "Authorities say the death toll in Mozambique from Cyclone Idai is now 446.", "url": "https://www.foxnews.com/world/death-toll-in-mozambique-from-cyclone-idai-rises-to-446", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-6ae54d2c9bfb47f98a9e60ecf0015591.png", "publishedAt": "2019-03-24T11:15:52Z", "content": "BEIRA, Mozambique Authorities say the death toll in Mozambique from Cyclone Idai is now 446.\r\nEnvironment minister Celso Correia said Sunday that nearly 110,000 people are now in camps more than a week after Cyclone Idai hit. As rescue efforts wind down, aid … [+547 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News", "title": "Apple prices, mobile pay apps and More: Tech Q&A", "description": "I would like to switch from Windows to Apple. Why are Apple products so much more money?", "url": "https://www.foxnews.com/tech/apple-prices-mobile-pay-apps-and-more-tech-qa", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/02/ContentBroker_contentid-52313d5deff041f98f658cd96328ab7d.png", "publishedAt": "2019-03-24T11:00:54Z", "content": "The Cost of Apple\r\nQ. I would like to switch from Windows to Apple. Why are Apple products so much more money?\r\nA: Windows and Apple are two very distinct products and neither is “better” than the other. Windows excels in certain areas, such as customization … [+4569 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brooke Crothers", "title": "Microsoft is finally pulling the plug on Windows 7: How to save yourself", "description": "Microsoft has started notifying Windows 7 users that support for the operating system is \"nearing the end.\"", "url": "https://www.foxnews.com/tech/microsoft-is-finally-pulling-the-plug-on-windows-7-how-to", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/microsoft-logo.jpg", "publishedAt": "2019-03-24T11:00:33Z", "content": "Microsoft has started notifying Windows 7 users that support for the operating system is “nearing the end.”\r\n“After 10 years, support for Windows 7 is coming to an end on January 14, 2020,” the software giant said. But ending Windows 7 won’t be a cinch. Relea… [+1893 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Ocasio-Cortez blasts GOP's upcoming 'bluff-vote' on Green New Deal", "description": "U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., blasted congressional Republicans on Saturday for seeking a \"bluff\" vote on her proposed Green New Deal -- a move that other Democrats have also derided as a political stunt.", "url": "https://www.foxnews.com/politics/ocasio-cortez-blasts-upcoming-bluff-vote-on-green-new-deal", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/AP19082000828286.jpg", "publishedAt": "2019-03-24T10:24:19Z", "content": "U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., blasted congressional Republicans on Saturday for seeking a “bluff” vote on her proposed Green New Deal -- a move that other Democrats have also derided as a political stunt.\r\n“The GOP’s whole game of wasting votes … [+3480 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Palestinian dies of wounds from Israeli fire at Gaza protest", "description": "Gaza's Health Ministry says a Palestinian has died of wounds sustained from Israeli gunfire at protests along the perimeter fence.", "url": "https://www.foxnews.com/world/palestinian-dies-of-wounds-from-israeli-fire-at-gaza-protest", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-19789e24063a4b7db90a4d8aeca368ac.png", "publishedAt": "2019-03-24T10:13:32Z", "content": "GAZA CITY, Gaza Strip Gaza's Health Ministry says a Palestinian has died of wounds sustained from Israeli gunfire at protests along the perimeter fence.\r\nThe ministry says Sunday that 24-year-old Habib al-Masri was shot in the chest at protests near Beit Hano… [+553 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Is it terrorism? Post NZ attack, Muslims see double standard", "description": "New Zealand Prime Minister Jacinda Ardern has been hailed on social media by Muslims around the world for her response to two mosque shootings by a white nationalist who killed 50 worshippers.", "url": "https://www.foxnews.com/world/is-it-terrorism-post-nz-attack-muslims-see-double-standard", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-73fe85b3d54d41d8a222b876ea92b1f8.png", "publishedAt": "2019-03-24T10:05:23Z", "content": "DUBAI, United Arab Emirates New Zealand Prime Minister Jacinda Ardern has been hailed on social media by Muslims around the world for her response to two mosque shootings by a white nationalist who killed 50 worshippers. She wore a headscarf at the funerals i… [+6497 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Mozambican families hunt for loved ones separated by cyclone", "description": "She struggled home with food, her small daughter and the proof she was still alive.", "url": "https://www.foxnews.com/world/mozambican-families-hunt-for-loved-ones-separated-by-cyclone", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-df7583e96bbe4bbda1b2388945f58346-1.png", "publishedAt": "2019-03-24T09:42:34Z", "content": "BUZI, Mozambique She struggled home with food, her small daughter and the proof she was still alive.\r\nVeronica Fatia huddled on a wooden boat that left the cyclone-shattered city of Beira for what was now the unknown: the flooded town of Buzi, which for a wee… [+4148 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Blast kills 8 children collecting scrap metal in Sudan", "description": "Sudanese officials say eight children have been killed in an explosion near a military facility where they were searching for scrap metal to resell.", "url": "https://www.foxnews.com/world/blast-kills-8-children-collecting-scrap-metal-in-sudan", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T09:18:20Z", "content": "CAIRO Sudanese officials say eight children have been killed in an explosion near a military facility where they were searching for scrap metal to resell.\r\nThe officials say the explosion happened Saturday in Omdurman, the twin city of the capital, Khartoum. … [+463 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "SWNS", "title": "Artist auctions off photo of dad's underwear for $1,300", "description": "Eccentric artist Dominic Allan - who goes by the name Dominic of Luton.", "url": "https://www.foxnews.com/lifestyle/artist-auctions-off-photo-of-dads-underwear-for-1300", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/fancy-pants-pre-320581.jpg", "publishedAt": "2019-03-24T09:00:59Z", "content": "Eccentric artist Dominic Allan - who goes by the name Dominic of Luton - photographed his dad's underwear drying on a radiator for a work he has titled “My Dad's Pants.”\r\nThe bonkers art piece which is printed on a sheet of aluminum has even been displayed in… [+1520 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "More passengers lifted off Norway cruise ship before towing", "description": "Rescue workers are evacuating more passengers from a cruise ship that had engine problems in bad weather off Norway's western coast while authorities prepare to tow the vessel to a nearby port.", "url": "https://www.foxnews.com/world/more-passengers-lifted-off-norway-cruise-ship-before-towing", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-1abbcaec8e774ea08ed8eb3e6f2ddbc4-1.jpeg", "publishedAt": "2019-03-24T08:51:47Z", "content": "STAVANGER, Norway Rescue workers are evacuating more passengers from a cruise ship that had engine problems in bad weather off Norway's western coast while authorities prepare to tow the vessel to a nearby port.\r\nNorway's Joint Rescue Center said 379 of the 1… [+583 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Washington and the public await AG Barr's summary of Mueller report's contents - Fox News", "description": "Washington and the public await AG Barr's summary of Mueller report's contents Fox News Tensions rise as Attorney General William Barr reviews Mueller's report ABC News Inside Trump's evening for the ages: When he learned Mueller was done CNN Mueller report's…", "url": "https://www.foxnews.com/politics/barr-pours-over-muellers-findings-preparing-conclusions-from-report", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/AP19081850919960.jpg", "publishedAt": "2019-03-24T08:15:23Z", "content": "U.S. Attorney General William Barr spent Saturday poring over Special Counsel Robert Mueller’s confidential report of his two-year Russia probe, as Barr and his advisers decide how much of Mueller's findings will be made available to Congress and the American… [+4608 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Kurds to rally in Turkey ahead of key local elections", "description": "Supporters of a pro-Kurdish party in Turkey are planning to rally for local elections that will test the Turkish president's popularity.", "url": "https://www.foxnews.com/world/kurds-to-rally-in-turkey-ahead-of-key-local-elections", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-4f7913142b804575b13b6228d711021a-1.png", "publishedAt": "2019-03-24T08:00:45Z", "content": "ISTANBUL Supporters of a pro-Kurdish party in Turkey are planning to rally for local elections that will test the Turkish president's popularity.\r\nThe Peoples' Democratic Party, or HDP, is holding the rally Sunday in Istanbul amid a polarized race for municip… [+608 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "No 'Cinderella' yet for NCAA Sweet 16 as favorites dominate Saturday games", "description": "Fletcher Magee shot Wofford out of the NCAA Tournament. Murray State's Ja Morant scored 28 points but his team couldn't slow down Florida State. Their exits leave the Sweet 16 searching for a Cinderella.", "url": "https://www.foxnews.com/sports/no-cinderella-in-ncaa-mens-tourney-as-favorites-dominate-saturdays-games", "urlToImage": null, "publishedAt": "2019-03-24T07:31:44Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "UK's Theresa May faces pressure to step down to save Brexit", "description": "British Prime Minister Theresa May is facing increased pressure from her own Conservative Party to either resign or to set a date for stepping down in order to build support for her Brexit plan.", "url": "https://www.foxnews.com/world/uks-theresa-may-faces-pressure-to-step-down-to-save-brexit", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ccb70efb-ContentBroker_contentid-5889dc582a4d41459bf8c5a76493a41c.png", "publishedAt": "2019-03-24T07:24:16Z", "content": "LONDON British Prime Minister Theresa May is facing increased pressure from her own Conservative Party to either resign or to set a date for stepping down in order to build support for her Brexit plan.\r\nBritish media reported Sunday that senior party figures … [+494 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "The Wall Street Journal", "title": "Federal prosecutor who led Michael Cohen case to step down - Fox News", "description": "Federal prosecutor who led Michael Cohen case to step down Fox News Inside Trump's evening for the ages: When he learned Mueller was done CNN Mueller report: US Congress awaits key findings from Attorney General Barr BBC News What should Democrats do next, af…", "url": "https://www.foxnews.com/politics/federal-prosecutor-who-led-michael-cohen-case-to-step-down", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/19/694940094001_6015835433001_6015829501001-vs.jpg", "publishedAt": "2019-03-24T07:06:45Z", "content": "Robert Khuzami, the federal prosecutor in Manhattan who supervised the criminal case against President Trump’s former lawyer Michael Cohen, is stepping down from his position next month.\r\nDuring Mr. Khuzami’s 15-month stint as deputy U.S. attorney for the Sou… [+1695 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Russian arrested smuggling drugged orangutan in Indonesia", "description": "Authorities say they have arrested a Russian tourist who was attempting to smuggle a drugged orangutan out of Indonesia's resort island of Bali.", "url": "https://www.foxnews.com/world/russian-arrested-smuggling-drugged-orangutan-in-indonesia", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-03-24T06:59:28Z", "content": "DENPASAR, Indonesia Authorities say they have arrested a Russian tourist who was attempting to smuggle a drugged orangutan out of Indonesia's resort island of Bali.\r\nKetut Catur Marbawa from Bali province's conservation agency says 27-year-old Andrei Zhestkov… [+527 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Driver working with NBC News killed in Syria", "description": "The president of NBC News says a driver working with its reporters in Syria was killed by an explosive device.", "url": "https://www.foxnews.com/world/driver-working-with-nbc-news-killed-in-syria", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-92feb07a03504bdb9d20a8f884fafe00.png", "publishedAt": "2019-03-24T06:43:45Z", "content": "BAGHOUZ, Syria The president of NBC News says a driver working with its reporters in Syria was killed by an explosive device.\r\nNoah Oppenheim said in a statement Sunday that NBC employees escaped unharmed, and expressed \"deepest sympathies\" to the driver's fa… [+577 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Proud father Dr. Dre brags after daughter gets into USC ‘on her own’", "description": "Hip hop legend Dr. Dre took a jab at high-profile celebrities and other wealthy parents caught up in a recent college admission scandal while boasting about his daughter's acceptance into the University of Southern California.", "url": "https://www.foxnews.com/entertainment/dr-dre-brags-after-daughter-gets-into-usc-on-her-own", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/AP19074666406605.jpg", "publishedAt": "2019-03-24T06:32:12Z", "content": "Hip hop legend Dr. Dre took a jab at high-profile celebrities and other wealthy parents caught up in a recent college admission scandal while boasting about his daughter's acceptance into the University of Southern California.\r\n\"My daughter got accepted into … [+1096 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Thousands attend New Zealand vigil to honor 50 mosque dead", "description": "Thousands of people have gathered in the New Zealand city of Christchurch to listen to prayers, songs and speeches at a vigil to remember the 50 people killed in a terrorist attack on two mosques.", "url": "https://www.foxnews.com/world/thousands-attend-new-zealand-vigil-to-honor-50-mosque-dead", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-ef2965df0cd84eb4b4f38bdc6a896f59.png", "publishedAt": "2019-03-24T06:11:40Z", "content": "CHRISTCHURCH, New Zealand Thousands of people have gathered in the New Zealand city of Christchurch to listen to prayers, songs and speeches at a vigil to remember the 50 people killed in a terrorist attack on two mosques.\r\nOne of those watching from a wheelc… [+465 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News", "title": "Miley Cyrus marks National Puppy Day with another nude photo this time with a dog", "description": "Saturday was National Puppy Day, so singer Miley Cyrus marked the occasion in a way unlikely to surprise those who follow her career: She posted a photo of herself naked with a dog.", "url": "https://www.foxnews.com/entertainment/miley-cyrus-marks-national-puppy-day-with-another-nude-photo-this-time-with-a-dog", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/20/694940094001_6016061168001_6016052036001-vs.jpg", "publishedAt": "2019-03-24T06:06:17Z", "content": "Saturday was National Puppy Day, so singer Miley Cyrus marked the occasion in a way unlikely to surprise those who follow her career: She posted a photo of herself naked with a dog.\r\nActually, Cyrus isn’t totally naked: She’s wearing a yellow floppy hat and a… [+673 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Venezuelan power struggle creates diplomatic duel abroad", "description": "When Lorena Delgado approached the Venezuelan consulate in Colombia's capital on a recent afternoon hoping to extend the life of her expiring passport, she found the metal gates to the languishing building shuttered.", "url": "https://www.foxnews.com/world/venezuelan-power-struggle-creates-diplomatic-duel-abroad", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-104b36e6c9774332abaa69a48c702376.png", "publishedAt": "2019-03-24T05:02:11Z", "content": "BOGOTA, Colombia When Lorena Delgado approached the Venezuelan consulate in Colombia's capital on a recent afternoon hoping to extend the life of her expiring passport, she found the metal gates to the languishing building shuttered.\r\nDays earlier, Venezuelan… [+7276 chars]"}]}