{"status": "ok", "totalResults": 966, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Rachel Becker", "title": "Even in a warmer Europe, wind and solar could still keep the lights on", "description": "A new study published today in the journal Joule investigates how the effects of climate change on wind, sunlight, and temperature might change electricity supply and demand in Europe. The study reports that a grid powered by wind and solar should be pretty r…", "url": "https://www.theverge.com/2019/3/6/18253359/climate-change-electricity-grid-wind-solar-photovoltaic-power-renewable-energy-europe", "urlToImage": "https://cdn.vox-cdn.com/thumbor/O0E57HudNzZiqPz7X5MjW9lBUDA=/0x355:4944x2943/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15885136/621744270.jpg.jpg", "publishedAt": "2019-03-06T17:53:47Z", "content": "Europes electricity future could be both green and consistent, even as climate change warms the continent, according to a new study. Thats good news for Europeans who are trying to shift their power grids toward wind and solar power and away from traditional … [+4337 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Facebook’s US user base declined by 15 million since 2017, according to survey", "description": "Facebook’s user base is shrinking, particularly in the coveted 12- to 34-year-old demographic, according to new survey data compiled by market research firm Edison Research. The survey, which only collected data about users in the US (Facebook’s most lucrativ…", "url": "https://www.theverge.com/2019/3/6/18253274/facebook-users-decline-15-million-people-united-states-privacy-scandals", "urlToImage": "https://cdn.vox-cdn.com/thumbor/8q2TWu90nao2JJXb451tjnixIjw=/0x208:2040x1276/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11559995/akrales_180614_1777_0080.jpg", "publishedAt": "2019-03-06T17:34:23Z", "content": "Facebooks user base is shrinking, particularly in the coveted 12- to 34-year-old demographic, according to new survey data compiled by market research firm Edison Research. The survey, which only collected data about users in the US (Facebooks most lucrative … [+2953 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "Snap reportedly settled with women who alleged discrimination after layoffs", "description": "The layoffs were alleged to have disproportionately targeted women, with one round of job cuts eliminating only women from a pair of small teams. Snap was previously accused of having a “toxic” workplace with a “pervading sexist vibe.”", "url": "https://www.theverge.com/2019/3/6/18253194/snap-layoff-discrimination-allegation-settlements-report", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Vtr_bye4QQoxTREabRUhergwXjk=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/3446802/snapchat-stock-0961.0.jpg", "publishedAt": "2019-03-06T17:17:48Z", "content": "Snap reached settlements with three women last year who alleged discrimination at the company after they were laid off, according to The Wall Street Journal. Snap was previously accused of having a toxic workplace with a pervading sexist vibe, and the new all… [+1912 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Stefan Etienne", "title": "Smart Compose for Gmail is now available on all Android devices", "description": "Smart Compose is one of Gmail’s newer and more interesting features. It allows you to begin an email using auto-suggested words and phrases that are typically in line with what you’d usually write. Previously a Pixel device exclusive, the app is now available…", "url": "https://www.theverge.com/2019/3/6/18253229/smart-compose-gmail-android-available", "urlToImage": "https://cdn.vox-cdn.com/thumbor/8wT7L_Y1X5ZLfACAp0aic__CCgg=/0x240:900x711/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15876801/smart_compose_s10_plus_test.jpg", "publishedAt": "2019-03-06T17:16:22Z", "content": "Smart Compose is a useful Gmail feature thats arriving on all Android devices starting today. By following your writing patterns and language used, Gmail can automatically generate your frequently used phrases as you type. First spotted by Android Police, Sma… [+788 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "Sonos is replacing the Sonos One with a faster, more capable version", "description": "Sonos is launching an improved Sonos One “Gen 2” speaker with Bluetooth Low Energy, a faster processor, and more memory than the original.", "url": "https://www.theverge.com/2019/3/6/18253263/sonos-one-gen-2-speaker-features-release-date-price", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ryjpBa4A7LTmwfTrbQHpd4Bo77E=/0x109:2040x1177/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9480609/cwelch_171017_2068_0005.jpg", "publishedAt": "2019-03-06T17:08:52Z", "content": "Its not exactly what Id consider to be a successor or proper sequel, but Sonos tells me that beginning March 7th, it will start selling a new revision of its Sonos One smart speaker with improved internals. The new Gen 2 model will include Bluetooth Low Energ… [+1992 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "Democrats push new bill to write net neutrality into law, but can it pass?", "description": "The dual bills are called the Save the Internet Act. The full text has yet to be released, but according to lawmakers, it will put the same rules in place that the FCC worked to remove over a year ago.", "url": "https://www.theverge.com/2019/3/6/18253176/net-neutrality-bill-democrats-law-fcc-house-senate-congress", "urlToImage": "https://cdn.vox-cdn.com/thumbor/0y4XZoRGKBDfknDRTeokZe2voSc=/0x243:3750x2206/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15876639/1132315346.jpg.jpg", "publishedAt": "2019-03-06T17:07:55Z", "content": "Today, Democrats officially launched their efforts to save net neutrality once and for all. Lawmakers in both the House and Senate have announced bills with the intention of reinstating the net neutrality rules that the Federal Communications Commission moved… [+5134 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "A new tool from Google and OpenAI lets us better see through the eyes of artificial intelligence", "description": "This is how machine vision algorithms make sense of the world.", "url": "https://www.theverge.com/2019/3/6/18251274/ai-artificial-intelligence-tool-machine-vision-algorithms", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ja0Nqgu8uHlEEbUdHTE3R5gUBX0=/0x122:1718x1021/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15868091/Screen_Shot_2019_03_06_at_3.55.44_PM.png", "publishedAt": "2019-03-06T17:03:50Z", "content": "What does the world look like to AI? \r\nResearchers have puzzled this for decades, but in recent years the question has become more pressing. Machine vision systems are being deployed in more and more areas of life, from healthcare to self-driving cars, but se… [+10993 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Casey Newton", "title": "Notion’s new web clipper makes it a powerful competitor to Evernote", "description": "Notion, a sophisticated note-taking app, has mounted an all-out assault on Evernote. It’s adding a web clipper and one-click importing tool", "url": "https://www.theverge.com/2019/3/6/18251787/notion-evernote-web-clipper-import-tool", "urlToImage": "https://cdn.vox-cdn.com/thumbor/fVJfoiHT9FKudmDKihnAhyUusjk=/0x78:1532x880/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15873651/web_clipper_casey.png", "publishedAt": "2019-03-06T17:00:00Z", "content": "In the years since Evernote cratered, ambitious note-takers have been searching for an app that matches its utility, speed, and ease of use. Some ambition would be nice, too a sense that the developer will go beyond the simple text notes and tables that are p… [+4710 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Angela Chen", "title": "Google partners with NASA and CERN to create massive online exhibit honoring science", "description": "Google Arts & Culture, the team that brought the ubiquitous art-matching selfie art app last year, has partnered with museums from around the world to create Once Upon a Try, a collection of videos dedicated and images honoring science and human discovery.", "url": "https://www.theverge.com/2019/3/6/18253133/google-arts-culture-once-upon-a-try-science-discovery-museum-nasa-cern-exhibit", "urlToImage": "https://cdn.vox-cdn.com/thumbor/AIy0kdTA5JuzoP8FLuyTVM_53fA=/111x0:1253x598/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15868508/Screen_Shot_2019_03_06_at_11.00.33_AM.png", "publishedAt": "2019-03-06T16:54:09Z", "content": "Googles Arts &amp; Culture division, the team behind the viral art-matching selfie trend from last year, has partnered with museums from around the world to create a collection of videos and images dedicated to honoring science and human discovery. \r\nThe Once… [+1356 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Natt Garun", "title": "Parisian residents are demanding gates to keep Instagrammers off their famous street", "description": "Residents of Paris’ picturesque Rue Crémieux are demanding that the city install gates on both ends of the road to prevent Instagrammers and influencers from overcrowding the street.", "url": "https://www.theverge.com/2019/3/6/18253180/paris-rue-cremieux-instagram-street-gates-over-tourism", "urlToImage": "https://cdn.vox-cdn.com/thumbor/7RM6r_XVVh96asLUmr5SHiIbtjY=/0x41:2048x1113/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15870995/14672956801_61d908502b_k.jpg", "publishedAt": "2019-03-06T16:44:23Z", "content": "Yet another public space is finding itself loved to death by the onslaught of Instagrammers. Residents of Paris Rue Crémieux, a car-less cobblestone street lined with pastel-colored homes, this week are demanding that the city install gates on both ends of th… [+1978 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "The apocalypse is nigh in the latest Good Omens trailer", "description": "The Amazon Prime adaptation of Good Omens, the cult-favorite novel by Terry Pratchett and Neil Gaiman, is nearing its release, and a new trailer has given us the best look yet at the upcoming series, including all of the characters who aren’t Crowley and Azir…", "url": "https://www.theverge.com/2019/3/6/18253236/good-omens-trailer-terry-pratchett-neil-gaiman-amazon-prime", "urlToImage": "https://cdn.vox-cdn.com/thumbor/sycS1bCq478W9oSARFSRB9vFwlU=/16x0:2423x1260/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15872231/Screen_Shot_2019_03_06_at_11.17.56_AM.png", "publishedAt": "2019-03-06T16:34:59Z", "content": "The Amazon Prime adaptation of Good Omens, the cult-favorite novel by Terry Pratchett and Neil Gaiman, is nearing its release, and a new trailer has given us the best look yet at the upcoming series. Fans of the book will note that the adaption appears to be … [+503 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Google unveils new tools to bolster AI hardware development", "description": "Google has launched a trio of new hardware products for developers who are working with artificial intelligence. These include a dev board, a USB accelerator, and an add-on camera, all under the new Google Coral brand. They’re designed to help developers prot…", "url": "https://www.theverge.com/circuitbreaker/2019/3/6/18253106/google-ai-developer-new-tools-dev-board-usb-accelerator-camera-coral", "urlToImage": "https://cdn.vox-cdn.com/thumbor/owIpjCC3iRaaBb2O9AL9-kqfV14=/0x19:1000x543/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15858014/coral_harware_development_board.jpg", "publishedAt": "2019-03-06T16:28:37Z", "content": "Google continues to expand its range of AI products and services with a trio of new hardware devices aimed at the development community. \r\nThe devices dont seem to have been officially announced yet and were first spotted by Hackster. Theyre being introduced … [+1869 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "AT&T’s new HBO chief criticizes Netflix, says it ‘doesn’t have a brand’", "description": "AT&T’s new head of HBO, Bob Greenblatt, was just hired on Monday, and by Tuesday, he was already criticizing Netflix. He told NBC News’ Dylan Byers, “Netflix doesn’t have a brand. It’s just a place you go to get anything — it’s like Encyclopedia Britannica.”", "url": "https://www.theverge.com/2019/3/6/18253170/att-hbo-streaming-wars-netflix-bob-greenblatt-criticism", "urlToImage": "https://cdn.vox-cdn.com/thumbor/M835Q0A-Ko8lPq7C0UtzwoqpGA4=/0x0:3950x2068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15866177/1066863626.jpg.jpg", "publishedAt": "2019-03-06T16:27:31Z", "content": "AT&T’s new head of HBO, Bob Greenblatt, was just hired on Monday, and by Tuesday, he was already criticizing Netflix. He told NBC News’ Dylan Byers, “Netflix doesn’t have a brand. It’s just a place you go to get anything — it’s like Encyclopedia Britannica.” … [+1628 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Barbara Krasnoff", "title": "Android 101: how to organize your home screen", "description": "There are essentially two steps to making sense of all of those Android apps: find a way to organize them (and there are a variety of ways, depending on what you’re comfortable with) and periodically remove all of the extra apps that you’ve accumulated and no…", "url": "https://www.theverge.com/2019/3/6/18246685/how-to-organize-android-home-screen", "urlToImage": "https://cdn.vox-cdn.com/thumbor/frCTfrPlx2U0U-X2BhFTIp6gEs0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9474509/jbareham_171013_2050_0271.jpg", "publishedAt": "2019-03-06T16:11:56Z", "content": "If youve had an Android phone for any length of time, its easy to get used to living with, well, chaos. If youre anything like me, youre constantly adding new apps, deciding theyre okay but not great, adding another, and so on. Then, a few months later, as yo… [+7875 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Alexa’s new Song ID feature will tell you what song is playing", "description": "Amazon is rolling out a new feature for Alexa today called Song ID, which allows the virtual assistant to announce the name and artist of whatever songs you’re playing before they play.", "url": "https://www.theverge.com/2019/3/6/18253186/alexa-song-id-feature-identify-name-artist", "urlToImage": "https://cdn.vox-cdn.com/thumbor/H3pbYsolBfFl6cgHckGUoqiec8Q=/0x162:2040x1230/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13459116/dseifert_181120_3099_2238.jpg", "publishedAt": "2019-03-06T16:02:47Z", "content": "Amazon is rolling out a new feature for Alexa today called Song ID, which allows the virtual assistant to announce the name and artist of whatever songs you’re playing before they play. This basically turns Alexa into the digital embodiment of that opening ac… [+612 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Devil May Cry 5 is delightfully old-school pure action bliss", "description": "Capcom has returned to its demon-hunting series with Devil May Cry 5, and the latest entry on PC, PS4, and Xbox One is one of the best pure action games in years.", "url": "https://www.theverge.com/2019/3/6/18252281/devil-may-cry-5-review-ps4-xbox-pc", "urlToImage": "https://cdn.vox-cdn.com/thumbor/1zH6gu95QhMIh3sfHaBG8h5GJIg=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15635939/DMC5_screens_08_png_jpgcopy.jpg", "publishedAt": "2019-03-06T16:00:00Z", "content": "Theres little in the depths of hell that surprises me anymore. I wander down cramped hallways built from still-wet bone and sinew with nauseating puddles of blood dotting the ground. When the space opens up, I know exactly whats coming: a fight with demonic h… [+8511 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Google is making it easier for AI developers to keep users’ data private", "description": "Google has announced a new module for its open-source machine learning framework named TensorFlow Privacy. This allows AI developers to use the statistical technique known as differential privacy to safeguard users’ data with just a few extra lines of code.", "url": "https://www.theverge.com/2019/3/6/18253002/google-ai-data-privacy-tensorflow-differential-module-code", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2K8juMqn32871y1HdXGVIUlhSiE=/0x144:2000x1191/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8534971/TPU_PERSON_FORWEBONLY_FINAL.jpg", "publishedAt": "2019-03-06T16:00:00Z", "content": "Google has announced a new module for its machine learning framework, TensorFlow, that lets developers improve the privacy of their AI models with just a few lines of extra code. TensorFlow is one of the most popular tools for building machine learning applic… [+3468 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Kia turned 21 phone screens into a concept car dashboard", "description": "The Kia Imagine is a “pure concept” car, designed to attract attention and stir conversation at the Geneva Motor Show 2019.", "url": "https://www.theverge.com/2019/3/6/18253029/kia-imagine-concept-car-21-screen-dashboard-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/bBlrIa4v9WCKM8Kr7GKBI2iOaS8=/0x79:2040x1147/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15859425/kiaimagine_geneva19_vladsavov.jpg", "publishedAt": "2019-03-06T15:17:20Z", "content": "When you can’t afford a flexible screen, but you really want a curve in your instrument cluster Ralph Kluge, head of Kia’s interior design team, thinks EVs up until now have been too logical, appealing to customers’ reason instead of their emotion. So, in a d… [+2885 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "How artificial intelligence will revolutionize the way video games are developed and played", "description": "Until now, the kind of self-learning artificial intelligence that’s led to advances in self-driving cars, computer vision, and natural language processing hasn’t really bled over into commercial video game development. But AI researchers and game designers ar…", "url": "https://www.theverge.com/2019/3/6/18222203/video-game-ai-future-procedural-generation-deep-learning", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2_fYPSyvvHSDJ0NIvrahsyHWiO8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13292779/acastro_181017_1777_brain_ai_0002.jpg", "publishedAt": "2019-03-06T15:00:00Z", "content": "If you asked video game fans what an idealized, not-yet-possible piece of interactive entertainment might look like in 10 or even 20 years from now, they might describe something eerily similar to the software featured in Orson Scott Cards sci-fi classic Ende… [+22268 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Stefan Etienne", "title": "Nvidia’s RTX cards bring massive power and prices to gaming laptops", "description": "Ray tracing and DLSS arrive on laptops.", "url": "https://www.theverge.com/2019/3/6/18252134/nvidias-rtx-cards-bring-ray-tracing-dlss-high-prices-to-gaming-laptops", "urlToImage": "https://cdn.vox-cdn.com/thumbor/PxN7u5YQlEItbqs6OOrKpcPHfcQ=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15303357/akrales_190204_3211_0008.jpg", "publishedAt": "2019-03-06T15:00:00Z", "content": "Late last year, Nvidia released its new RTX graphics cards for desktops, showcasing more power, new lighting effects capabilities, and sky-high price tags. Less than half a year later, the first mobile RTX graphics cards are arriving in laptops, like the new … [+11327 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Galaxy S10 teardowns show off the ultrasonic fingerprint sensor and hole-punch screen", "description": "The Galaxy S10 is about to hit stores, which means that it’s time for the long-standing tradition of the teardown. iFixit stripped Samsung’s latest phone down to pieces to figure out what makes it tick.", "url": "https://www.theverge.com/circuitbreaker/2019/3/6/18252993/galaxy-s10-teardown-ifixit-ultrasonic-fingerprint-sensor-hole-punch-screen", "urlToImage": "https://cdn.vox-cdn.com/thumbor/prK5ILE6uOJmSzLGNmzezqJUvDc=/0x0:1600x838/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15841398/hWBZ1MhKyheJZqlJ.jpeg", "publishedAt": "2019-03-06T14:21:17Z", "content": "The Galaxy S10 is about to hit stores, which means that it’s time for the long-standing tradition of the teardown. iFixit stripped Samsung’s latest phone down to pieces to figure out what makes it tick. iFixit has teardowns of all three of Samsung’s new phone… [+1430 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Natt Garun", "title": "Fitbit’s new $160 Versa Lite is a stripped-down version of its entry-level smartwatch", "description": "Fitbit has announced a new line of lower-cost smartwatches and fitness trackers: the Versa Lite, Ace 2, Inspire, and Inspire HR. It’s discontinuing older models, including the Alta, Alta HR, Flex 2, and Zip.", "url": "https://www.theverge.com/2019/3/6/18251931/fitbit-versa-lite-ace-2-inspire-hr-smartwatch-fitness-tracker-announce", "urlToImage": "https://cdn.vox-cdn.com/thumbor/MA3QHIo2yn31M7LI_wrUnKiLOAU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15588834/ngarun_190305_3273_0034.jpg", "publishedAt": "2019-03-06T14:00:00Z", "content": "Fitbit’s renewed take on the smartwatch appeared to have worked with the Versa, which helped the company grow its smartwatch revenue by 437 percent less than a year after the device was announced. Now, the company is hoping more affordable versions of its wea… [+3134 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Harman just patented a futuristic system of flying robot speakers for 3D audio", "description": "Harman, the audio company that was purchased by Samsung two years ago, has filed a patent for a sound system that uses robots to create the impression of surround sound. The speakers could move and hover around the user with the help of quadcopters or even je…", "url": "https://www.theverge.com/2019/3/6/18252986/harman-samsung-flying-robot-speakers-vr-3d-audio-surround-sound", "urlToImage": "https://cdn.vox-cdn.com/thumbor/uvAkenE86Odd8-DfTaVkSdPFqyE=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/678014/samsung-unpacked-gear-vr-1_2040.0.jpg", "publishedAt": "2019-03-06T13:49:31Z", "content": "Harman, the audio company that was purchased by Samsung two years ago, has filed a patent for a sound system that uses robots to create the impression of surround sound (via Variety). The patent details how the speakers could move and hover around the user wi… [+1485 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "The electric Pininfarina Battista is my new dream car", "description": "The Pininfarina Battista, is a 1,900-horsepower, all-electric, $2.6 million hypercar, unveiled at the Geneva Motor Show 2019. Its sensual design language, futuristic specs provided by a Rimac powertrain, and exclusivity cachet rank it among the finest electri…", "url": "https://www.theverge.com/2019/3/6/18252896/pininfarina-battista-ev-hypercar-photos-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/JzaQW0cwGuG12Y-uAdp2GHiu06g=/0x80:2040x1148/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15829607/pininfarina_battista_geneva19_vladsavov.jpg", "publishedAt": "2019-03-06T13:06:38Z", "content": "Hypercars are like big cities: more glamorous from a distance, rarely affordable to people who earn an honest living, and often claustrophobically limited in interior space. The Geneva Motor Show is full of them every year, but in 2019, Pininfarina has delive… [+3892 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Meizu CEO says port-less phone was a publicity stunt", "description": "Meizu’s CEO has admitted that a recent crowdfunding campaign for the Meizu Zero, the “World’s First Holeless Phone,” was a publicity stunt. “This crowdfunding project was just the marketing team messing about,” the CEO wrote.", "url": "https://www.theverge.com/circuitbreaker/2019/3/6/18252925/meizu-zero-portless-phone-indiegogo-crowdfunding-publicity-stunt", "urlToImage": "https://cdn.vox-cdn.com/thumbor/7z60OyZDOEjVMth_Tw6B4oO8yoY=/0x131:1820x1084/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13725408/Screen_Shot_2019_01_23_at_9.09.43_AM.0.jpg", "publishedAt": "2019-03-06T12:04:10Z", "content": "In a surprisingly candid post on the companys official forums, Meizus CEO Jack Wong has admitted that a recent crowdfunding campaign for the Meizu Zero, the Worlds First Holeless Phone, was little more than a publicity stunt (via Engadget). This crowdfunding … [+1322 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Elizabeth Lopatto", "title": "Las Vegas bets on Elon Musk’s Boring Company for tunnel project", "description": "Las Vegas’ Convention and Visitors Authority has recommended selecting Elon Musk’s The Boring Company to build and operate a “people mover” at Las Vegas’ convention center. The project would be relatively small, encompassing the convention center itself rathe…", "url": "https://www.theverge.com/2019/3/6/18252302/boring-company-las-vegas-dig-plans-2021", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ZJCmS44fhzUQRWif94NPPmg3cO0=/0x251:3305x1981/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15671309/Entrance_to_LVCC_Loop_outside_New_Exhibition_Hall.jpg", "publishedAt": "2019-03-06T12:00:00Z", "content": "Las Vegas Convention and Visitors Authority has recommended selecting Elon Musks The Boring Company to build and operate a people mover at Las Vegas convention center, says Steve Hill, LVCVAs president and CEO. If the LVCVAs directors approve the move, the go… [+3681 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Casey Newton", "title": "Why content moderators fall for conspiracy theories", "description": "A stressful job, plus repeated exposure, can change a person’s views", "url": "https://www.theverge.com/interface/2019/3/6/18252412/content-moderator-conspiracy-theories-stress-exposure", "urlToImage": "https://cdn.vox-cdn.com/thumbor/yUvmZKZjqqLRVNUqCKOlIlGH-6M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11936573/acastro_180806_1777_facebook_0001.jpg", "publishedAt": "2019-03-06T11:00:00Z", "content": "In discussing my story last week on the secret lives of Facebooks content moderators in America, interviewers often ask me about how the job can make workers more susceptible to conspiracy theories. In my interviews with workers at a content moderation site i… [+18468 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Mitsubishi’s new power system lets your car power your home", "description": "Mitsubishi will soon sell a system that lets your share power between your home and electric car. The Dendo Drive House (DDH) features a bi-directional charger that lets power flow from your home to your car, or from your car to your home.", "url": "https://www.theverge.com/2019/3/6/18252883/mitsubishi-dando-drive-home-power-battery-electric-car-plug-in-hybrid", "urlToImage": "https://cdn.vox-cdn.com/thumbor/eHPvoOw0Uleeh55LTyGUY1sQBaw=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15784459/mitsubishi_engelberg_geneva_vladsavov10.jpg", "publishedAt": "2019-03-06T10:25:49Z", "content": "Coming this year, Mitsubishi will sell a system that lets you share power between your home and electric car. Launched today at the Geneva Motor Show, the Dendo Drive House (DDH) features solar panels, a home battery, and a bi-directional charger that lets po… [+2370 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "The Polestar 2’s secret weapon against the Tesla Model 3 is native Android Auto", "description": "In among the ornate (Aston Martin’s new Lagonda concept) and the obscene (Bugatti’s one-off La Voiture Noire), Volvo spin-off brand Polestar is gracing the Geneva Motor Show 2019 with a car that merits attention for its relevance as well as it looks. The Pole…", "url": "https://www.theverge.com/2019/3/6/18252789/polestar-2-price-release-date-photos-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/4GvHd20ESwHC5Bc4nPybGveEhyI=/0x80:2040x1148/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15752673/geneva_polestar2_vladsavov.jpg", "publishedAt": "2019-03-06T07:35:45Z", "content": "In among the ornate (Aston Martins new Lagonda concept) and the obscene (Bugattis one-off La Voiture Noire), Volvo spin-off brand Polestar is gracing the Geneva Motor Show 2019 with a car that merits attention for its relevance as well as it looks. The Polest… [+5106 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Angela Chen", "title": "FDA approves ketamine-derived depression drug", "description": "The US Food and Drug Administration has approved a new depression drug, esketamine, for patients who have not responded to other antidepressants. The treatment, a nasal spray related to the party drug ketamine, will be the first fast-acting depression drug on…", "url": "https://www.theverge.com/2019/3/5/18252572/esketamine-fda-depression-fast-acting-treatment-health-science", "urlToImage": "https://cdn.vox-cdn.com/thumbor/70rk2ztwJ5Il6kB_dnWVsSglGvI=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9912335/acastro_170726_1777_0008_v2.jpg", "publishedAt": "2019-03-06T03:24:20Z", "content": "The US Food and Drug Administration has approved a new depression drug, esketamine, for patients who have not responded to other antidepressants. The treatment, a nasal spray related to the party drug ketamine, will be the first fast-acting depression drug on… [+3333 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sam Byford", "title": "Samsung reportedly planning two more foldable phones", "description": "Mate X-style foldable and vertical clamshell said to be in the works", "url": "https://www.theverge.com/circuitbreaker/2019/3/5/18252616/samsung-more-foldable-phones-release-planned-report", "urlToImage": "https://cdn.vox-cdn.com/thumbor/uGQ8XGi6xPqFdjKrvNQCJJhM3ck=/0x131:1820x1084/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15695363/Samsung_Galaxy_Fold_3.0.jpg", "publishedAt": "2019-03-06T03:00:19Z", "content": "Samsung is planning two more foldable phones with significantly different designs to the upcoming Galaxy Fold, according to a report in Bloomberg. While the Galaxy Fold has a tablet-sized inner screen that unfolds like a book, one of the new phones reportedly… [+726 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Uber won’t be charged with fatal self-driving crash, says prosecutor", "description": "Who is criminally responsible when a self-driving car fatally strikes a pedestrian? Not the company that built and tested the car — at least not when it comes to Uber’s fatal crash in Tempe, Arizona last March, which killed 49-year-old Elaine Herzberg. Uber w…", "url": "https://www.theverge.com/2019/3/5/18252423/uber-wont-be-charged-with-fatal-self-driving-crash-says-prosecutor", "urlToImage": "https://cdn.vox-cdn.com/thumbor/inO09VOyzH0um-YbGia5Jy7V3Dg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/7639481/vpavic_081216_1321_0020.0.jpeg", "publishedAt": "2019-03-06T00:55:33Z", "content": "Who is criminally liable when a self-driving car fatally strikes a pedestrian? Not the company that built and tested the car at least not when it comes to Ubers fatal crash in Tempe, Arizona last March, which killed 49-year-old Elaine Herzberg.\r\nUber wont be … [+2364 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Some major Android apps are still sending data directly to Facebook", "description": "Major Android mobile apps from companies including Yelp and Duolingo send data to Facebook immediately after a user logs in, according to a new report from the London-based UK charity and watchdog group Privacy International (PI). This data transfer happens e…", "url": "https://www.theverge.com/2019/3/5/18252397/facebook-android-apps-sending-data-user-privacy-developer-tools-violation", "urlToImage": "https://cdn.vox-cdn.com/thumbor/C5qe6J_kl4CXIBo0X1gyi7hbwUs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11742003/acastro_180720_1777_facebook_0001.jpg", "publishedAt": "2019-03-06T00:41:28Z", "content": "Major Android mobile apps from companies including Yelp and Duolingo send data that could be used to personally identify you for ad tracking straight to Facebook immediately upon logging in, according to a new report from the London-based UK charity and watch… [+5479 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Mary Beth Griggs", "title": "Michael Bloomberg will fight for a carbon-free future instead of the White House", "description": "Former New York City mayor Michael Bloomberg today announced that he will not run for president, but instead launch a campaign to rid the United States of fossil fuels as quickly as possible. Explaining his reasoning on his eponymous news network’s opinion pa…", "url": "https://www.theverge.com/2019/3/5/18252265/michael-bloomberg-beyond-carbon-climate-change-white-house-president", "urlToImage": "https://cdn.vox-cdn.com/thumbor/59GznkRXOEAJr971RqF5yWfSWlM=/0x313:4366x2599/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15638370/1090911042.jpg.jpg", "publishedAt": "2019-03-05T23:01:08Z", "content": "Former New York City mayor Michael Bloomberg today announced that he will not run for president, but instead launch a campaign to rid the United States of fossil fuels as quickly as possible. Explaining his reasoning on his eponymous news networks opinion pag… [+2051 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Former Harley-Davidson engineer starts an all-electric motorcycle company", "description": "Fuell will build electric two-wheelers, including an e-bike coming later this year. The company’s flagship product will be a futuristic electric motorcycle coming in 2021.", "url": "https://www.theverge.com/2019/3/5/18252333/fuell-flow-electric-motorcycle-harley-bike", "urlToImage": "https://cdn.vox-cdn.com/thumbor/PfjTz6WH6glWsFqbI9yuL_kjvzo=/0x49:2500x1358/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15645736/fuell_flow_and_fluid_1.jpg", "publishedAt": "2019-03-05T23:00:57Z", "content": "Former Harley-Davidson engineer Erik Buell announced this week that hes founded an EV startup called Fuell that will make all-electric motorcycles and bicycles. Hes teamed up with Frédéric Vasseur, the owner of the company that makes the chassis for Formula E… [+1907 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "ji32k7au4a83 is a surprisingly bad password", "description": "When you’re creating a new password for an account, it might prompt you to use numbers and letters, and avoid real words. So a password like 420DankMemes might be kind of weak while the password “ji32k7au4a83” might seem stronger. But surprisingly, that parti…", "url": "https://www.theverge.com/tldr/2019/3/5/18252150/bad-password-security-data-breach-taiwan-ji32k7au4a83-have-i-been-pwned", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RFjm1GricwXoqpMd-HSUh7dvpr0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8540151/akrales_161208_1298_A_0060_play.jpg", "publishedAt": "2019-03-05T22:56:33Z", "content": "The password ji32k7au4a83 might look fairly secure thanks to its seemingly random jumble of letters and numbers. But surprisingly, that exact password has appeared in 141 data breaches, as cataloged by the site Have I Been Pwned and spotted by Gizmodo. It lea… [+1899 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "RED’s Hydrogen One is arguably a worse deal now that it’s bundled with Aquaman", "description": "If you happen to be the kind of person who’s willing to spend $1,295 on one of the least inspiring gadgets we’ve ever reviewed, the Red Hydrogen — and yet also the kind of person who hasn’t already bought one and was miraculously waiting until just now — now …", "url": "https://www.theverge.com/tldr/2019/3/5/18252289/red-hydrogen-one-aquaman-bundle", "urlToImage": "https://cdn.vox-cdn.com/thumbor/PSlRvaYx6XpCmYCT7qfwMhAPGPM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13335593/akrales_181025_3026_0296.jpg", "publishedAt": "2019-03-05T22:49:44Z", "content": "I think the hilarity in this image may speak for itself: But I will translate anyhow. If you happen to be the kind of person who’s willing to spend $1,295 on one of the least inspiring gadgets we’ve ever reviewed, an utter mess of a phone — and yet also the k… [+339 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "EV startup NIO abandons plan to make its own cars", "description": "NIO is no longer going to build a factory in Shanghai, and instead will continue using Chinese state-owned automaker JAC to make its cars. The EV startup beat its own expectations in 2018, but is off to a slow start in 2019.", "url": "https://www.theverge.com/2019/3/5/18252244/nio-ev-startup-factory-shanghai-cancelled-jac-motors", "urlToImage": "https://cdn.vox-cdn.com/thumbor/DACGYV5UhLyL7xnoIDyJbm38nXY=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13045377/jbareham_180912_2945_0013.jpg", "publishedAt": "2019-03-05T22:18:19Z", "content": "Chinese EV startup NIO no longer plans to make its own cars, the company announced Tuesday. Plans to build a factory in Shanghai where Tesla is currently constructing the third Gigafactory have been scuttled, and NIO will instead continue using its current co… [+3986 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Rachel Becker", "title": "Former officials urge Trump to stop undermining climate science", "description": "Nearly 60 former leaders in the military and national security community sent a letter today urging President Trump not to subject the government’s own authoritative climate reports to an apparently partisan review, The Washington Post reports.", "url": "https://www.theverge.com/2019/3/5/18252190/trump-climate-science-panel-national-military-security-threat-letter", "urlToImage": "https://cdn.vox-cdn.com/thumbor/LDENqyv5nDGZQAU7oUPRYw-uQUo=/0x257:4800x2770/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8027795/ZC_Night_Oro_Spillway_1_02_20_2017.jpg", "publishedAt": "2019-03-05T21:27:49Z", "content": "Nearly 60 former leaders in the military and national security community sent a letter today urging President Trump not to subject the governments own authoritative climate reports to an apparently partisan review, The Washington Post reports. \r\nThe letter re… [+2904 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Amazon’s HQ2 deal isn’t looking great for Arlington County", "description": "Amazon may have backed out of New York City, but it’s still got one HQ2 left in Arlington, Virginia. A $23 million contract has been drawn up for a country board to vote on March 16th, and The Washington Post saw the terms of the agreement early.", "url": "https://www.theverge.com/2019/3/5/18252093/amazons-hq2-deal-arlington-county-living-wage-affordable-housing", "urlToImage": "https://cdn.vox-cdn.com/thumbor/EVZUhXDpf75QFSVzPtcOMRH-yDw=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15617575/1061175656.jpg.jpg", "publishedAt": "2019-03-05T21:25:50Z", "content": "Amazon may have backed out of New York City, but its still got one HQ2 left in Arlington, Virginia. A $23 million contract has been drawn up for a country board to vote on March 16th, and The Washington Post saw the terms of the agreement early.\r\nThe contract… [+1538 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Pininfarina’s 1,900 horsepower Battista is one of the fastest EVs on the planet", "description": "The storied automotive design firm makes the jump into manufacturing with a powerful electric hypercar that arrives in 2020. Four electric motors combine to get the car to 60 mph in under 2 seconds.", "url": "https://www.theverge.com/2019/3/5/18251972/pininfarina-battista-1900-horsepower-faster-electric-vehicle-car-ev-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/O7Zd8GPmavJxCUlhPasrwigVFBE=/397x400:1929x1202/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15622328/Blu_3.jpg", "publishedAt": "2019-03-05T21:24:23Z", "content": "After months of teasing, Italian automotive design-outfit-turned-manufacturer Pininfarina has revealed its first car, the Battista. Its a sleek $2.6 million hypercar with power that lives up to its brawny-sounding name, and its sure to blow nearly any other c… [+3100 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Adi Robertson", "title": "An Ohio teenager helped school Congress on fighting anti-vax misinformation", "description": "The US Senate held a hearing discussing ways to promote accurate information about vaccines, amid a resurgence of measles outbreaks and declining inoculation rates.", "url": "https://www.theverge.com/2019/3/5/18251807/senate-anti-vax-vaccines-congressional-hearing-ethan-lindenberger-ohio-teen", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Rk-KaX4aYRHzwSuE3FpaOg-MSgs=/0x0:2880x1508/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15612644/Screen_Shot_2019_03_05_at_3.09.02_PM.png", "publishedAt": "2019-03-05T21:00:46Z", "content": "Ethan Lindenberger, an 18-year-old from Ohio who defied his parents anti-vaccination beliefs by getting inoculated, appeared today before Congress to promote vaccine education and outreach campaigns. Lindenberger was one of five people who testified in a Sena… [+4418 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "Apple will now reportedly fix iPhones even if you’ve replaced the battery yourself", "description": "iPhones with third-party batteries are now eligible to be repaired at Apple’s Genius Bars and authorized service providers, according to internal Apple documents reportedly obtained by MacRumors and French outlet iGen. Previously, Apple policies stated that c…", "url": "https://www.theverge.com/2019/3/5/18251882/apple-iphone-third-party-battery-repair-genius-bar", "urlToImage": "https://cdn.vox-cdn.com/thumbor/SQLDXC3dw1OCo3XyoCh3LCIXmmQ=/0x67:592x377/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15590653/6ik3wBhFQRTApGki.jpg", "publishedAt": "2019-03-05T20:53:37Z", "content": "iPhones with third-party batteries are now eligible to be repaired at Genius Bars and Apple Authorized Service Providers (AASP), according to internal Apple documents reportedly obtained by MacRumors and French outlet iGen. Before, Apple policies stated that … [+2110 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Angela Chen", "title": "FDA commissioner Scott Gottlieb resigns", "description": "US Food and Drug Administration commissioner Scott Gottlieb has resigned, according to The Washington Post. The move, which Gottlieb has said is because he wants to have more time with his family, supposedly came as a surprise to senior White House officials.", "url": "https://www.theverge.com/2019/3/5/18252083/scott-gottlieb-resignation-food-and-drug-administration-fda-health-vaping", "urlToImage": "https://cdn.vox-cdn.com/thumbor/GAlz1Tebj28NqhyXptTXSiJx8TA=/0x350:4883x2907/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15614164/866274606.jpg.jpg", "publishedAt": "2019-03-05T20:27:56Z", "content": "US Food and Drug Administration commissioner Scott Gottlieb has resigned, according to TheWashington Post. The move, which Gottlieb has said is because he wants to have more time with his family, supposedly came as a surprise to senior White House officials. … [+1954 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Chinese hackers reportedly targeted 27 universities for military secrets", "description": "Chinese hackers controlled the servers of over two dozen universities in the US and around the world in a bid to gain maritime military research. The findings were uncovered by cybersecurity firm iDefense in a report that was obtained by The Wall Street Journ…", "url": "https://www.theverge.com/2019/3/5/18251836/chinese-hackers-us-servers-universities-military-secrets-cybersecurity", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9yPcpCMuyQA146sHF-sv3RMW6jI=/0x1786:1966x2815/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15597748/2579951.jpg.jpg", "publishedAt": "2019-03-05T20:18:10Z", "content": "Chinese hackers singled out over two dozen universities in the US and around the world in an apparent bid to gain access to maritime military research, according to a report by cybersecurity firm iDefense, which was obtained by The Wall Street Journal.\r\nThe h… [+1875 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Piëch Automotive claims its electric supercar runs on a completely new type of battery", "description": "Electric car startup Piëch Automotive, named for legendary Volkswagen executive (and grandson of the founder of Porsche) Ferdinand Piëch, arrived at the Geneva Motor Show this week with an electric supercar and an interesting story to tell. According to the c…", "url": "https://www.theverge.com/2019/3/5/18251690/piech-automotive-electric-supercar-ev-battery-new-cell", "urlToImage": "https://cdn.vox-cdn.com/thumbor/52_NHbbEcNk0oyL006Jd5mE7kWg=/0x137:2700x1551/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15560741/Mark_Zero_silver.jpg", "publishedAt": "2019-03-05T19:43:09Z", "content": "Electric car startup Piëch Automotive, named for legendary Volkswagen executive (and grandson of the founder of Porsche) Ferdinand Piëch, arrived at the Geneva Motor Show this week with an electric supercar and an interesting story to tell. According to the c… [+3394 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Bugatti’s La Voiture Noire is a $19 million ode to the grotesquely rich", "description": "Bugatti has designed a one-off, blacked-out car — built upon the Chiron drivetrain, and made out of carbon fiber — that costs a whopping $18.9 million. It has already been sold, but won’t be delivered to its buyer for another 2.5 years, because Bugatti has to…", "url": "https://www.theverge.com/2019/3/5/18251803/bugatti-voiture-noire-chiron-custom-price-photos-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/gnjvvJdQ9mQ7OsKPapkR7Jxnuyo=/0x27:2040x1095/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15599479/bugatti_vladsavov_geneva19.jpg", "publishedAt": "2019-03-05T19:26:54Z", "content": "Disregard your bank (im)balance for a moment, and consider this proposition: Bugatti has designed a one-off, blacked-out car built upon the Chiron drivetrain, and made out of carbon fiber and all the finest materials humanity has discovered but it costs a who… [+3338 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Microsoft reportedly launching disc-less Xbox One S next month", "description": "Microsoft is reportedly launching a disc-less Xbox One S in April. Dubbed “Xbox One S All-Digital Edition,” the console will come without a disc drive and rely on digital downloads and storage. It comes just as Microsoft is about to push its xCloud game strea…", "url": "https://www.theverge.com/2019/3/5/18251896/microsoft-xbox-one-s-all-digital-edition-disc-less-console-rumors", "urlToImage": "https://cdn.vox-cdn.com/thumbor/CGp2s1iF4ZOd6NypzstwhXDzpnY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6872941/tpina_160731_1175_0023.0.jpg", "publishedAt": "2019-03-05T19:01:09Z", "content": "Microsoft is reportedly launching a new Xbox One S without a disc drive next month. Windows Central reports that Microsoft will unveil a disc-less Xbox One S All-Digital Edition, with preorders expected to be available in mid-April. This new console is said t… [+1276 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Makena Kelly", "title": "Progressives want the T-Mobile–Sprint merger dead", "description": "Tlaib is reportedly planning to send letters to Federal Communications Commission chair Ajit Pai and the Justice Department’s antitrust head Makan Delrahim later today asking that the two refuse to approve the merger. Approval from the FCC and DOJ are necessa…", "url": "https://www.theverge.com/2019/3/5/18251928/t-mobile-sprint-merger-congress-house-rashida-tlaib-fcc", "urlToImage": "https://cdn.vox-cdn.com/thumbor/J74jJg01cfXPt-DFww_fWE6rPY8=/0x392:5472x3257/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15592139/1127852472.jpg.jpg", "publishedAt": "2019-03-05T18:59:16Z", "content": "Progressive freshman Democrat Rep. Rashida Tlaib (D-MI) is leading an effort in the House to block the proposed $26 billion merger deal between T-Mobile and Sprint, according to The Hill.\r\nTlaib is reportedly planning to send letters to Federal Communications… [+1845 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shana O'Neil", "title": "Captain Marvel meets some of the highest expectations yet for a Marvel movie", "description": "After 20 Marvel Cinematic Universe movies with male protagonists, Marvel Studios brings in its first lead heroine — Captain Marvel (Brie Larson), aka Carol Danvers, aka Vers, the Kree hero and agent of Starforce. The film, set in the 1990s, well before Avenge…", "url": "https://www.theverge.com/2019/3/5/18251874/captain-marvel-review-marvel-mcu-brie-larson-samuel-l-jackson", "urlToImage": "https://cdn.vox-cdn.com/thumbor/UJ8jgMWNqK57QE10loxnbSXqk7g=/10x0:1649x858/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15585530/CaptainMarvel5c1d2766eb7f0.jpg", "publishedAt": "2019-03-05T18:47:46Z", "content": "As the first female-led Marvel movie, Captain Marvel is arriving in theaters under a heavy burden of expectations. Even after years of fans clamoring for a Black Widow standalone movie, it took a full decade and 20 Marvel Cinematic Universe films for the fran… [+8818 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Warner Music joins Sony as latest major label to legalize DJ mixes with Dubset", "description": "DJs and producers will be able to use songs from Warner Music artists in live sets going forward. Warner Music joins Sony Music in joining Dubset.", "url": "https://www.theverge.com/2019/3/5/18194952/dubset-warner-music-sony-soundcloud-license-dj", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YwsiM44Zz16raGbE2wQQiR-vkdA=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15592785/1128847981.jpg.jpg", "publishedAt": "2019-03-05T18:36:34Z", "content": "Dubset, the rights clearance startup that helps DJs use licensed songs in their sets or remixes and monetize the content, has inked a deal with Warner Music. Warner Music Group is one of the biggest music labels to sign a deal with Dubset, meaning a large maj… [+1848 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Google Glass’ second-gen enterprise model leaks with updated specs and USB-C", "description": "Google Glass may not have exactly set the world on fire with its vision of an augmented reality, wearable future, but it got a second life back in 2017 with the Google Glass Enterprise Edition. And now, leaks for the second-generation model of that enterprise…", "url": "https://www.theverge.com/circuitbreaker/2019/3/5/18251800/google-glass-second-gen-enterprise-model-leaks-usb-c", "urlToImage": "https://cdn.vox-cdn.com/thumbor/irsL73w3J90Zsml-xRrFIkAtSjM=/64x0:1512x758/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8869777/AGCO1.jpg", "publishedAt": "2019-03-05T18:05:33Z", "content": "Google Glass may not have exactly set the world on fire with its vision of an augmented reality, wearable future, but it got a second life back in 2017 with the Google Glass Enterprise Edition. And now, leaks for the second-generation model of that enterprise… [+1677 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dani Deahl", "title": "SoundCloud Go+ is now half off for students", "description": "SoundCloud has announced a new deal for college and university students that will let them buy a subscription to SoundCloud Go+ at half price. The offer knocks 50 percent off the price, making it only $4.99 a month for eligible students.", "url": "https://www.theverge.com/2019/3/5/18251615/soundcloud-go-is-half-off-student-discount", "urlToImage": "https://cdn.vox-cdn.com/thumbor/fe---oMPaCf6iENxdb9DWpwyFPg=/0x180:2500x1489/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6255495/akrales_160328_1001_A_195.0.png", "publishedAt": "2019-03-05T18:02:51Z", "content": "SoundCloud has announced a new deal for college and university students that will let them buy a subscription to SoundCloud Go+ at half price. The offer knocks 50 percent off the price, making it only $4.99 a month for eligible students.\r\nSoundCloud Go+ is th… [+783 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "I flew a helicopter, and then the helicopter flew me", "description": "After half a decade of development, Sikorsky’s autonomous helicopter tech is ready for takeoff. It could help make everything from Black Hawks, to commercial helicopters, to planes easier to fly. And it just might make flying taxis possible, too.", "url": "https://www.theverge.com/transportation/2019/3/5/18250996/sikorsky-autonomous-helicopter-flying-taxi-lockheed", "urlToImage": "https://cdn.vox-cdn.com/thumbor/k73zfnc0gkpMeQB_uW-sMLY5bxk=/0x591:8256x4914/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15394156/D85_1824.jpg", "publishedAt": "2019-03-05T18:00:24Z", "content": "You would die. \r\nIm sitting in a secure beige conference room at the headquarters of Lockheed Martin-owned aircraft manufacturer Sikorsky in Stratford, Connecticut. In a few hours, Ill be in the cockpit of a Sikorsky S-76 helicopter outfitted with the company… [+17743 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Vizio’s P-Series 4K HDR TV is $100 off, and PC accessories are cheaper today", "description": "Several 4K HDR TVs, including Vizio’s P-series, Toshiba Fire TV Edition TVs, Sharp’s Roku TV, and more are discounted at Best Buy and Walmart. You’ll also find good deals on PC accessories from HyperX, Corsair, and Intel.", "url": "https://www.theverge.com/good-deals/2019/3/5/18251635/vizios-p-series-4k-hdr-tv-is-100-off-and-pc-accessories-are-cheaper-today", "urlToImage": "https://cdn.vox-cdn.com/thumbor/swXQklbztMFm0nVmqLx4NWAUBcQ=/0x79:1398x811/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10621345/Screen_Shot_2018_04_10_at_12.14.57_AM.png", "publishedAt": "2019-03-05T17:48:21Z", "content": "I’m reluctant to say that there’s something for everyone in today’s roundup, but it does include several product categories, from PC components, phones, and wearables to TVs and connected home tech. Best Buy has several TVs for less than their usual prices as… [+1815 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Angela Chen", "title": "A journalist explains the dangerous consequences of a world built for men", "description": "The Verge interviews journalist Caroline Criado Perez about her new book, Invisible Women: Data Bias in a World Designed for Men.", "url": "https://www.theverge.com/2019/3/5/18251570/caroline-criado-perez-invisible-women-data-bias-science-gender", "urlToImage": "https://cdn.vox-cdn.com/thumbor/HriPf7RyvuwRQSbzqzPYiuuey-s=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15558642/mdoying_190305_3261_0001.jpg", "publishedAt": "2019-03-05T17:39:16Z", "content": "In college, Caroline Criado Perez picked up a book on linguistic theory that pointed out that when women hear the word he the default pronoun that is often used to mean he or she they picture a man. It blew my mind because I realized that I do that, but I had… [+6965 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dami Lee", "title": "Bumble’s women-only networking feature isn’t a job discrimination tool", "description": "Bumble recently introduced “Women in Bizz,” a filter within its professional networking mode Bumble Bizz. The filter gives women the option to only match with other women, which raised questions of employment discrimination.", "url": "https://www.theverge.com/2019/3/5/18246735/bumble-bizz-women-only-filter", "urlToImage": "https://cdn.vox-cdn.com/thumbor/r7JFpqWDSOLNVWEbNVae61iWoms=/0x18:1107x598/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15317897/bizz.png", "publishedAt": "2019-03-05T17:39:06Z", "content": "Bumble recently added a filter to its professional networking mode, Bumble Bizz, to give women the option to only match with other women. The immediate response mainly from mens rights pages was, Isnt this illegal?\r\nPart of the outrage stems from the first ar… [+4089 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Russell Brandom", "title": "Deepfake propaganda is not a real problem", "description": "For the last year, journalists have been raising the alarm about the new machine-learning-powered system for doctoring video — but the predicted crisis hasn’t shown up.", "url": "https://www.theverge.com/2019/3/5/18251736/deepfake-propaganda-misinformation-troll-video-hoax", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ItzM7V24bGVqXxAARrDtxlc7YgQ=/0x36:775x442/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10193259/bezosmusk2.PNG", "publishedAt": "2019-03-05T17:25:53Z", "content": "If youve been following tech news in the past year, youve probably heard about deepfakes, the widely available, machine-learning-powered system for swapping faces and doctoring videos. First reported by Motherboard at the end of 2017, the technology seemed li… [+7056 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liptak", "title": "Famous Men Who Never Lived is a powerful novel about alternate worlds and the plights of refugees", "description": "In K. Chess’ debut novel Famous Men Who Never Lived, reality forked at some point in 1910, leaving two worlds: ours and an advanced alternate. When a disaster befalls the other world, 156,000 refugees make their way to our reality. One refugee, Hel, attempts …", "url": "https://www.theverge.com/2019/3/5/18248708/famous-men-who-never-lived-k-chess-alternate-worlds-science-fiction-book-review", "urlToImage": "https://cdn.vox-cdn.com/thumbor/mVjM7vb-frQwUGtCrvEBCXVaCDM=/0x288:2040x1356/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14832693/aliptak_190228_3261_8256.jpg", "publishedAt": "2019-03-05T17:15:26Z", "content": "In K. Chess debut novel, Famous Men Who Never Lived, at some point in the past, reality diverged, and an alternate timeline played out alongside our own. Then, that world was devastated by a nuclear attack, and extradimensional refugees started showing up in … [+4863 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "T-Mobile admits it spent $195,000 on Trump’s hotel while lobbying for Sprint merger", "description": "T-Mobile admits that after it began lobbying for a merger with Sprint, it started to book stays for its top executives at President Donald Trump’s Washington hotel. Over ten months, T-Mobile spent a total of $195,000 at the Trump hotel, it detailed in a lette…", "url": "https://www.theverge.com/2019/3/5/18251722/t-mobile-trump-hotel-washington-sprint-merger-lobbying", "urlToImage": "https://cdn.vox-cdn.com/thumbor/SHNTUdfOHznuEsN0Do8IowbYdus=/0x391:5457x3248/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15565221/862865926.jpg.jpg", "publishedAt": "2019-03-05T17:10:40Z", "content": "T-Mobile has admitted that after it began lobbying for a merger with Sprint, it started to book stays for top executives at President Donald Trumps Washington hotel. Over ten months, T-Mobile spent a total of $195,000 at the Trump hotel, it detailed in a lett… [+1830 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Zachary Mack", "title": "Can Anchor be the YouTube of podcasts?", "description": "Anchor CEO Michael Mignano discusses the company’s recent acquisition by Spotify, the future of podcasting, and whether Anchor could become the “YouTube for podcasts.”", "url": "https://www.theverge.com/2019/3/5/18251442/anchor-spotify-youtube-podcasts-future-vergecast-interview", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Ajxzgm2NbRaaI4fJYhzJTToKUg0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8674759/akrales_170612_1772_0004.jpg", "publishedAt": "2019-03-05T16:49:43Z", "content": "Anchor CEO Michael Mignano discusses the company’s recent acquisition by Spotify, the future of podcasting, and whether Anchor could become the “YouTube for podcasts.” The Verge’s Nilay Patel and Ashley Carman talk to Mignano about the current difficulties th… [+5388 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Game of Thrones’ final season trailer prepares us for the biggest fight yet", "description": "The first trailer for Game of Thrones’ season 8 is here, and it gives us a glimpse at some of the most important characters  who remain. Jon Snow, Daenerys Targaryen, Cersei Lannister, and Arya Stark are all back in action.", "url": "https://www.theverge.com/2019/3/5/18251699/game-of-thrones-season-8-trailer-arya-stark-jon-snow-daenerys-targaryen", "urlToImage": "https://cdn.vox-cdn.com/thumbor/RGGGUuR7sMQ6DhHhcScu-Ot3mwE=/0x22:1670x896/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15561431/Screen_Shot_2019_03_05_at_11.12.41_AM.png", "publishedAt": "2019-03-05T16:18:08Z", "content": "The first official trailer for the final season of Game of Thrones has landed, and it’s clear that everyone is gearing up for the fight of their lives. The main battle seems to be between Jon Snow, Daenerys Targaryen, and all of the North as they prepare for … [+802 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Laura Yan", "title": "The Strange Case of Eugene Gu", "description": "He went viral for taking a knee. He even sued Trump for blocking him (and won). But behind one of Twitter’s most outspoken figures is a history of abuse.", "url": "https://www.theverge.com/2019/3/5/18147216/eugene-gu-twitter-social-justice-activism-abuse-sexual-assault", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lTXWOtJ2DnZh0b221hqT4q7V6ww=/0x47:2400x1304/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15335803/VRG_3230_001_Social.jpg", "publishedAt": "2019-03-05T16:00:00Z", "content": "Behind one of Twitter’s most outspoken social-justice personalities is a history of abuse Warning: this piece contains descriptions of sexual assault “You always remember your very first viral tweet,” Eugene Gu tells me. For him, it was a joke about Betsy DeV… [+28913 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "HyperX PC gaming headsets, storage, and more are discounted today", "description": "For upgrades inside or outside of your computer, today’s Deal of the Day on Amazon has you covered with discounts on gaming headsets, keyboards, SSDs, laptop RAM, and Thunderbolt 3 external M.2 drives.", "url": "https://www.theverge.com/good-deals/2019/3/5/18251514/hyperx-pc-gaming-headset-storage-keyboards-ssd-deals-discounts", "urlToImage": "https://cdn.vox-cdn.com/thumbor/aNpKiHixxDzfg4yILJbGGhntoFE=/0x101:1800x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9989263/hyperx_cloud_flight_1.jpg", "publishedAt": "2019-03-05T15:52:14Z", "content": "Whether youre in need of some cheap parts for a new PC build or youre just looking to accessorize your current Windows 10 / macOS desktop or laptop, Amazons day-long deals on HyperX and Sabrent products will help you do either for less. Starting with tech tha… [+1786 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Audi’s new Q4 E-tron is a smaller electric SUV with great range", "description": "Audi unveiled the next vehicle in its all-electric lineup: the Q4 E-tron SUV. Smaller than the regular E-tron, the compact Q4 still packs a nice punch, with 280 miles of range, twin electric motors, and a total power output of 225 kW. But it won’t be hitting …", "url": "https://www.theverge.com/2019/3/5/18251528/audi-q4-etron-ev-concept-geneva-auto-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/HheulL2donYBUuriZnHy5ZjJomQ=/0x398:3508x2235/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15551155/A192563_medium.jpg", "publishedAt": "2019-03-05T15:48:38Z", "content": "Audi unveiled the next vehicle in its all-electric lineup: the Q4 E-tron SUV. Smaller than the regular E-tron, the compact Q4 still packs a nice punch, with 280 miles of range, twin electric motors, and a total power output of 225 kW. But it wont be hitting d… [+1965 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Ashley Carman", "title": "Spotify’s podcast ambitions involve exclusive shows, better discovery, and lots of ad money", "description": "Spotify purchased Gimlet Media and Anchor in a deal worth more than $300 million. The company is now speaking publicly about its big podcast plans.", "url": "https://www.theverge.com/2019/3/5/18243729/spotify-podcast-strategy-gimlet-media-anchor-purchase", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Ai4Es91CiNiqAyS8m8CjOXiojuY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15311462/acastro_100301_3266_spotify_podcasts_0001.jpg", "publishedAt": "2019-03-05T15:22:56Z", "content": "The podcast future is forming In the month since Spotify announced plans to spend up to $500 million on podcasting, it’s homed in on exclusive content plans, hinted at ongoing work to improve discovery, and broadly started to construct a picture of how it vie… [+9765 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "All of the cars, concepts, and wild ideas from the 2019 Geneva Motor Show", "description": "Every year, the Geneva Motor Show proves to be one of the flashiest, most outrageous car shows that take place around the world — and 2019 is no exception.", "url": "https://www.theverge.com/2019/3/5/18251543/geneva-motor-show-2019-best-cars-honda-audi-vw", "urlToImage": "https://cdn.vox-cdn.com/thumbor/upX03ppEnB6SB4_Eg_8bSsrEXes=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15540031/IMG_20190305_140343.jpg", "publishedAt": "2019-03-05T15:02:56Z", "content": "Every year, the Geneva Motor Show proves to be one of the flashiest, most outrageous car shows that take place around the world — and 2019 is no exception. Luxury names like Porsche, Jaguar, and Aston Martin have shown up to try to make news alongside superca… [+340 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Colin Lecher", "title": "The NSA may end its controversial phone data surveillance program", "description": "The National Security Agency may shut down a controversial program that vacuums up hundreds of millions of call and text message records.", "url": "https://www.theverge.com/2019/3/5/18251477/nsa-phone-records-call-texts-surveillance-program-ending", "urlToImage": "https://cdn.vox-cdn.com/thumbor/CCRnl8irQkbEnPK9bacXadI8eJ8=/0x79:1100x655/fit-in/1200x630/cdn.vox-cdn.com/assets/3999759/NSA-photo-by-Trevor-Paglen.jpg", "publishedAt": "2019-03-05T15:00:42Z", "content": "The National Security Agency may shut down a controversial program that vacuums up hundreds of millions of call and text message records. \r\nA senior Republican aide who appeared on a Lawfare blog podcast said the Trump administration had let the program stagn… [+1023 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Mary Beth Griggs", "title": "Lead contamination goes far beyond Flint, Michigan", "description": "Nearly five years after the city of Flint, Michigan, confronted a contaminated water supply, lead in water continues to be a problem around the country. For our latest Verge Science video, we looked into the different lead tests that are available to see how …", "url": "https://www.theverge.com/2019/3/5/18250801/lead-contamination-flint-michigan-water-testing", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Wq0hrbZaTEM8oraDLvxBrqK1lg4=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15533567/Thumb_Textless.jpg", "publishedAt": "2019-03-05T15:00:00Z", "content": "Nearly five years after the city of Flint, Michigan, confronted a contaminated water supply, lead in water continues to be a problem around the US. There are many different contaminants that can be found in water, from E. coli to materials like iron or mangan… [+2579 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "Aston Martin stretches the concept of an SUV with its latest Lagonda", "description": "Aston Martin has introduced its second Lagonda concept car. This time, it’s an all-terrain SUV with fully autonomous drive, all-electric powertrain, and lush decorations that include Swarovski crystals. Opulence and excess, yes, but this is also supposed to b…", "url": "https://www.theverge.com/2019/3/5/18251372/aston-martin-lagonda-suv-concept-car-photos-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/XhT_HH1itPb9wBoO8yA6OFhh8Vg=/0x220:2040x1288/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15540002/IMG_20190305_135850.jpg", "publishedAt": "2019-03-05T14:50:59Z", "content": "A year ago, Aston Martin wowed attendees of the Geneva Motor Show with the audacious impracticality of its Lagonda limousine concept. This year, the British marque is coming down to earth with an all-terrain SUV concept Lagonda that is... every bit as ridicul… [+1987 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "A never-ending stream of AI art goes up for auction", "description": "Sotheby’s in London will hold the second major auction of a piece of AI art designed, this time, by German artist Mario Klingemann. But one problem for artists working with artificial intelligence is dealing with the profusion of images that this technology c…", "url": "https://www.theverge.com/2019/3/5/18251267/ai-art-gans-mario-klingemann-auction-sothebys-technology", "urlToImage": "https://cdn.vox-cdn.com/thumbor/I2QQ0rMR4Rac962QTLFIVrU20lE=/0x53:1080x618/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15501319/51240570_710071382727908_2855720695556515218_n.jpg", "publishedAt": "2019-03-05T14:38:19Z", "content": "Training algorithms to generate art is, in some ways, the easy part. You feed them data, they look for patterns, and they do their best to replicate what theyve seen. But like all automatons, AI systems are tireless and produce a never-ending stream of images… [+7637 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Apple acquires patents from AI security camera maker Lighthouse", "description": "AI security camera company Lighthouse may have shut down, but its patents will live on: Apple reportedly bought the patent portfolio of the now-defunct company at the end of 2018.", "url": "https://www.theverge.com/circuitbreaker/2019/3/5/18251449/apple-patents-ai-security-camera-maker-lighthouse-face-id", "urlToImage": "https://cdn.vox-cdn.com/thumbor/n2X1Rqe0cMYe1Dz2F6Ir7kBi_eM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10271351/vpavic_180218_2318_0018.jpg", "publishedAt": "2019-03-05T14:21:52Z", "content": "AI security camera company Lighthouse may have shut down, but its patents will live on: Apple reportedly bought the patent portfolio of the now-defunct company at the end of 2018, according to IAM. As Patently Apple notes, the patents Apple acquired largely d… [+1643 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Huawei exec confirms that the P30 Pro will have a superzoom ‘periscope’ camera", "description": "One of the biggest new features for the P30 Pro has already been confirmed by Clement Wong, Huawei’s VP of global product marketing: the P30 Pro will feature a new, periscope-style “superzoom” camera that other leaks have promised will enable up to 10x zoom.", "url": "https://www.theverge.com/2019/3/5/18251406/huawei-exec-p30-pro-super-zoom-periscope-camera-10x", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9K9C-qcCL-8Rhb1HkVpiVaXP8rc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13720395/akrales_190125_3170_0033.jpg", "publishedAt": "2019-03-05T14:06:28Z", "content": "Leaks are already coming out for Huaweis next flagship smartphone, the P30 Pro, but one of the biggest new features has already been confirmed by Clement Wong, Huaweis VP of global product marketing: the P30 Pro will feature a new, periscope-style superzoom c… [+1416 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sam Byford", "title": "Oppo announces the F11 Pro with pop-up selfie camera and no notch", "description": "Oppo has announced the F11 Pro, a midrange phone for India with a 6.53-inch 1080p notch-less display and a pop-up selfie camera. It’s pretty similar in positioning to Vivo’s new V15 Pro, albeit with slightly lower-end specs.", "url": "https://www.theverge.com/circuitbreaker/2019/3/5/18251270/oppo-f11-pro-announced-india-specs-release", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Bv7ZwISMbhbQeHEpvo-KVGl3A8o=/0x231:2040x1299/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15473405/DSCF6913.jpg", "publishedAt": "2019-03-05T14:00:00Z", "content": "The onslaught of 48-megapixel cameraphones continues today with Oppos announcement of the F11 Pro, a midrange phone with a 6.53-inch 1080p notch-less display and a pop-up selfie camera. Its pretty similar in positioning to Vivos new V15 Pro, albeit with sligh… [+2386 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "August’s new smart doorbell is wireless and actually looks like a doorbell", "description": "The August View is a small rectangular box with a camera at the top and a big button at the bottom to ring the bell. It’s fairly obvious that the device is a doorbell, which is a big change from the first two generations of August doorbells.", "url": "https://www.theverge.com/circuitbreaker/2019/3/5/18249907/august-view-doorbell-wireless-camera-announced-price-specs", "urlToImage": "https://cdn.vox-cdn.com/thumbor/jSrefL9LL9jr8DaN37WbAs9Mlc8=/0x6:3300x1734/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15269636/August_View___White.png", "publishedAt": "2019-03-05T14:00:00Z", "content": "August is unveiling a new smart doorbell today, and its biggest feature may be that it actually resembles a doorbell.\r\nThe August View is a small rectangular box with a camera at the top and a big button at the bottom to ring the bell. Its fairly obvious that… [+3403 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "You can now control your Roku with an Amazon Echo", "description": "After announcing support for Google Assistant last fall, Roku is now doing the same for Amazon’s Alexa voice assistant. After installing the new Roku skill, you’ll be able to control the company’s streaming devices and Roku TVs with voice commands.", "url": "https://www.theverge.com/2019/3/5/18251333/roku-amazon-alexa-echo-now-available", "urlToImage": "https://cdn.vox-cdn.com/thumbor/zzl0mgUaR3_eILIVpDMS8KUu52o=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13255999/dseifert_181011_3006_1133_2.jpg", "publishedAt": "2019-03-05T14:00:00Z", "content": "After announcing support for Google Assistant last fall, Roku is today doing the same for Amazon's Alexa voice assistant. After installing the new Roku skill, you'll be able to control the company's streaming devices and Roku TVs with voice commands like Alex… [+1153 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Windows 10’s Mail app gets a full dark mode in latest update", "description": "Microsoft is adding a full dark mode to its Mail app for Windows 10. It allows Windows users to switch between white and black backgrounds for emails, and it matches Microsoft’s Outlook.com web email service.", "url": "https://www.theverge.com/2019/3/5/18251387/microsoft-windows-10-mail-dark-mode-feature", "urlToImage": "https://cdn.vox-cdn.com/thumbor/l-AKD4uXuRUTOCgZ4dqk37yzjvs=/0x147:2040x1215/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/3919716/mswindows2_2040.0.jpg", "publishedAt": "2019-03-05T13:31:12Z", "content": "Microsoft is introducing a more complete dark mode for its Mail app in Windows 10 today. The software maker has started rolling out a new update that includes a dark mode for the email portion of the app. Previously, the app would show a white background in e… [+599 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Forty percent of ‘AI startups’ in Europe don’t actually use AI, claims report", "description": "A lot of companies want to cash in on the AI hype. A new study from London VC firm MMC claims that 40 percent of the European “AI startups” it surveyed don’t actually use artificial intelligence in a way that was material to their businesses.", "url": "https://www.theverge.com/2019/3/5/18251326/ai-startups-europe-fake-40-percent-mmc-report", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2_fYPSyvvHSDJ0NIvrahsyHWiO8=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13292779/acastro_181017_1777_brain_ai_0002.jpg", "publishedAt": "2019-03-05T13:14:59Z", "content": "Artificial intelligence is one of the most misused terms in tech today, and a new study apparently confirms how hyped the technology has become. \r\nAccording to the survey from London venture capital firm MMC, only 40 percent of European startups that are clas… [+2269 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Tesla competitors made a big splash at last year’s Geneva Motor Show — so where are they now?", "description": "The Geneva Motor Show will once again feature lots of EVs, but getting them on the road is another story", "url": "https://www.theverge.com/2019/3/5/18249868/geneva-motor-show-2019-electric-vehicles-tesla-audi-porsche-jaguar-competitors", "urlToImage": "https://cdn.vox-cdn.com/thumbor/iJhKqohsO0NCuqc9gKlSz8Ol6T0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10353517/20180306_porsche_missione_vladsavov20.jpg", "publishedAt": "2019-03-05T13:00:00Z", "content": "At last years Geneva Motor Show, one message was clear: the worlds biggest automakers are going electric. Marquee names like Porsche, Audi, BMW, Jaguar, and Hyundai showed up with or teased all-electric cars, while others arrived with hybrids. It was one of t… [+11335 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Apple supplier Corning is working on flexible glass for foldable displays", "description": "Corning is working on a bendable version of the glass that could be with us in as little as two years. Corning’s general manager said that the challenge was creating a glass that won’t sacrificing the resilience needed to protect a display.", "url": "https://www.theverge.com/2019/3/5/18251328/apple-corning-foldable-display-gorilla-glass-bendable-smartphone", "urlToImage": "https://cdn.vox-cdn.com/thumbor/cLsyyeTmVRRiEV8sFWBqQ4fzIv0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14420459/huawei_matex_mwc19_vsavov20.jpg", "publishedAt": "2019-03-05T12:54:29Z", "content": "Corning, the glass manufacturer that currently provides Apple with Gorilla Glass for its iPhones, is working on a bendable version of the glass that could be with us in less than two years. In an interview with Wired (via MacRumors ), Corning general manager … [+2146 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Casey Newton", "title": "How to predict Facebook’s future", "description": "Eugene Wei’s description of Facebook as a “status as a service” business helps us understand what might come next", "url": "https://www.theverge.com/interface/2019/3/5/18250867/eugene-wei-status-service-facebook-future", "urlToImage": "https://cdn.vox-cdn.com/thumbor/axZKts-O0lGj3Pu9HVrM9c5mHIc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11559999/akrales_180614_1777_0110.jpg", "publishedAt": "2019-03-05T11:00:00Z", "content": "Criticism of Facebook comes from all quarters, and at this point its rare to discover an opinion about the company that has never previously been voiced. My favorite takes these days tend to come from people who once worked at the company recent experiences o… [+22720 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Vlad Savov", "title": "The Honda e Prototype is here to steal European hearts", "description": "The Honda e Prototype, making its global debut at the Geneva Motor Show 2019, previews a production electric vehicle designed for the city. It’ll have a range of 200km and a price close to that of the cheapest Tesla Model 3.", "url": "https://www.theverge.com/2019/3/5/18251251/honda-e-prototype-price-release-date-photos-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vJ6qzjcfW3v212X5N8LfAK0_LqY=/0x179:2040x1247/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15487177/geneva_honda_eprototype_vladsavov33.jpg", "publishedAt": "2019-03-05T10:56:34Z", "content": "On sale by the end of the year, priced in the vicinity of Tesla’s Model 3 It’s the nature of the Geneva Motor Show that to get to the fun new EV designs, you have to walk past an exhibition of ridiculous vehicular opulence, but nothing was going to slow me do… [+3781 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Apple quietly addresses ‘Flexgate’ issue with MacBook Pro redesign", "description": "Last year’s MacBook Pro may have solved the “Flexgate” issue users reported with MacBook Pros produced from 2016. The 2018 MacBook Pro uses a display cable that’s 2mm longer than its predecessor, putting it under less strain.", "url": "https://www.theverge.com/2019/3/5/18251264/macbook-pro-2018-flexgate-fix-display-cable-2mm-longer", "urlToImage": "https://cdn.vox-cdn.com/thumbor/68ZGRXpehj7gCxThbKnPQ6EJpNY=/0x30:800x449/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15480504/macbook_pro_flexgate_800x449.jpg", "publishedAt": "2019-03-05T10:16:19Z", "content": "Last years MacBook Pro may have solved the Flexgate issue that some users reported with MacBook Pros produced from 2016 onwards, reports iFixit. The 2018 MacBook Pro uses a display cable thats 2mm longer than its predecessor, meaning its under less strain as … [+1353 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Aston Martin’s new hypercar makes you use your smartphone as the display", "description": "The AM-RB 003 hypercar will be powered by a new Aston Martin-built hybrid turbo V6 engine, and only 500 will be made. They start shipping in 2021.", "url": "https://www.theverge.com/2019/3/5/18250642/aston-martin-003-hypecar-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/NYd9JQXCwIKt95TB_ktMGqrIt-M=/0x7:2040x1075/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15335618/Project_003_10.jpg", "publishedAt": "2019-03-05T10:15:00Z", "content": "Supercars and hypercars are all about speed, and one of the tried and true ways to generate speed is to cut out as much weight as possible. This is a huge focus of Aston Martin’s new AM-RB 003 hypercar — so much so that the company isn’t even including a dash… [+2322 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "The Lagonda All-Terrain concept is Aston Martin’s far out vision for electric SUVs", "description": "The first SUV from Aston Martin’s new luxury EV brand is coming in 2022. Aston Martin hasn’t released any specs, but the inside is inspired by a “super yacht” and has wild touches like a floating key.", "url": "https://www.theverge.com/2019/3/5/18250575/lagonda-all-terrain-concept-suv-aston-martin-geneva-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vOtqdzgzcae-VrJjq-yyjg-NMu0=/0x40:2040x1108/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15326018/Lagonda_All_Terrain_Concept_04.jpg", "publishedAt": "2019-03-05T10:15:00Z", "content": "In case you missed it at last year’s Geneva Motor Show, Aston Martin resurrected luxury sub-brand Lagonda and announced it would become the automaker’s showcase for EVs going forward. It launched that vision with an opulent — and carpeted ! — autonomous conce… [+2460 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tom Warren", "title": "Microsoft’s new Edge browser looks a lot like Chrome in leaked screenshots", "description": "Leaked screenshots show an early version of Microsoft’s Chromium-powered version of Edge. It looks a lot like Google’s Chrome browser right now, and it appears Microsoft will be including sync features just like Chrome", "url": "https://www.theverge.com/2019/3/5/18251263/microsoft-edge-chromium-screenshots-leak-browser", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vCMsNERYJI81L9t2rdMsnez4Euc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10793349/acastro_180507_1777_microsoft_0002.jpg", "publishedAt": "2019-03-05T09:24:23Z", "content": "Microsoft revealed late last year that its planning to rebuild its Edge browser on Chromium. The software giant has been testing daily development builds of the updated browser, and now leaked screenshots have revealed Microsofts progress. While Microsofts cu… [+992 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean O'Kane", "title": "Mercedes-Benz’s EQV electric van has 200 horsepower and 249 miles of range", "description": "It’s just a concept for now, but it matches up well against the specs of the EQC, which is Mercedes-Benz’s first serious electric SUV. The van even comes with MBUX.", "url": "https://www.theverge.com/2019/3/5/18251084/mercedes-benz-eqv-electric-van-geneva-motor-show-2019", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lemHxVL2RIHB3GngV3iIABn37As=/0x231:2040x1299/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15408674/19C0167_001.jpg", "publishedAt": "2019-03-05T08:30:00Z", "content": "Mercedes-Benz is one of the worlds leading manufacturers of commercial vans, especially at the high end, and the company is looking to protect that status in the future with an electric concept van announced Tuesday at the Geneva Motor Show. \r\nThe EQV concept… [+1440 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "EA says it’s ‘aware’ that Anthem is crashing some PS4 consoles", "description": "I can’t remember the last time I heard of a video game bug so bad that people’s consoles just quit in disgust, but some PlayStation 4 owners are reporting that BioWare’s shared-world shooter Anthem is completely crashing their consoles. While neither Sony nor…", "url": "https://www.theverge.com/2019/3/4/18250837/ps4-anthem-crash-ea-bioware-sony", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2EWCzwvD2PALiyacRHiSeQUq7t4=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11575615/EAP18_Screenshots_sc01_sh005_FINAL.png", "publishedAt": "2019-03-05T01:18:56Z", "content": "I cant remember the last time I heard of a video game bug so bad that peoples consoles just quit in disgust but some PlayStation 4 owners are reporting that BioWares shared-world shooter Anthem is completely crashing their consoles. Or worse.\r\nWhile neither S… [+2336 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dani Deahl", "title": "Spotify just made a tiny dent in India’s fast-growing market", "description": "Spotify now has 1 million users in India counting both free and paid Premium accounts, a representative for the company confirmed to The Verge. The streaming platform quietly launched in India six days ago amid a legal skirmish over whether the it would inclu…", "url": "https://www.theverge.com/2019/3/4/18250563/spotify-india-one-million-subscribers-tiny-dent-music-market", "urlToImage": "https://cdn.vox-cdn.com/thumbor/uAroFbJZv5x6iusWMM8fL-1Kb2Y=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10411089/akrales_180305_1437_0021.jpg", "publishedAt": "2019-03-05T01:12:09Z", "content": "Spotify now has 1 million users in India counting both free and paid Premium accounts, a representative for the company confirmed to The Verge. The streaming platform quietly arrived in India six days ago amid a legal skirmish over whether the launch would in… [+3697 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "A comedian’s fight with Barstool Sports shows how Twitter’s copyright system can hurt creators", "description": "Los Angeles-based writer and comedian Miel Bredouw claims Barstool Sports offered her thousands of dollars to retract a copyright claim after stealing one of her videos back in December. The situation exposes serious flaws in how Twitter handles copyright cla…", "url": "https://www.theverge.com/2019/3/4/18250731/barstool-sports-miel-bredouw-twitter-dmca-copyright-strike-video", "urlToImage": "https://cdn.vox-cdn.com/thumbor/6HygePQ2EjTyOlCCpY0a75yvvco=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12742431/acastro_180827_1777_0004.jpg", "publishedAt": "2019-03-05T00:55:56Z", "content": "Earlier today, Los Angeles-based writer and comedian Miel Bredouw claims she received a peculiar message from the general counsel of Barstool Sports, a sports and lifestyle website that caters to young men and is widely known for its aggressive and sometimes … [+6613 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Mary Beth Griggs", "title": "When it comes to conspiracy theories, intuition and stress conspire against you", "description": "Dealing with conspiracy theories is common for Facebook moderators, and that putrid flood of information can be traumatic, as The Verge’s Casey Newton found when he reported on the working conditions endured by moderators in Phoenix, Arizona. Some of the work…", "url": "https://www.theverge.com/2019/3/4/18250292/facebook-moderation-conspiracy-theory-mike-wood-psychology-interview", "urlToImage": "https://cdn.vox-cdn.com/thumbor/AQobikR8RxxlVJDllyQbz_XXg6U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10572757/wjoel_180319_2394_facebook_006.0.jpg", "publishedAt": "2019-03-05T00:25:38Z", "content": "Conspiracy theories are dusted amid the violent videos, racist comments, and death threats that Facebook moderators face every day. That putrid flood of information can be traumatic, as The Verge ’s Casey Newton found when he reported on the working condition… [+9037 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "Google tries to address complaints of sluggish Pixel 3 with latest update", "description": "Google’s March security update for Pixel phones also includes some much-needed functional improvements for the Pixel 3 and 3 XL, including faster startup speeds for the camera app.", "url": "https://www.theverge.com/2019/3/4/18250583/google-pixel-3-march-update-camera-storage-fixes", "urlToImage": "https://cdn.vox-cdn.com/thumbor/kGzjC-VaKQpfmsvc_3wz-fjpYYM=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13278387/jbareham_181010_2989_0217.jpg", "publishedAt": "2019-03-04T22:28:11Z", "content": "Google’s March security update for Pixel phones also includes some much-needed functional improvements for the Pixel 3 and 3 XL, as noted by Android Police. The company seems to have heard complaints from users about its latest phones becoming sluggish over t… [+2201 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Over 300 million Chinese private messages were left exposed online", "description": "Over 300 million private messages from Chinese users on popular messaging apps with their personal photos and citizen ID numbers attached were sitting exposed on the internet, according to a security researcher. The database of 364 million records left users’…", "url": "https://www.theverge.com/2019/3/4/18250474/chinese-messages-millions-wechat-qq-yy-data-breach-police", "urlToImage": "https://cdn.vox-cdn.com/thumbor/GMgbMtVZJyf4Ml0t0WweTL7akjY=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13599216/sliao181007_3031_3186.jpg", "publishedAt": "2019-03-04T22:07:20Z", "content": "Over 300 million private messages from Chinese users on popular messaging apps were sitting exposed on the internet, according to security researcher Victor Gevers, who works for the nonprofit organization GDI. The database of 364 million records left users’ … [+3569 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Google disables Android TV photo sharing for all users after account privacy issue", "description": "Google has shut down Google Photos sharing to Android TV devices today after a bug was discovered that revealed hundreds of user accounts to other users. Until the bug is resolved, Android TV owners won’t be able to set Google Photo albums as their screensave…", "url": "https://www.theverge.com/2019/3/4/18250552/google-disables-android-tv-photo-sharing-account-privacy-issue", "urlToImage": "https://cdn.vox-cdn.com/thumbor/v7nHw4wvEZVyrQWPZBB-be0Hkfo=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12066297/VHO_216_androidTV_STILL.0.0.jpg", "publishedAt": "2019-03-04T21:48:33Z", "content": "Google has shut down Google Photos sharing to Android TV devices today after a bug was discovered that revealed hundreds of user accounts to other users. Until the bug is resolved, Android TV owners wont be able to set Google Photo albums as their screensaver… [+1467 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Lego takes on Samsung and Huawei with its own foldable", "description": "Foldable phones dominated tech headlines, starting with the announcement of Samsung’s Galaxy Fold. Riding this wave of the foldables, Lego is now poking fun at the upcoming Galaxy smartphone with a tweet showcasing the “Lego Fold,” a seemingly functional, fol…", "url": "https://www.theverge.com/tldr/2019/3/4/18250449/lego-fold-storybook-samsung-galaxy-parody", "urlToImage": "https://cdn.vox-cdn.com/thumbor/3MtM4Le04JkZiu2dt9Lr9RElzKo=/0x86:1200x714/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15303500/Untitled.png", "publishedAt": "2019-03-04T21:09:11Z", "content": "Foldable phones dominated tech headlines over the past few weeks, starting with the announcement of Samsung’s Galaxy Fold just 11 short days ago. Riding this wave of the foldables, Lego is now poking fun at the upcoming Galaxy smartphone with a tweet showcasi… [+1438 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Barbara Krasnoff", "title": "How to use Android Pie’s search bar to control your phone’s settings", "description": "If you’ve got a Pixel with Pie, you can toggle apps on and off from your search drop-down", "url": "https://www.theverge.com/2019/3/4/18250422/how-to-use-android-pie-slices-search-bar-phone-settings", "urlToImage": "https://cdn.vox-cdn.com/thumbor/KKiMMBP00NXjQMEh08ExBUvQqtE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11983879/akrales_180813_2827_0034.jpg", "publishedAt": "2019-03-04T20:59:35Z", "content": "When Android 9 Pie was introduced last year, it brought with it a new feature called Slices, which would allow features from third-party apps to exist within the Android interface. While youve been able to ask Google Assistant to toggle some things on and off… [+1181 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "AT&T just made its first huge changes to HBO and the rest of WarnerMedia", "description": "Fresh off of a court victory that sealed its acquisition of Time Warner once and for all, AT&T has announced major, wide-reaching changes to the structure of that company, now known as WarnerMedia.", "url": "https://www.theverge.com/2019/3/4/18250075/att-restructures-warnermedia-hbo-turner-streaming", "urlToImage": "https://cdn.vox-cdn.com/thumbor/W3BzMw8bfbV5MyEN96o1YXBcPfY=/0x131:2040x1199/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10690893/acastro_180322_1777_0001.jpg", "publishedAt": "2019-03-04T20:35:53Z", "content": "This morning, fresh off of a court victory that sealed its acquisition of Time Warner Inc. once and for all, AT&amp;T announced wide-reaching changes to the structure of that company, now known as WarnerMedia. Robert Greenblatt, a former chairman at NBC Enter… [+7454 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Colin Lecher", "title": "Huawei’s CFO is suing Canada as she fights extradition to the US", "description": "Huawei’s chief financial officer filed a lawsuit against the Canadian government as she fights extradition to the United States.", "url": "https://www.theverge.com/2019/3/4/18250321/huawei-cfo-extradition-canada-lawsuit-charges-wanzhou", "urlToImage": "https://cdn.vox-cdn.com/thumbor/4NC1XGi0Alxr7AM79W1qK2E4DhA=/0x141:2040x1209/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10538829/VRG_ILLO_1777_Huawei_004.jpg", "publishedAt": "2019-03-04T19:49:19Z", "content": "Huaweis chief financial officer filed a lawsuit against the Canadian government Friday as she fights extradition to the United States. \r\nMeng Wanzhous attorneys said in a complaint, filed in the Supreme Court of British Columbia, that Canadian police and bord… [+1400 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chris Welch", "title": "Purported OnePlus 7 images reveal a pop-up camera and no notch", "description": "The OnePlus 7 might not have a notch cutting into the display, based on a photo and renders of the upcoming phone. Instead, it’s rumored to feature a pop-up camera.", "url": "https://www.theverge.com/2019/3/4/18250308/oneplus-7-photo-specs-leak-pop-up-camera-notch-rumor", "urlToImage": "https://cdn.vox-cdn.com/thumbor/bftRU9EROwqdfCz22Q-EP3aXhsE=/0x115:1200x743/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15291060/oneplus.jpg", "publishedAt": "2019-03-04T19:48:38Z", "content": "OnePlus might already be moving away from the teardrop notch on the OnePlus 6T for the companys next flagship phone. A photo posted to Weibo (and republished by Slashleaks) shows a screen with a slim bezel running around it and no notch to be seen. Theres wha… [+1654 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Shannon Liao", "title": "Google employees aren’t convinced that Dragonfly is dead", "description": "Google’s CEO Sundar Pichai told US regulators last year that Google had “no plans” to launch a censored search engine in China “right now.” But Google employees, unsatisfied and suspicious, monitored company code to see if the plans were still ongoing, accord…", "url": "https://www.theverge.com/2019/3/4/18250285/google-dragonfly-censored-search-engine-code-dead-employees-doubt", "urlToImage": "https://cdn.vox-cdn.com/thumbor/7KHaqAbSRQUh0NVfbq7eprJv8ys=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12322335/acastro_180820_1777_google_china_0002.jpg", "publishedAt": "2019-03-04T19:30:55Z", "content": "Some Google employees believe they found evidence that Googles plans to launch a censored search engine codenamed Dragonfly in China are still ongoing, according to a new report from The Intercept. Googles CEO Sundar Pichai told US regulators last year that G… [+1923 chars]"}]}