{"status": "ok", "totalResults": 142, "articles": [{"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Cleaner and Safer Rocket Fuel using metal-organic Frameworks", "description": "McGill Researchers have made rocket fuel that is much cleaner and safer than the hypergolic fuels that are commonly used today. And still just as effective. The new fuels use simple chemical... [[ This is a content summary only. Visit my website for full link…", "url": "https://www.nextbigfuture.com/2019/04/cleaner-and-safer-rocket-fuel-using-metal-organic-frameworks.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-06-at-3.03.25-PM.jpg", "publishedAt": "2019-04-05T21:49:03Z", "content": "McGill Researchers have made rocket fuel that is much cleaner and safer than the hypergolic fuels that are commonly used today. And still just as effective. The new fuels use simple chemical triggers to unlock the energy of one of the hottest new materials, a… [+2829 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": null, "description": "University of Central Florida researchers Abouraddy and study co-author Esat Kondakci... [[ This is a content summary only. Visit my website for full links, other content, and more! ]]", "url": "https://www.nextbigfuture.com/2019/04/155682.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/superlight.jpg", "publishedAt": "2019-04-05T20:52:39Z", "content": "&lt;a href=”https://today.ucf.edu/ucf-researchers-develop-way-control-speed-light-send-backward/”&gt;University of Central Florida researchers Abouraddy and study co-author Esat Kondakci demonstrated&lt;/a&gt; they could speed a pulse of light up to 30 times … [+3808 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceX Starhopper Performs a Tethered Hop With a Raptor Engine Firing", "description": "The SpaceX Starhopper has performed a tethered hop with a Raptor engine firing. Starhopper completed tethered hop. All systems green. https://t.co/0m5Bm5slD2 — Elon Musk (@elonmusk) April 4,... [[ This is a content summary only. Visit my website for full link…", "url": "https://www.nextbigfuture.com/2019/04/spacex-starhopper-performs-a-tethered-hop-with-a-raptor-engine-firing.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/tetheredfiring.jpg", "publishedAt": "2019-04-05T00:11:31Z", "content": "The SpaceX Starhopper has performed a tethered hop with a Raptor engine firing.\r\nStarhopper completed tethered hop. All systems green. https://t.co/0m5Bm5slD2\r\n— Elon Musk (@elonmusk) April 4, 2019\r\nHOT FIRE!!! Raptor comes to life at the base of Starhopper a… [+302 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "How Heatmapping Can Help Optimize On-Site User Experiences", "description": "Heatmaps show website owners what users want on their website, what areas they visit, their mouse movements and actions, as well as their overall engagement on every page. This is done through... [[ This is a content summary only. Visit my website for full li…", "url": "https://www.nextbigfuture.com/2019/04/how-heatmapping-can-help-optimize-on-site-user-experiences.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/Screen-Shot-2019-04-05-at-1.50.11-AM.jpg", "publishedAt": "2019-04-04T23:51:35Z", "content": "Heatmaps show website owners what users want on their website, what areas they visit, their mouse movements and actions, as well as their overall engagement on every page. This is done through visually representing their clicks, taps and scrolling behavior wi… [+2216 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Tesla Delivered 63000 Vehicles in Q1", "description": "Tesla deliveries were approximately 63,000 vehicles, which was 110% more than the same quarter last year, but 31% less than last quarter. This included approximately 50,900 Model 3 and 12,100 Model S... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/04/tesla-delivered-63000-vehicles-in-q1.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-31-at-7.38.54-PM.jpg", "publishedAt": "2019-04-04T04:23:30Z", "content": "Tesla deliveries were approximately 63,000 vehicles, which was 110% more than the same quarter last year, but 31% less than last quarter. This included approximately 50,900 Model 3 and 12,100 Model S and X.\r\nIn the first quarter, they produced approximately 7… [+920 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Intel Invested $117 Million into AI Startups Including Untether AI", "description": "Intel Capital announced new investments totaling $117 million in 14 disruptive technology startups. The startups are creating powerful artificial intelligence (AI) platforms; new ways to see and... [[ This is a content summary only. Visit my website for full …", "url": "https://www.nextbigfuture.com/2019/04/intel-invested-117-million-into-ai-startups-including-untether-ai.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/Screen-Shot-2019-04-04-at-12.27.26-AM.jpg", "publishedAt": "2019-04-03T22:31:05Z", "content": "Intel Capital announced new investments totaling $117 million in 14 disruptive technology startups. The startups are creating powerful artificial intelligence (AI) platforms; new ways to see and analyze materials for the built world and our bodies; more effic… [+6707 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Tesla Shanghai Gigafactory Will Install Production Equipment in May 2019", "description": "Laoyaoba reports that Tesla production equipment will be installed in the Shanghai Gigafactory in May 2019. Some Tesla Shanghai Gigafactory production lines will be start mass-production by the end... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/04/tesla-shanghai-gigafactory-will-install-production-equipment-in-may-2019.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/teslachinameeting.jpg", "publishedAt": "2019-04-03T22:00:40Z", "content": "Laoyaoba reports that Tesla production equipment will be installed in the Shanghai Gigafactory in May 2019. Some Tesla Shanghai Gigafactory production lines will be start mass-production by the end of 2019. This is reported from statements made at a Tuesday m… [+849 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Will New Nuclear Reactors Displace Coal?", "description": "There was a highly optimistic article at Global Asia about China installing an added 238 GW of new nuclear power by 2030. However, the author seems to finding that China has 43 nuclear reactors under... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/04/will-new-nuclear-reactors-displace-coal.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/HTRPM2019.jpg", "publishedAt": "2019-04-03T11:21:38Z", "content": "There was a highly optimistic article at Global Asia about China installing an added 238 GW of new nuclear power by 2030. However, the author seems to finding that China has 43 nuclear reactors under construction today. China only as 13 nuclear reactors under… [+1501 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "China Barely Slowed Coal Power Construction", "description": "Various satellite images show that half of the coal plants with “suspended construction” have actually been completed. China has restarted construction on more than 50 gigawatts (GW) of... [[ This is a content summary only. Visit my website for full links, ot…", "url": "https://www.nextbigfuture.com/2019/04/china-barely-slowed-coal-power-construction.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/Screen-Shot-2019-04-03-at-12.02.13-PM.jpg", "publishedAt": "2019-04-03T10:21:55Z", "content": "Various satellite images show that half of the coal plants with “suspended construction” have actually been completed.China has restarted construction on more than 50 gigawatts (GW) of suspended coal-fired power plants. A study by Global Energy Monitor, Green… [+1243 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "NASA Says Falcon Heavy+Orion Best Option For Humans on the Moon by 2024", "description": "NASA concluded that a mission profile in which Falcon Heavy places Orion, a service module, and an ICPS upper stage in orbit in a single launch may be the only option for a near-term commercial... [[ This is a content summary only. Visit my website for full l…", "url": "https://www.nextbigfuture.com/2019/04/nasa-says-falcon-heavyorion-best-option-for-humans-on-the-moon-by-2024.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/Screen-Shot-2019-04-03-at-2.01.26-AM.jpg", "publishedAt": "2019-04-03T00:05:43Z", "content": "NASA concluded that a mission profile in which Falcon Heavy places Orion, a service module, and an ICPS upper stage in orbit in a single launch may be the only option for a near-term commercial alternative for Orions first operational test flight. \r\nAbove is … [+1434 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "ELEV8 Conference in LA on 3-4 April Explores Future of Blockchain Technology", "description": "On April 3 and 4, blockchain and cryptocurrency professionals will converge in LA for the premier ELEV8 conference. It will take place at Hudson Loft, 1200 S Hope Street, Los Angeles, CA. The event... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/04/elev8-conference-in-la-on-3-4-april-explores-future-of-blockchain-technology.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/Screen-Shot-2019-04-03-at-1.47.06-AM.jpg", "publishedAt": "2019-04-02T23:48:24Z", "content": "On April 3 and 4, blockchain and cryptocurrency professionals will converge in LA for the premier ELEV8 conference. It will take place at Hudson Loft, 1200 S Hope Street, Los Angeles, CA. \r\nThe event will explore the blockchain, cryptocurrencies, digital asse… [+764 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Shotgun Armed Drones", "description": "Russian defense manufacturer JSC Almaz Antey has patented a drone armed with a shotgun. Over 6 years ago, there is a video of a drone armed with a recoiless AA-12 automatic shotgun. SOURCES- Foxtrot... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2019/04/shotgun-armed-drones.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/Screen-Shot-2019-04-03-at-12.54.46-AM.jpg", "publishedAt": "2019-04-02T23:11:35Z", "content": "Russian defense manufacturer JSC Almaz Antey has patented a drone armed with a shotgun.\r\nOver 6 years ago, there is a video of a drone armed with a recoiless AA-12 automatic shotgun.\r\nSOURCES- Foxtrot Alpha, Youtube"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Carnival of Space 605", "description": "The Carnival of Space 605 is up at Cosmoquest. Universe Today – LIGO Just Got a Big Upgrade, Will Begin Searching for Gravitational Waves Again on April 1st. About a year ago, LIGO’s two... [[ This is a content summary only. Visit my website for full links, o…", "url": "https://www.nextbigfuture.com/2019/04/carnival-of-space-605.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/GW_Global_Detector_Map.jpg", "publishedAt": "2019-04-02T22:47:01Z", "content": null}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "DARPA Wants to Include Scalable Defense Mechanisms into Chip Designs", "description": "Cybersecurity threats have moved from high in the software stack to towards the underlying hardware. The rise of the Internet of Things (IoT) has driven the creation of a rapidly growing number of... [[ This is a content summary only. Visit my website for ful…", "url": "https://www.nextbigfuture.com/2019/04/darpa-wants-to-include-scalable-defense-mechanisms-into-chip-designs.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/Aisschipsecurity.jpg", "publishedAt": "2019-04-02T09:30:38Z", "content": "Cybersecurity threats have moved from high in the software stack to towards the underlying hardware. \r\nThe rise of the Internet of Things (IoT) has driven the creation of a rapidly growing number of accessible devices and a multitude of complex chip designs n… [+3202 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Swarms of 250 Drones Will Support US Troops in Urban Combat", "description": "DARPA’s OFFensive Swarm-Enabled Tactics (OFFSET) program wants swarms of 250 collaborative autonomous systems providing critical capabilities to ground units in urban areas where challenges... [[ This is a content summary only. Visit my website for full links…", "url": "https://www.nextbigfuture.com/2019/04/swarms-of-250-drones-will-support-us-troops-in-urban-combat.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/offsetswarm.jpg", "publishedAt": "2019-04-02T09:20:46Z", "content": "DARPA’s OFFensive Swarm-Enabled Tactics (OFFSET) program wants swarms of 250 collaborative autonomous systems providing critical capabilities to ground units in urban areas where challenges such as tall buildings, tight spaces, and limited sight lines constra… [+2236 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Dozens of Modified SpaceX Starlink Satellites Could Be Sent Around Space", "description": "Elon Musk has tweeted about sending dozens of modified Starlink satellites sent throughout the solar system. They would have ion drives with 1600 ISP. The mission would be sent from an expendable... [[ This is a content summary only. Visit my website for full…", "url": "https://www.nextbigfuture.com/2019/04/dozens-of-modified-spacex-starlink-satellites-could-be-sent-around-space.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/spacexjupiter.jpg", "publishedAt": "2019-04-01T23:53:26Z", "content": "Elon Musk has tweeted about sending dozens of modified Starlink satellites sent throughout the solar system. They would have ion drives with 1600 ISP. The mission would be sent from an expendable version of the Super Heavy Starship. The Starship would have an… [+1938 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Tencent Keen Security Lab Tricks Tesla Autopilot into Oncoming Traffic", "description": "Tesla Autopilot recognizes lanes and assists control by identifying road traffic markings. Tencent Keen Labs proved that by placing interference stickers on the road, the Autopilot system will... [[ This is a content summary only. Visit my website for full li…", "url": "https://www.nextbigfuture.com/2019/04/tencent-keen-security-lab-tricks-tesla-autopilot-into-oncoming-traffic.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/teslacartricked.jpg", "publishedAt": "2019-04-01T23:31:30Z", "content": "Tesla Autopilot recognizes lanes and assists control by identifying road traffic markings. Tencent Keen Labs proved that by placing interference stickers on the road, the Autopilot system will capture this information and make an abnormal judgment, which caus… [+859 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Tesla Likely Delivered 80,000 Cars in the First Quarter", "description": "Bloomberg’s Tesla Tracker is showing nearly 80,000 Tesla’s delivered for the first quarter. If this is accurate that would be a huge quarter for Tesla and Elon Musk. In January, Musk... [[ This is a content summary only. Visit my website for full links, other…", "url": "https://www.nextbigfuture.com/2019/04/tesla-likely-delivered-80000-cars-in-the-first-quarter.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/Screen-Shot-2019-04-01-at-11.29.39-PM.jpg", "publishedAt": "2019-04-01T21:35:11Z", "content": "Bloomberg’s Tesla Tracker is showing nearly 80,000 Tesla’s delivered for the first quarter. If this is accurate that would be a huge quarter for Tesla and Elon Musk. In January, Musk warned that about 10,000 cars could be stuck in transit at the end of the qu… [+545 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Air Force Bases Need $4.9 Billion for Hurricane Repairs", "description": "The US Air Force requires $1.2 billion in FY2019 and $3.7 billion in FY2020/FY2021 of supplemental funding to rebuild Tyndall Air Force Base and recover Offutt Tyndall Air Force Base. Without... [[ This is a content summary only. Visit my website for full lin…", "url": "https://www.nextbigfuture.com/2019/04/155574.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/04/f-15flipped.jpg", "publishedAt": "2019-04-01T09:41:00Z", "content": "The US Air Force requires $1.2 billion in FY2019 and $3.7 billion in FY2020/FY2021 of supplemental funding to rebuild Tyndall Air Force Base and recover Offutt Tyndall Air Force Base. \r\nWithout supplemental funding, the US Air Force would have to cut critical… [+1613 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "More Delays for Next Generation US Aircraft Carrier", "description": "The new Gerald Ford Aircraft carrier has been delayed to repair Ford’s nuclear propulsion system, Advanced Weapons Elevators and software. The carrier will be capable of carrying up to 90 aircraft,... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/more-delays-for-next-generation-us-aircraft-carrier.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/01/twoford.jpg", "publishedAt": "2019-03-31T22:15:17Z", "content": "The new Gerald Ford Aircraft carrier has been delayed to repair Fords nuclear propulsion system, Advanced Weapons Elevators and software.\r\nThe carrier will be capable of carrying up to 90 aircraft, including the F-35 stealth fighter, F18 super hornet fighters… [+444 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Bill Gates Praises New Advanced Nuclear Energy Legislation", "description": "The US Congress has authorized a new bill that supports the development of advanced nuclear power. Billionaire Bill Gates says “I cannot overstate how important this is”. The bill... [[ This is a content summary only. Visit my website for full links, other co…", "url": "https://www.nextbigfuture.com/2019/03/155564.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/billgatesnuclear.jpg", "publishedAt": "2019-03-31T21:57:41Z", "content": "The US Congress has authorized a new bill that supports the development of advanced nuclear power. Billionaire Bill Gates says “I cannot overstate how important this is”.\r\nThe bill includes:\r\nlong-term nuclear power purchase agreements\r\nadvanced nuclear react… [+817 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "First Eighty-Year Nuclear Plant Licensing Could be Made Next Year", "description": "Dominion Energy could spend $4 billion over the next decade on the Surry-North Anna relicensing program and plant maintenance. The two nuclear units at Surry Power Station are both three-loop... [[ This is a content summary only. Visit my website for full lin…", "url": "https://www.nextbigfuture.com/2019/03/first-eighty-year-nuclear-plant-licensing-could-be-made-next-year.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/surrynuclear.jpg", "publishedAt": "2019-03-31T21:51:13Z", "content": "There is also progress to new nuclear fuel that has more surface area which could improve safety, increase power generation and improve nuclear power economics.\r\nSOURCES- Lightbridge, World Nuclear News, Westinghouse\r\nWritten by Brian Wang"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Growth in World Energy in 2018 Was Double the Recent Average Growth", "description": "World Energy consumption increased 2.3% in 2018 with 70% of the increase coming from China, the USA and India. The growth was double the average increase from 2010-2017. Global Electricity demand... [[ This is a content summary only. Visit my website for full…", "url": "https://www.nextbigfuture.com/2019/03/growth-in-world-energy-in-2018-was-double-the-recent-average-growth.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/coalsmoke.jpg", "publishedAt": "2019-03-31T21:15:03Z", "content": "World Energy consumption increased 2.3% in 2018 with 70% of the increase coming from China, the USA and India. The growth was double the average increase from 2010-2017. Global Electricity demand increased by 4% to 23000 Terawatt hours. Global energy-related … [+591 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Tesla Semi Maybe Nearing Pre-Production Level", "description": "Elon Musk tweeted pictures of a Tesla Semi delivering Tesla passenger electric cars. The Tesla Semi was not expected to be in full production until 2020. However, it appears that Tesla will be using... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2019/03/tesla-semi-maybe-nearing-pre-production-level.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-31-at-7.38.54-PM.jpg", "publishedAt": "2019-03-31T17:44:49Z", "content": "Elon Musk tweeted pictures of a Tesla Semi delivering Tesla passenger electric cars. The Tesla Semi was not expected to be in full production until 2020. However, it appears that Tesla will be using a few dozen of the Tesla Semi’s and could start delivering s… [+794 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Energy Lies Believed By Intelligent People", "description": "I was at the MIT EmTech Digital 2019 conference. There was a lunch discussion which involved nuclear energy. A supercomputer and Artificial intelligence expert said that Nuclear Power was great... [[ This is a content summary only. Visit my website for full l…", "url": "https://www.nextbigfuture.com/2019/03/energy-lies-believed-by-intelligent-people.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2018/11/Screen-Shot-2018-11-25-at-7.37.32-AM-min.png", "publishedAt": "2019-03-30T13:28:29Z", "content": "I was at the MIT EmTech Digital 2019 conference. There was a lunch discussion which involved nuclear energy. A supercomputer and Artificial intelligence expert said that Nuclear Power was great except for the dangerous nuclear waste. Someone else at the table… [+6480 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "DOE Funds 2022 First Demo for Factory Mass Producible Nuclear Power", "description": "The late 2020’s could see the start of a new age of factory mass produced nuclear power. The DOE is putting most of its first of its kind funding ($13 million out of $19 million) for advanced... [[ This is a content summary only. Visit my website for full lin…", "url": "https://www.nextbigfuture.com/2019/03/doe-funds-2022-first-demo-for-factory-mass-producible-nuclear-power.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/02/Screen-Shot-2019-01-16-at-1.02.29-PM.png", "publishedAt": "2019-03-29T20:27:15Z", "content": "The late 2020’s could see the start of a new age of factory mass produced nuclear power.\r\nThe DOE is putting most of its first of its kind funding ($13 million out of $19 million) for advanced nuclear power research into the Westinghouse 25 MWe eVinci nuclear… [+2409 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Hong Kong-Greater Bay Area Plan to Nearly Triple its GDP by 2032", "description": "The 2022 Foundation is a think tank which has released a report about the plan for Hong Kong integrate with Shenzhen and the other cities in the Great Bay Area. The Beijing-Tianjin-Hebei region... [[ This is a content summary only. Visit my website for full l…", "url": "https://www.nextbigfuture.com/2019/03/hong-kong-greater-bay-area-plan-to-nearly-triple-its-gdp-by-2032.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Guangzhou2030.jpg", "publishedAt": "2019-03-29T16:38:14Z", "content": "The 2022 Foundation is a think tank which has released a report about the plan for Hong Kong integrate with Shenzhen and the other cities in the Great Bay Area. \r\nThe Beijing-Tianjin-Hebei region (Jing-Jin-Ji), the Yangtze River Delta (YRD), and the Pearl Riv… [+1499 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "China Will Still Do Whatever It Takes to Catch Up", "description": "Senior Scientist at the University of Wisconsin-Madison, Yi Fuxian makes the case that China’s nominal GDP will peak at 84% of the US GDP in 2033. He is the author of Big Country with an Empty... [[ This is a content summary only. Visit my website for full li…", "url": "https://www.nextbigfuture.com/2019/03/china-will-still-do-whatever-it-takes-to-catch-up.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/02/Screen-Shot-2019-02-23-at-12.12.17-PM.jpg", "publishedAt": "2019-03-29T16:20:39Z", "content": "Senior Scientist at the University of Wisconsin-Madison, Yi Fuxian makes the case that China’s nominal GDP will peak at 84% of the US GDP in 2033. He is the author of Big Country with an Empty Nest and claims that China’s aging population will not be able or … [+3610 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Cryptocurrency Miners Tech and Which Mining Machines are Profitable?", "description": "Bitmain will launch its next-generation 7nm ASIC chip, BM1397, which achieves will improve performance, chip area and energy efficiency for mining cryptocurrencies such as Bitcoin (BTC) and Bitcoin... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/cryptocurrency-miners-tech-and-which-mining-machines-are-profitable.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/sc1imm-hardware.jpg", "publishedAt": "2019-03-29T01:03:29Z", "content": "Bitmain will launch its next-generation 7nm ASIC chip, BM1397, which achieves will improve performance, chip area and energy efficiency for mining cryptocurrencies such as Bitcoin (BTC) and Bitcoin Cash (BCH), that use the SHA256 algorithm for their Proof of … [+1894 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceX is Only Option for Human Landing on the Moon by 2024", "description": "Vice President Mike Pence announced a goal for a human landing on the Moon by 2024 during a National Space Council meeting. SpaceX will be the only real option for manned missions to the moon by... [[ This is a content summary only. Visit my website for full …", "url": "https://www.nextbigfuture.com/2019/03/spacex-only-option-for-human-landing-on-the-moon-by-2024.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-01-at-11.32.42-AM.jpg", "publishedAt": "2019-03-28T17:10:29Z", "content": "Vice President Mike Pence announced a goal for a human landing on the Moon by 2024 during a National Space Council meeting.\r\nSpaceX will be the only real option for manned missions to the moon by 2024. Mike Pence announced that the US government will no longe… [+1918 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Taking Calendaring to the Next Level With AI, Rigorous Analysis and Design", "description": "Smart time management is the core of greater business productivity and a smart calendar can make the most improvement for the efficiency of global teams. Calendar, is an dynamic calendar with... [[ This is a content summary only. Visit my website for full lin…", "url": "https://www.nextbigfuture.com/2019/03/taking-calendaring-to-the-next-level-with-ai-rigorous-analysis-and-design.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/calendarcom.png", "publishedAt": "2019-03-28T14:01:16Z", "content": "Smart time management is the core of greater business productivity and a smart calendar can make the most improvement for the efficiency of global teams. \r\nCalendar\r\n,\r\n is an dynamic\r\n calendar with enhanced AI and ML features that can categorize projects me… [+2066 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Do 2018 US Productivity Numbers Show Start of a New Boom?", "description": "The Us Bureau of Labor reported a 1.0% labor productivity gain in 2017-2018. This number was better across the country than the 0.4% per year gain from 2007-2017. However, labor productivity was... [[ This is a content summary only. Visit my website for full …", "url": "https://www.nextbigfuture.com/2019/03/do-2018-us-productivity-numbers-show-start-of-a-new-boom.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/worldservice.jpg", "publishedAt": "2019-03-27T20:40:05Z", "content": "The Us Bureau of Labor reported a 1.0% labor productivity gain in 2017-2018. This number was better across the country than the 0.4% per year gain from 2007-2017. However, labor productivity was still only 1.3% versus the 2.8% labor productivity of the PC-Int… [+1093 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Giant Megallan Telescope Excavation is Complete", "description": "The current construction of the Giant Magellan Telescope completed excavations for its foundations in six months instead of the planned 8-months. The foundations of the Giant Magellan Telescope’s... [[ This is a content summary only. Visit my website for full…", "url": "https://www.nextbigfuture.com/2019/03/giant-megallan-telescope-excavation-is-complete.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-27-at-12.36.15-PM-1024x628.jpg", "publishedAt": "2019-03-27T19:39:41Z", "content": "The current construction of the Giant Magellan Telescope completed excavations for its foundations in six months instead of the planned 8-months. The foundations of the Giant Magellan Telescopes massive pier and enclosure are now complete. The site constructi… [+1767 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "US, Russia, China and India Can Shoot Down Satellites", "description": "On March 27, 2019 India conducted Mission Shakti which was a successful anti-satellite missile test. In 2008, China had a successful anti-satellite missile test. It is like the European Space Agency,... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/us-russia-china-and-india-can-shoot-down-satellites.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/missionshakti.jpg", "publishedAt": "2019-03-27T17:56:53Z", "content": "On March 27, 2019 India conducted Mission Shakti which was a successful anti-satellite missile test.\r\nIn 2008, China had a successful anti-satellite missile test.\r\nIt is like the European Space Agency, Japan and the UK have anti-satellite missile capability. … [+66 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "VP Pence Calls for Manned Moon Landing by 2024", "description": "Yesterday, Vice President Mike Pence asked NASA Administrator Jim Bridenstine to accelerate lunar exploration plans during a National Space Council meeting held at NASA’s Marshall Space Flight Center... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/vp-pence-calls-for-manned-moon-landing-by-2024.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-11-at-11.30.54-PM.jpg", "publishedAt": "2019-03-27T16:06:15Z", "content": "Yesterday, Vice President Mike Pence asked NASA Administrator Jim Bridenstine to accelerate lunar exploration plans during a National Space Council meeting held at NASAs Marshall Space Flight Center in Huntsville, Alabama. Pence calls for targeting a human la… [+1211 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Small Nuclear Reactors from China and USA Around 2025", "description": "China will start pouring concrete for a 125 MWe ACP100 nuclear reactor by the end of this year. Construction is expected to take 65 months. The first unit expected to start up by 31 May 2025... [[ This is a content summary only. Visit my website for full link…", "url": "https://www.nextbigfuture.com/2019/03/small-nuclear-reactors-from-china-and-usa-around-2025.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/acp100-.jpg", "publishedAt": "2019-03-27T07:55:37Z", "content": "China will start pouring concrete for a 125 MWe ACP100 nuclear reactor by the end of this year. Construction is expected to take 65 months. The first unit expected to start up by 31 May 2025 Changjiang, Hainan. Each ACP100 module will weigh 300 tons.\r\nThe ACP… [+1232 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Massive Genome Editing Could Lead to Human Immunity to All Viruses", "description": "Base editing with reduced DNA nicking allows for the simultaneous editing of over 10,000 loci (13,000) in human cells. Performing this feat in the human genome will require the modification of 4438... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/massive-genome-editing-could-lead-to-human-immunity-to-all-viruses.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/humanvirus.jpg", "publishedAt": "2019-03-27T02:04:36Z", "content": "Base editing with reduced DNA nicking allows for the simultaneous editing of over 10,000 loci (13,000) in human cells. \r\nPerforming this feat in the human genome will require the modification of 4438 Amber codons. They have shown that gene editors that do not… [+3661 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Carnival of Space 604 – Boeing Working Overtime on SLS and Skylon Spaceplane Progresses", "description": "The Carnival of Space 604 is up at Universe Today. Universe Today – Progress for the Skylon. Europe agrees to continue working on the air-breathing SABRE engine ESA, together with the UK Space... [[ This is a content summary only. Visit my website for full li…", "url": "https://www.nextbigfuture.com/2019/03/carnival-of-space-604-boeing-working-overtime-on-sls-and-skylon-spaceplane-progresses.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/skylonspaceplane.jpg", "publishedAt": "2019-03-27T01:51:30Z", "content": "The Carnival of Space 604 is up at Universe Today.\r\nUniverse Today – Progress for the Skylon. Europe agrees to continue working on the air-breathing SABRE engineESA, together with the UK Space Agency (UKSA) has given a positive evalution after reviewing the p… [+1466 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Scaling Intelligent Assistants and Other AI – #emtechdigital", "description": "Rohit Prasad is the Vice President and Head Scientist, Alexa AI, Amazon. He is discussing scaling AI. Engaging with intelligent assistants has become routine in many of our lives, both at home and on... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/scaling-intelligent-assistants-and-other-ai-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/amazonai.jpg", "publishedAt": "2019-03-26T21:21:23Z", "content": "Rohit Prasad is the Vice President and Head Scientist, Alexa AI, Amazon. He is discussing scaling AI.\r\nEngaging with intelligent assistants has become routine in many of our lives, both at home and on the road. What can we learn from the technologists behind … [+1785 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Beyond Deep Learning: Investing in the Future of AI – Presented by Samsung NEXT #emtechdigital", "description": "Breakthroughs in deep learning are inspiring the evolution of AI. But will this “deep learning + X” model drive AI to its fullest potential? While problem solving with more data and deeper models has... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/beyond-deep-learning-investing-in-the-future-of-ai-presented-by-samsung-next-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/samsungnext.jpg", "publishedAt": "2019-03-26T20:47:41Z", "content": "Breakthroughs in deep learning are inspiring the evolution of AI. But will this deep learning + X model drive AI to its fullest potential? While problem solving\r\n with more data and deeper models has a place in AIs evolution, not every problem can be solved b… [+2607 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Ethics in AI – Google Announces External AI Advisory Council #emTechDigital", "description": "Google’s VP Kent Walker announced that Google will build an external AI advisory council. They come from our continents and from many disciplines. Google will be providing a release that has... [[ This is a content summary only. Visit my website for full link…", "url": "https://www.nextbigfuture.com/2019/03/ethics-in-ai-google-announces-external-ai-advisory-council-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/google.jpg", "publishedAt": "2019-03-26T18:17:42Z", "content": "Google’s VP Kent Walker announced that Google will build an external AI advisory council. They come from our continents and from many disciplines. Google will be providing a release that has the names and details of the external AI advisory council.\r\nGideon L… [+7796 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "What Does It Mean to a Researcher at Deep Mind #emtechdigital", "description": "David Budden is a Research Engineering Team Lead, DeepMind. He will discuss Engineering Intelligence. David talked about how innovation can come from anywhere in the company. A Deep Fake (fake... [[ This is a content summary only. Visit my website for full li…", "url": "https://www.nextbigfuture.com/2019/03/what-does-it-mean-to-a-researcher-at-deep-mind-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/IMG_7407-min.jpg", "publishedAt": "2019-03-26T17:31:38Z", "content": "David Budden is a Research Engineering Team Lead, DeepMind. He will discuss Engineering Intelligence.\r\nDavid talked about how innovation can come from anywhere in the company. A Deep Fake (fake picture) project was performed by an intern.\r\nIt is a myth that d… [+635 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Industry Outlook: Powering New Applied AI Solutions #emtechdigital", "description": "Naveen Rao is the Corporate Vice President and General Manager, Artificial Intelligence Products Group, Intel. Naveen views Moore’s law as an economic law. Naveen is talking about biological... [[ This is a content summary only. Visit my website for full link…", "url": "https://www.nextbigfuture.com/2019/03/industry-outlook-powering-new-applied-ai-solutions-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/IMG_7822-min.jpg", "publishedAt": "2019-03-26T16:59:11Z", "content": "Naveen Rao is the Corporate Vice President and General Manager, Artificial Intelligence Products Group, Intel. \r\nNaveen views Moore’s law as an economic law.\r\nNaveen is talking about biological comparisons in order to use biology as a guide. There is a great … [+2523 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Improving the Science Behind AI #emtechdigital", "description": "Hardware is gating the rate of progress in Artificial Intelligence. Bill Dally is the Chief Scientist and Senior Vice President of Research, Nvidia. Moore’s law is not providing performance... [[ This is a content summary only. Visit my website for full links…", "url": "https://www.nextbigfuture.com/2019/03/improving-the-science-behind-ai-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/nvidiaturing.jpg", "publishedAt": "2019-03-26T16:31:13Z", "content": "Hardware is gating the rate of progress in Artificial Intelligence. Bill Dally is the Chief Scientist and Senior Vice President of Research, Nvidia.\r\nMoore’s law is not providing performance gains but improvement is being made with specialized chips.\r\nPowerfu… [+2373 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Adversarial Machine Learning and Generated Objectives #emtechdigital", "description": "Gideon Lichfield is reviewing highlight from yesterdays talks at EmTech Digital 2019. Dawn Song talked about adversarial machine learning. Adversarial machine learning can be used to learn in spite... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/adversarial-machine-learning-and-generated-objectives-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-25-at-9.00.07-AM.jpg", "publishedAt": "2019-03-26T16:08:12Z", "content": "Gideon Lichfield is reviewing highlight from yesterdays talks at EmTech Digital 2019.\r\nDawn Song talked about adversarial machine learning. Adversarial machine learning can be used to learn in spite of problems and actors working against you in the environmen… [+187 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Reimagining Drug Design in the Era of AI #emtechdigital", "description": "Daphne Koller is the Founder and CEO, Insitro. Insitro will integrate cutting-edge machine learning techniques with the ground-breaking innovations that have occurred in life sciences that enable the... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/reimagining-drug-design-in-the-era-of-ai-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/insitro.jpg", "publishedAt": "2019-03-26T00:12:42Z", "content": "Daphne Koller is the Founder and CEO, Insitro\r\n. Insitro\r\n will integrate cutting-edge machine learning techniques with the ground-breaking innovations that have occurred in life sciences that enable the creation of the large, high-quality data sets. They wil… [+2454 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "AI and Robotics in the Lab: Accelerating Materials Discovery #emtechdigital", "description": "Jill Becker is the CEO and Cofounder, Kebotix. The Kebotix self-driving lab combines data and AI with robotics to discover and create advanced chemicals and materials at a faster rate and at the push... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/ai-and-robotics-in-the-lab-accelerating-materials-discovery-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/jillbecker.jpg", "publishedAt": "2019-03-25T23:50:42Z", "content": "Jill Becker is the CEO and Cofounder, Kebotix. The Kebotix self-driving lab combines data and AI with robotics to discover and create advanced chemicals and materials at a faster rate and at the push of a button. Kebotix offers inventive solutions that create… [+2109 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Construction Sites Will Become Like Automated Manufacturing Factories #emtechdigital", "description": "Andrew Anagnost is the President and CEO, Autodesk.He discusses using AI to improve construction and many other jobs and industries. Automation and Imagination: Designing a World for 10 Billion... [[ This is a content summary only. Visit my website for full l…", "url": "https://www.nextbigfuture.com/2019/03/construction-sites-will-become-like-automated-manufacturing-factories-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Autodesk.png", "publishedAt": "2019-03-25T23:35:28Z", "content": "Andrew Anagnost is the President and CEO, Autodesk.He discusses using AI to improve construction and many other jobs and industries. Automation and Imagination: Designing a World for 10 Billion People. \r\nAndrew sees other industries catching up to the automat… [+758 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Affectiva Redefining Human-Machine Partnership through Emotion AI #emtechdigital", "description": "Taniya Mishra is the Director of AI Research and Lead Speech Scientist, Affectiva. Affectiva is used by leading market research firms like Millward Brown, LRW, Added Value and Unruly, and brands like... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/affectiva-redefining-human-machine-partnership-through-emotion-ai-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-25-at-2.53.16-PM.jpg", "publishedAt": "2019-03-25T22:11:55Z", "content": "Taniya Mishra is the Director of AI Research and Lead Speech Scientist, Affectiva.\r\nAffectiva is used by leading market research firms like Millward Brown, LRW, Added Value and Unruly, and brands like Mars, Kelloggs and CBS. The technology is used to measure … [+2129 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "AI in Logistics and Transportation #emtechdigital", "description": "Chazz Sims is the Cofounder and CEO, Wise Systems. Wise Systems automatically schedules, monitors, and adjusts routes in real time – keeping teams on schedule and on plan. Chazz and Wise Systems... [[ This is a content summary only. Visit my website for full …", "url": "https://www.nextbigfuture.com/2019/03/ai-in-logistics-and-transportation-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-25-at-2.22.59-PM-1024x326.jpg", "publishedAt": "2019-03-25T21:44:12Z", "content": "Chazz Sims is the Cofounder and CEO, Wise Systems. \r\nWise Systems automatically schedules, monitors, and adjusts routes in real time keeping teams on schedule and on plan.\r\nChazz and Wise Systems believes that data is the key to optimized fleet management. Th… [+824 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Getting Autonomous Cars Ready for the Road #emtechdigital", "description": "Dmitri Dolgov is the CTO and VP of Engineering, Waymo. Dmitri briefly reviewed the self-driving car work ten to 15 years ago from the DARPA grand challenge to today. They initially chose 10 driving... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/getting-autonomous-cars-ready-for-the-road-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-25-at-1.59.45-PM.png", "publishedAt": "2019-03-25T21:19:43Z", "content": "Dmitri Dolgov is the CTO and VP of Engineering, Waymo.\r\nDmitri briefly reviewed the self-driving car work ten to 15 years ago from the DARPA grand challenge to today. \r\nThey initially chose 10 driving routes and driving about 100,000 miles to teach and test i… [+1628 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Enhancing Human Potential with AI", "description": "AI can be used to augmenting our intelligence. Lama Nachman is an Intel Fellow, Intel Labs; Director, Anticipatory Computing Lab, Intel. She will discuss Enhancing Human Potential with AI. Lama... [[ This is a content summary only. Visit my website for full l…", "url": "https://www.nextbigfuture.com/2019/03/enhancing-human-potential-with-ai.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-25-at-12.06.30-PM.jpg", "publishedAt": "2019-03-25T20:45:18Z", "content": "AI can be used to augmenting our intelligence. Lama Nachman is an Intel Fellow, Intel Labs; Director, Anticipatory Computing Lab, Intel. She will discuss Enhancing Human Potential with AI. Lama Nachman led the team that gave a voice to the late Professor Step… [+1828 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceX Raptor Engine SpaceHopper Test Today", "description": "Spadre.com is reporting that SpaceX is performing the first new raptor engine firing on the Spacehopper. The Spacehopper is being held down with tethers. Every Day Astronaut is also reporting live on... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/spacex-raptor-engine-spacehopper-test-today.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-10.51.03-AM.jpg", "publishedAt": "2019-03-25T18:49:20Z", "content": "Spadre.com is reporting that SpaceX is performing the first new raptor engine firing on the Spacehopper. The Spacehopper is being held down with tethers. Every Day\r\n Astronaut is also reporting live on the test firing.\r\nStill waiting. But maybe the Raptor wil… [+406 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Microscopic Quantum Heat Engine That Outperforms Classical Engines", "description": "Researchers have used an ensemble of NV− centers in diamond for implementing different types of quantum heat engines. They have used these to demonstrate the equivalence of the power output of two... [[ This is a content summary only. Visit my website for ful…", "url": "https://www.nextbigfuture.com/2019/03/microscopic-quantum-heat-engine-that-outperforms-classical-engines.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-25-at-11.42.37-AM.jpg", "publishedAt": "2019-03-25T18:44:05Z", "content": "Researchers have used an ensemble of NV centers in diamond for implementing different types of quantum heat engines. They have used these to demonstrate the equivalence of the power output of two different engine types, continuous and two-stroke, for small ac… [+1198 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "AI for Good: Balancing the Risks and Rewards #emTechDigital", "description": "There are series of three speakers talking about using AI for social good, defend human rights and an analysis on how to mitigate AI generated fake news. Ensuring that the era of AI benefits society... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2019/03/ai-for-good-balancing-the-risks-and-rewards-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Rediet_forweb_67909.jpg", "publishedAt": "2019-03-25T18:33:59Z", "content": "There are series of three speakers talking about using AI for social good, defend human rights and an analysis on how to mitigate AI generated fake news.\r\nEnsuring that the era of AI benefits society at large will require developing new ethical principles for… [+947 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Maintain Recycling Lies or Face Reality", "description": "Recycling was premised that there is not enough room in landfills and that a lot of plastics can and should be recycled. All the garbage produced in the U.S. for the next 1000 years could fit into a... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2019/03/maintain-recycling-lies-or-face-reality.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/trash.jpg", "publishedAt": "2019-03-25T18:22:44Z", "content": "Recycling was premised that there is not enough room in landfills and that a lot of plastics can and should be recycled. \r\nAll the garbage produced in the U.S. for the next 1000 years could fit into a landfill 100 yards deep and 35 miles across on each side. … [+2544 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "The Human Impact of AI #EmTechDigital", "description": "Leaders in the field are looking beyond cutting-edge research to examine the impact that AI technologies are having in the world. Putting humans at the center of the discussion is critical to ensure... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2019/03/the-human-impact-of-ai-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/fei-fei_-portrait.jpg", "publishedAt": "2019-03-25T17:47:29Z", "content": "Leaders in the field are looking beyond cutting-edge research to examine the impact that AI technologies are having in the world. Putting humans at the center of the discussion is critical to ensure that society will benefit from fair, unbiased tools.\r\nFei-Fe… [+1883 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Robots That Learn by Doing – Imagining Pictures and Goals #emdigitaltech", "description": "Sergey LevineAssistant Professor, UC BerkeleyRobots That Learn by Doing Sergey is talking about reinforcement learning. Robots can keep learning from its environment with reinforcement learning. We... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/robots-that-learn-by-doing-imagining-pictures-and-goals-emdigitaltech.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/slevine.png", "publishedAt": "2019-03-25T17:30:23Z", "content": "Sergey LevineAssistant Professor, UC BerkeleyRobots That Learn by Doing\r\nSergey is talking about reinforcement learning.\r\nRobots can keep learning from its\r\n environment with reinforcement learning.\r\nWe need algorithms for scalable off-policy reinforcement le… [+1119 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Future of AI and Security #emTechDigital", "description": "Dawn Song Professor, UC Berkeley; Founder and CEO, Oasis Labs Future of AI and Security Dawn is talking about AI-powered DDOS cyber attacks. Machine Learning in the Presence of the Attacker Cyber... [[ This is a content summary only. Visit my website for full…", "url": "https://www.nextbigfuture.com/2019/03/future-of-ai-and-security-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-25-at-9.00.07-AM.jpg", "publishedAt": "2019-03-25T16:55:16Z", "content": "Dawn SongProfessor, UC Berkeley; Founder and CEO, Oasis Labs\r\nFuture of AI and Security\r\nDawn is talking about AI-powered DDOS cyber attacks.\r\nMachine Learning in the Presence of the Attacker\r\nCyber attacks upon AI. It can attack the integrity and confidentia… [+907 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Microsoft AI Breakthroughs – AI Amplified Content and Creativity #emtechdigital", "description": "Harry Shum Executive Vice President, Artificial Intelligence and Research Group, Microsoft Democratization of AI He is talking about the State of AI. Microsoft AI has reached or exceeded human... [[ This is a content summary only. Visit my website for full li…", "url": "https://www.nextbigfuture.com/2019/03/microsoft-ai-breakthroughs-ai-amplified-content-and-creativity-emtechdigital.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Microsoftai.jpg", "publishedAt": "2019-03-25T16:33:05Z", "content": "Harry ShumExecutive Vice President, Artificial Intelligence and Research Group, MicrosoftDemocratization of AI\r\nHe is talking about the State of AI.\r\nMicrosoft AI has reached or exceeded human capabilities with speech, reading and writing from 2016 to today.\r… [+1039 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Live Blogging MIT EmTech Digital 2019 #emtechdigital", "description": "Brian Wang of Nextbigfuture will be live blogging the MIT Technology Review EmTech Digital 2019 event at the St. Regis in San Francisco. The focus is on the latest developments in Artificial... [[ This is a content summary only. Visit my website for full link…", "url": "https://www.nextbigfuture.com/2019/03/live-blogging-mit-emtech-digital-2019.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-25-at-9.00.07-AM.jpg", "publishedAt": "2019-03-25T16:02:02Z", "content": "Brian Wang of Nextbigfuture will be live blogging the MIT Technology Review EmTech Digital 2019 event at the St. Regis in San Francisco. The focus is on the latest developments in Artificial Intelligence.\r\nIt is a two-day event.\r\nGideon Lichfield, Editor in C… [+1403 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Rocket Lab Launching DARPA Membrane Antenna Satellite", "description": "Today Rocket Labs is counting down to launch a DARPA called Radio Frequency Risk Reduction Deployment Demonstration (R3D2) that will test technologies for deployable antennas. Once in orbit, R3D2... [[ This is a content summary only. Visit my website for full…", "url": "https://www.nextbigfuture.com/2019/03/rocket-lab-launching-darpa-membrane-antenna-satellite.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-24-at-2.22.43-PM.jpg", "publishedAt": "2019-03-24T21:26:59Z", "content": "Today Rocket Labs is counting down to launch a DARPA called Radio Frequency Risk Reduction Deployment Demonstration (R3D2) that will test technologies for deployable antennas. Once in orbit, R3D2 will deploy a Kapton membrane that will expand to a diameter of… [+1202 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "US Navy $1.2+ Trillion Dollar Plan to Increase Fleet to 355 Ships", "description": "If the US spends $20-55 billion per year more on ships and maintenance then the Navy will reach its target of 355 ships. They will slow down retirements and increase the purchase of ships. Initial... [[ This is a content summary only. Visit my website for ful…", "url": "https://www.nextbigfuture.com/2019/03/us-navy-trillion-dollar-plan-to-increase-fleet-to-355-ships.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-22-at-4.33.40-PM.jpg", "publishedAt": "2019-03-23T22:39:20Z", "content": null}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Nuclear Uprates Help US Set Record and Advanced Uprates Will Be the Future", "description": "US nuclear power plants set a new record for annual power generation in 2018. Capacity additions from plant uprates, combined with shorter refueling maintenance cycles, enabled the country’s... [[ This is a content summary only. Visit my website for full link…", "url": "https://www.nextbigfuture.com/2019/03/nuclear-uprates-help-us-set-record-and-advanced-uprates-will-be-the-future.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-23-at-3.17.54-PM.jpg", "publishedAt": "2019-03-23T22:20:01Z", "content": null}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "US Navy Getting Ten Robotic Combat Ships", "description": "The US Navy is buying a new breed of armed unmanned surface combat ships that will add more sensors and weapons to the current fleet. These will be 200-foot to 300-foot ships that displace 2,000... [[ This is a content summary only. Visit my website for full …", "url": "https://www.nextbigfuture.com/2019/03/us-navy-getting-ten-robotic-combat-ships.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-23-at-2.03.34-PM.jpg", "publishedAt": "2019-03-23T21:04:59Z", "content": null}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": null, "description": "In the next two years, the US Navy wants to deploy a 60-kilowatt Helios combat laser aboard a guided-missile destroyer. In 2021, they will install a High Energy Laser and Integrated Optical-dazzler... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/155096.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-22-at-4.29.30-PM-1.jpg", "publishedAt": "2019-03-22T23:38:50Z", "content": "In the next two years, the US Navy wants to deploy a 60-kilowatt Helios combat laser aboard a guided-missile destroyer. In 2021, they will install a High Energy Laser and Integrated Optical-dazzler with Surveillance weapon system aboard a West Coast Arleigh B… [+2209 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Boeing Flies Next Generation Rotocraft With Double the Speed and Range", "description": "The Sikorsky-Boeing #SB1 DEFIANT™ helicopter completed its first flight on March 21, 2019. This next generation vehicle will have twice the speed and twice the range of helicopters. Its two coaxial... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/boeing-flies-next-generation-rotocraft-with-double-the-speed-and-range.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-22-at-11.39.14-AM.jpg", "publishedAt": "2019-03-22T18:49:52Z", "content": "The Sikorsky-Boeing #SB1 DEFIANT helicopter completed its first flight on March 21, 2019. This next generation vehicle will have twice the speed and twice the range of helicopters.\r\nIts two coaxial main rotors and a rear mounted pusher propulsor, DEFIANT is u… [+1708 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Exaflop Supercomputer Race", "description": "The US Department of Energy is paying $500 million for the Aurora exaflop supercomputer to be built by Intel and Cray in 2021. Aurora will perform regular supercomputer research and artificial... [[ This is a content summary only. Visit my website for full li…", "url": "https://www.nextbigfuture.com/2019/03/exaflop-supercomputer-race-2.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Intel-Aurora-1.jpg", "publishedAt": "2019-03-22T06:53:47Z", "content": "The US Department of Energy is paying $500 million for the Aurora exaflop supercomputer to be built by Intel and Cray in 2021. Aurora will perform regular supercomputer research and artificial intelligence (AI) projects.\r\nThere will be extreme-scale cosmologi… [+2009 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "USA Will Recognize Israeli Control of Golan Heights and Its Military High Ground", "description": "The United States will recognize Israeli control of the Golan Height. President Trump announced his intent to recognize Israeli control. This could increase the chances for Israeli President... [[ This is a content summary only. Visit my website for full link…", "url": "https://www.nextbigfuture.com/2019/03/usa-will-recognize-israeli-control-of-golan-heights-and-its-military-high-ground.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-21-at-1.40.08-PM.jpg", "publishedAt": "2019-03-21T20:43:38Z", "content": "After 52 years it is time for the United States to fully recognize Israels Sovereignty over the Golan Heights, which is of critical strategic and security importance to the State of Israel and Regional Stability!\r\n— Donald J. Trump (@realDonaldTrump) March 21… [+5 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceX Heavy Best Option to Replace SLS for EM-1 Mission in 2020", "description": "SpaceX also has the second mission for the Falcon Heavy scheduled for April, 2019. There should be a third Falcon Heavy mission a few months later. If NASA is serious about completing the Exploration... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/spacex-heavy-best-option-to-replace-sls-for-em-1-mission-in-2020.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-14-at-12.26.55-PM.jpg", "publishedAt": "2019-03-21T20:15:28Z", "content": "Read next:\r\nUSA Will Recognize Israeli Control of Golan Heights and Its Military High Ground »« Boeing Delays Test so SpaceX Could Become Only US Manned Option"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Boeing Delays Test so SpaceX Could Become Only US Manned Option", "description": "Boeing has delayed by at least three months its first uncrewed flight to the International Space Station under NASA’s human spaceflight program and pushed its crewed flight until November.... [[ This is a content summary only. Visit my website for full links,…", "url": "https://www.nextbigfuture.com/2019/03/boeing-delays-test-so-spacex-could-become-only-us-manned-option.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-01-at-11.32.42-AM.jpg", "publishedAt": "2019-03-21T20:05:37Z", "content": "Boeing has delayed by at least three months its first uncrewed flight to the International Space Station under NASA’s human spaceflight program and pushed its crewed flight until November. SpaceX has just successfully completed its first uncrewed test flight.… [+531 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceX Hop Test Updates", "description": "Space Padre Isle is tweeting that the first SpaceX test firing could be happening today. There is still no confirmation from Elon Musk or SpaceX. The road was closed. Ars Technica reports that SpaceX... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/spacex-hop-test-updates.html", "urlToImage": null, "publishedAt": "2019-03-21T19:33:09Z", "content": "Sheriff says road will be closing at 10am CST (-5 UTC). Looks like the first test fire could be a go \r\n— SPadre (@SpacePadreIsle) March 21, 2019"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Near Gigapixel Imaging of Exoplanets from the Gravity Lens Regions", "description": "Exoplanets are planets in other solar systems. They are very faint but they are even harder to see because of the much brighter star they are orbiting. If we send a telescope to the solar... [[ This is a content summary only. Visit my website for full links, …", "url": "https://www.nextbigfuture.com/2019/03/near-gigapixel-imaging-of-exoplanets-from-the-gravity-lens-regions.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-21-at-11.09.48-AM.jpg", "publishedAt": "2019-03-21T18:49:39Z", "content": "An new megawatt laser and lithium-ion drive combination could reach 45 AU per year in speed. This could send missions to the SGL with 15-25 year trip times and the beamed power could be used to slow down and move around.\r\nThere are a few thousand stars within… [+2176 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Full Body Exoskeleton Ordered By Special Ops", "description": "Sarcos Robotics has been awarded a contract by the United States Special Operations Command (USSOCOM) to deliver a pre-production version of its Guardian™ XO® (“XO”) full-body, autonomously powered... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/full-body-exoskeleton-ordered-by-special-ops.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-20-at-11.49.31-PM.jpg", "publishedAt": "2019-03-21T06:56:35Z", "content": "Read next:\r\n« China’s Railguns vs US 1000 Mile Range Super-cannon"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "China’s Railguns vs US 1000 Mile Range Super-cannon", "description": "The US is working on a 1000 mile range super-cannon but appears to be behind China for railguns. China has been testing a railgun on a naval ship for over a year. They claim that railguns will be... [[ This is a content summary only. Visit my website for full…", "url": "https://www.nextbigfuture.com/2019/03/chinas-railguns-vs-us-1000-mile-range-super-cannon.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-20-at-11.18.32-PM.jpg", "publishedAt": "2019-03-21T06:37:57Z", "content": null}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "US Military Procurement at a Quarter Trillion in 2020", "description": "In 2020, the US military will spend nearly a quarter of trillion dollars to buy military weapons and hardware. The Navy will get the most at about $70 billion, then the air force at $57 billion.... [[ This is a content summary only. Visit my website for full …", "url": "https://www.nextbigfuture.com/2019/03/us-military-procurement-at-a-quarter-trillion-in-2020.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-20-at-4.58.10-PM-min.png", "publishedAt": "2019-03-21T06:08:40Z", "content": null}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Megawatt Lasers, Microwave and Hypersonic Weapons", "description": "The goal of Under Secretary of Defense for Research and Engineering, Mike Griffin, is making megawatt lasers, hypersonic weapons and directed energy weapons. Griffin wants * megawatt lasers in space... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2019/03/megawatt-lasers-microwave-and-hypersonic-weapons.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/megalaser.jpg", "publishedAt": "2019-03-21T05:15:55Z", "content": "The goal of Under Secretary of Defense for Research and Engineering, Mike Griffin, is making megawatt lasers, hypersonic weapons and directed energy weapons.\r\nGriffin wants\r\n* megawatt lasers in space for space control \r\n* 75 kilowatts on top of the Stryker a… [+943 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "China-Italy BRI Deal Could Be as Historic as Marco Polo", "description": "In 1271, Marco Polo traveled from his home in Venice to China via the Silk Road. The Travels of Marco Polo had huge influence. Italy is now signing agreements to join China’s Belt and Road... [[ This is a content summary only. Visit my website for full links,…", "url": "https://www.nextbigfuture.com/2019/03/china-italy-bri-deal-could-be-as-historic-as-marco-polo.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-20-at-11.58.57-AM.jpg", "publishedAt": "2019-03-20T19:01:04Z", "content": "In 1271, Marco Polo traveled from his home in Venice to China via the Silk Road. The Travels of Marco Polo had huge influence. Italy is now signing agreements to join China’s Belt and Road Initiative.\r\nChina is investing in a new Venice port and in three othe… [+2202 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceIL Unmanned Lunar Mission on Course for the Moon", "description": "Israel’s unmanned lunar mission is on course to land on the moon’s Sea of Serenity on April 11. It will be between the Apollo 12 and 15 landing sites. The lower power of the booster rocket... [[ This is a content summary only. Visit my website for full links,…", "url": "https://www.nextbigfuture.com/2019/03/spaceil-unmanned-lunar-mission-on-course-for-the-moon.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Spaceilmoon.jpg", "publishedAt": "2019-03-20T17:54:01Z", "content": null}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceX Starhopper Hop Test Postponed Til Tomorrow", "description": "Space Padre reports that today’s SpaceX Starhopper test was canceled due to bad weather. The new scheduled first hop test is now scheduled for tomorrow. Just spoke with sheriff….today’s... [[ This is a content summary only. Visit my website for full links, ot…", "url": "https://www.nextbigfuture.com/2019/03/spacex-starhopper-hop-test-postponed-til-tomorrow.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-10.51.03-AM.jpg", "publishedAt": "2019-03-20T15:54:35Z", "content": "Just spoke with sheriff….todays test hop at SpaceX Boca Chica has been scrubbed due to weather and is postponed until 10am – 4pm tomorrow.\r\n— SPadre (@SpacePadreIsle) March 20, 2019"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "China Authorizes Building Four New Nuclear Reactors and India Ccmmits to Six", "description": "China announced plans to invest 81.2 billion yuan (US$12 billion) in four new nuclear reactors for the first time since 2016. CNNP’s reactors are planned in Zhangzhou city, Fujian province, while CGN... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/china-authorizes-building-four-new-nuclear-reactors-and-india-ccmmits-to-six.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-6.57.36-PM.jpg", "publishedAt": "2019-03-20T02:07:05Z", "content": "China announced plans to invest 81.2 billion yuan (US$12 billion) in four new nuclear reactors for the first time since 2016.\r\nCNNPs reactors are planned in Zhangzhou city, Fujian province, while CGN will build the other two in Huizhou city, Guangdong provinc… [+329 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "FasTrak Incorrectly Charges Millions of Drivers and Does Not Care", "description": "The picture above is California Highway sign is from the quarterly Metro Transportation Commission report. I have personally never seen the digital sign mention the Flex Fastrak transponder. You will... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/fastrak-incorrectly-charges-millions-of-drivers-and-does-not-care.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-1.35.24-PM.jpg", "publishedAt": "2019-03-19T21:27:23Z", "content": "The picture above is California Highway sign is from the quarterly Metro Transportation Commission report. I have personally never seen the digital sign mention the Flex Fastrak transponder. You will see below the large highway sign a tiny 2 foot tall by one-… [+4018 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceX Starship Rate of Progress Four Times Faster than the Reusable Falcon 9", "description": "If Elon Musk and SpaceX hit the targets for the Starhopper and the SpaceX Starship then SpaceX will have accelerated rocket development by about four times. This would be accelerating the rate of... [[ This is a content summary only. Visit my website for full…", "url": "https://www.nextbigfuture.com/2019/03/spacex-starship-rate-of-progress-four-times-faster-than-the-reusable-falcon-9.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-10.51.03-AM.jpg", "publishedAt": "2019-03-19T19:05:57Z", "content": "Probably right. Starship rate of progress far exceeds Falcon &amp; Dragon, although theyre critical to getting there. dInnovation/dt is what matters long-term.\r\n— Elon Musk (@elonmusk) March 9, 2019"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Elon Musk and NASA Chat As SpaceX on the Cusp of Manned Missions", "description": "There was a video where Elon Musk chat about the history of Elon Musk and SpaceX that has led to the SpaceX Crew Dragon. They also talk to the astronaut crews who will fly on the SpaceX Crew Dragon.... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2019/03/elon-musk-and-nasa-chat-as-spacex-on-the-cusp-of-manned-missions.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-10.28.21-AM.jpg", "publishedAt": "2019-03-19T17:31:47Z", "content": "There was a video where Elon Musk chat about the history of Elon Musk and SpaceX that has led to the SpaceX Crew Dragon. They also talk to the astronaut crews who will fly on the SpaceX Crew Dragon.\r\nThis mostly rehashes Elon going to Russia and getting an ex… [+352 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Debating China’s BRI and Being Home to the Next Silicon Valley", "description": "China’s Belt and Road has some questionable economic return potential. However, the Belt and Road is providing geopolitical returns. The Belt and Road has successful projects in Pakistan,... [[ This is a content summary only. Visit my website for full links, …", "url": "https://www.nextbigfuture.com/2019/03/debating-chinas-bri-and-as-home-to-the-next-silicon-valley.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-18-at-9.13.28-PM.jpg", "publishedAt": "2019-03-19T04:14:56Z", "content": "China’s Belt and Road has some questionable economic return potential. However, the Belt and Road is providing geopolitical returns. The Belt and Road has successful projects in Pakistan, Greece and some other countries. The projects are boosting the volume o… [+806 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Planet Labs Gets $168 Million in Funding and Launching More Satellites", "description": "Planet Labs received $168 million in funding and some of the funding will be to launch many more satellites. On April 1, 2019 they will launch 20 next-generation Dove satellites – Flock 4a – are... [[ This is a content summary only. Visit my website for full …", "url": "https://www.nextbigfuture.com/2019/03/planet-labs-gets-168-million-in-funding-and-launching-more-satellites.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/planetlabdoves.jpg", "publishedAt": "2019-03-19T00:20:38Z", "content": null}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Climate Change is a Problem But Not the End of the World", "description": "Cost-benefit climate change analyst Bjorn Lomborg has the following analysis of the costs. Bjorn is taking the UN panel report as being mostly credible and accurate. Bjorn does believe that sea... [[ This is a content summary only. Visit my website for full l…", "url": "https://www.nextbigfuture.com/2019/03/climate-change-is-a-problem-but-not-the-end-of-the-world.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/02/goldenage.jpg", "publishedAt": "2019-03-18T21:31:50Z", "content": "Cost-benefit climate change analyst Bjorn Lomborg has the following analysis of the costs.\r\nBjorn is taking the UN panel report as being mostly credible and accurate.\r\nBjorn does believe that sea levels would rise but that this is not a big overall cost.\r\nHur… [+2061 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Series of Fusion Experiments that Could Lead to Cheap, Clean, Abundant Fusion Energy", "description": "The bootstrapped LPP Fusion dense plasma focus nuclear fusion project will be starting a potentially big year of testing. They are completing work on their beryllium electrode. If everything goes... [[ This is a content summary only. Visit my website for full…", "url": "https://www.nextbigfuture.com/2019/03/series-of-fusion-experiments-that-could-lead-to-cheap-clean-abundant-fusion-energy.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/5MWlppfusion.jpg", "publishedAt": "2019-03-18T19:25:17Z", "content": "The bootstrapped LPP Fusion dense plasma focus nuclear fusion project will be starting a potentially big year of testing. They are completing work on their beryllium electrode. If everything goes smoothly on four critical steps then this could be the beginnin… [+4445 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceX Test Firing Integrated Raptor Engine Today or Tomorrow", "description": "SpaceX will begin test firing the Starhopper. The Starhopper will be tethered and the hops will not be visible from offsite. This will likely be only a few feet or less of lift in the initial tests.... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2019/03/spacex-test-firing-integrated-raptor-engine-today-or-tomorrow.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-08-at-10.13.28-AM.jpg", "publishedAt": "2019-03-18T15:09:38Z", "content": "SpaceX will begin test firing the Starhopper. The Starhopper will be tethered and the hops will not be visible from offsite. This will likely be only a few feet or less of lift in the initial tests. The first integrated test firing of a single engine could ha… [+740 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Latest Space Based Solar Power Concepts and Experiments at Caltech", "description": "Caltech and Northrop Grumman are continuing to make research progress towards space-based solar power. In 2018, the aerial density of the 1-meter solar tiles in 600 grams. This is an improvement from... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/latest-space-based-solar-power-concepts-and-experiments-at-caltech.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-17-at-6.42.00-PM.jpg", "publishedAt": "2019-03-18T01:51:50Z", "content": "Caltech and Northrop Grumman are continuing to make research progress towards space-based solar power.\r\nIn 2018, the aerial density of the 1-meter solar tiles in 600 grams. This is an improvement from 1500 grams per square meters in 2017. They are actually ta… [+2997 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "SpaceX is Already Building the Orbital Starship", "description": "SpaceX will not build a new nosecone for the Starhopper. Elon Musk tweeted that the new nosecone is being built for the orbital Starship. Elon has previously indicated that the orbital version of the... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/spacex-is-already-building-the-orbital-starship.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2018/09/Screen-Shot-2018-09-21-at-11.15.30-PM-min.png", "publishedAt": "2019-03-18T00:42:59Z", "content": "SpaceX will not build a new nosecone for the Starhopper. Elon Musk tweeted that the new nosecone is being built for the orbital Starship.\r\nElon has previously indicated that the orbital version of the Starship would be completed in June 2019.\r\nElon Musk has t… [+1843 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Magnetized Plasma Hypersonic Projectile Gun", "description": "China is working on magnetized plasma artillery which could enable hypersonic projectiles from a tank. This technology is different than railguns. China has started testing railguns on large navy... [[ This is a content summary only. Visit my website for full…", "url": "https://www.nextbigfuture.com/2019/03/magnetized-plasma-hypersonic-projectile-gun.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-16-at-7.34.51-PM.jpg", "publishedAt": "2019-03-17T02:37:07Z", "content": "China is working on magnetized plasma artillery which could enable hypersonic projectiles from a tank. This technology is different than railguns. China has started testing railguns on large navy ships. This technology could be ten to one hundred times smalle… [+789 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Stanford New Measurement to Ensure High Quality Quantum Dots", "description": "Stanford has a new measurement technique for quantum dots. Uncertainty about the quality of quantum dots are holding back the use of quantum dots. Above – A close-up artist’s rendering of... [[ This is a content summary only. Visit my website for full links, …", "url": "https://www.nextbigfuture.com/2019/03/stanford-new-measurement-to-ensure-high-quality-quantum-dots.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/qdotlight.jpg", "publishedAt": "2019-03-17T02:23:36Z", "content": "Stanford has a new measurement technique for quantum dots. Uncertainty about the quality of quantum dots are holding back the use of quantum dots. \r\nAbove – A close-up artists rendering of quantum dots emitting light theyve absorbed. (Image credit: Ella Marus… [+3299 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Artificial Muscles for a Future Air Conditioner", "description": "A prototype device has been developed that is able to transfer heat using ‘muscles’ made from nickel-titanium. Nickel-titanium (aka nitinol) is a shape-memory material that releases heat to its... [[ This is a content summary only. Visit my website for full l…", "url": "https://www.nextbigfuture.com/2019/03/artificial-muscles-for-a-future-air-conditioner.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-16-at-5.58.28-PM.jpg", "publishedAt": "2019-03-17T01:12:42Z", "content": "A prototype device has been developed that is able to transfer heat using muscles made from nickel-titanium. Nickel-titanium (aka nitinol) is a shape-memory material that releases heat to its surroundings when it is mechanically loaded in its superelastic sta… [+2585 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Automation and Longevity Impacts on Social Security and Medicare", "description": "Some people believe that successful antiaging would have a huge impact on social security and Medicare. They believe that if breakthrough medicine reduced the death probability each year three times,... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/automation-and-longevity-impacts-on-social-security-and-medicare.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-15-at-12.59.57-PM.jpg", "publishedAt": "2019-03-15T20:01:20Z", "content": "Some people believe that successful antiaging would have a huge impact on social security and Medicare. They believe that if breakthrough medicine reduced the death probability each year three times, then this would bankrupt social security or Medicare. If so… [+3096 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Raptor Engine at SpaceX Starhopper Launchpad", "description": "SpaceX is installing the first Raptor engine into the Starhopper. There is video and pictures of the Raptor engine beside the Starhopper. Vivian Okoy shared a tweet with a picture of the Raptor... [[ This is a content summary only. Visit my website for full l…", "url": "https://www.nextbigfuture.com/2019/03/raptor-engine-at-spacex-starhopper-launchpad.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-15-at-10.14.53-AM.jpg", "publishedAt": "2019-03-15T17:57:59Z", "content": "SpaceX is installing the first Raptor engine into the Starhopper. There is video and pictures of the Raptor engine beside the Starhopper. Vivian Okoy shared a tweet with a picture of the Raptor engine.\r\nThe Raptor engine has nearly twice the power of the curr… [+573 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Aging Expert Heading FDA Could be Good for Antiaging Projects", "description": "In April, aging research expert Norman E. (Ned) Sharpless, MD will become the acting commissioner of the Food and Drug Administration. Dr. Sharpless is a 2003 Paul B. Beeson Emerging Leaders Career... [[ This is a content summary only. Visit my website for fu…", "url": "https://www.nextbigfuture.com/2019/03/aging-expert-heading-fda-could-be-good-for-antiaging-projects.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-15-at-10.28.39-AM.jpg", "publishedAt": "2019-03-15T17:48:53Z", "content": "In April, aging research expert Norman E. (Ned) Sharpless, MD will become the acting commissioner of the Food and Drug Administration.\r\nDr. Sharpless is a 2003 Paul B. Beeson Emerging Leaders Career Development Award in Aging scholar. Ned served on AFARs Nati… [+1307 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "China", "description": "A panel of national security experts say China is leading the world in hypersonic technology due to Beijing setting a clear investment strategy to its industrial base. Hypersonic glide weapons are a... [[ This is a content summary only. Visit my website for f…", "url": "https://www.nextbigfuture.com/2019/03/china.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/blackjack.jpg", "publishedAt": "2019-03-15T07:16:18Z", "content": "A panel of national security experts say China is leading the world in hypersonic technology due to Beijing setting a clear investment strategy to its industrial base.\r\nHypersonic glide weapons are a threat to aircraft carriers and land air bases. \r\nThe Hudso… [+872 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Democratic exchange CoinCasso Succeeds in ICO Token Sale Despite Bear Market", "description": "CoinCasso, a hybrid cryptocurrency exchange, announces today its public launch with a successful crowdsale raise of USD 2.5 million by selling 6 million CCX tokens in total. CoinCasso is a... [[ This is a content summary only. Visit my website for full links,…", "url": "https://www.nextbigfuture.com/2019/03/democratic-exchange-coincasso-succeeds-in-ico-token-sale-despite-bear-market.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-14-at-11.48.09-PM.jpg", "publishedAt": "2019-03-15T06:54:26Z", "content": "CoinCasso, a hybrid cryptocurrency exchange, announces today its public launch with a successful crowdsale raise of USD 2.5 million by selling 6 million CCX tokens in total. CoinCasso is a community-driven, democratic solution created for members and by membe… [+313 chars]"}, {"source": {"id": "next-big-future", "name": "Next Big Future"}, "author": "Brian Wang", "title": "Tesla Model Y Will Hold Seven Passengers", "description": "The Tesla Model Y will have three rows of seats and hold seven passengers. Each second-row seat folds flat independently, creating flexible storage for skis, furniture, luggage and more. The liftgate... [[ This is a content summary only. Visit my website for …", "url": "https://www.nextbigfuture.com/2019/03/tesla-model-y-will-hold-seven-passengers.html", "urlToImage": "https://www.nextbigfuture.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-14-at-9.44.53-PM.jpg", "publishedAt": "2019-03-15T04:54:59Z", "content": null}]}