{"status": "ok", "totalResults": 3613, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "The FBI is reportedly joining the government's investigation into Boeing's 737 Max plane (BA)", "description": "Federal investigators are looking into how Boeing's 737 Max plane was certified to fly. The FBI is also joining the Department of Transportation's inquiry, the Seattle Times reported. The FBI is joining the Department of Transportation's investigation into th…", "url": "https://www.businessinsider.com/boeing-737-max-fbi-joins-investigation-into-plane-certification-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a6cf5daa50730d94a9177-1920-960.jpg", "publishedAt": "2019-03-20T21:11:36Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "Packers player says he cried after signing a $66 million contract, then went to his mom's job and asked if she was ready to retire", "description": "NFL linebacker Za'Darius Smith signed a four-year, $66 million contract with the Green Bay Packers this offseason. Smith told Ian Rapoport on a podcast that he cried when he first heard the deal. Smith also said that he went to his mom's job and told her abou…", "url": "https://www.businessinsider.com/zadarius-smith-contract-packers-asked-mom-retire-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92a7a74f07ae6536025ea5-1136-568.jpg", "publishedAt": "2019-03-20T21:08:08Z", "content": "Za'Darius Smith was one of the big winners of the NFL offseason. \r\n The 26-year-old linebacker signed one of the biggest deals of NFL free agency this season, a four-year, $66 million contract with the Green Bay Packers, with $20 million guaranteed. \r\n Smith … [+1357 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Antonio Villas-Boas", "title": "Here are the differences between Apple's original AirPods and the new AirPods (AAPL)", "description": "Apple quietly announced its new generation of AirPods, which come with a few differences over the original AirPods that were released in December 2016. The majority of differences are general improvements in functionality. There's also a new charging case opt…", "url": "https://www.businessinsider.com/new-apple-airpods-compared-with-old-original-airpods-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c929da8124d044e626e136b-1136-568.jpg", "publishedAt": "2019-03-20T20:55:28Z", "content": "Apple released its new generation of AirPods on Wednesday, and they sure look a lot like the original AirPods that Apple released back in December 2016. \r\n But the exterior is where the similarities end with Apple's new AirPods, as Apple added some new innard… [+357 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Bernie Sanders revisits his vote against the Iraq War, which started 16 years ago today, and says much of what he feared came true", "description": "Sen. Bernie Sanders voted against the 2003 Iraq War. Another 2020 Democratic contender, Joe Biden, voted for the war. Wednesday marked the 16th anniversary of the US invasion, and Sanders took the opportunity to tout his record against the war in social media…", "url": "https://www.businessinsider.com/bernie-sanders-revisits-vote-against-iraq-war-16th-anniversary-invasion-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c928d7e69bdec4a62720833-1920-960.jpg", "publishedAt": "2019-03-20T20:52:42Z", "content": "On the sixteenth anniversary of the US invasion of Iraq, Sen. Bernie Sanders said it gives him \"no pleasure\" to say that much of what he feared would happen as a consequence of a war he voted against has come true. \r\n \"In the 16 years since the Iraq war began… [+3673 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "I got an inside look at the brand new, 7-story 'vertical shopping experience' in Hudson Yards, which the developers insist is not a mall — here's what I saw on opening day", "description": "The Shops and Restaurants at Hudson Yards, a seven-story luxury shopping center, opened to the public on March 15. The one-million-square-foot shopping center includes more than 100 shops and 25 cafés and eateries, including Louis Vuitton, Kate Spade, Cartier…", "url": "https://www.businessinsider.com/hudson-yards-mall-shops-restaurants-new-york-city-photos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c928ef1113a504f6e7e0257-2732-1366.jpg", "publishedAt": "2019-03-20T20:49:00Z", "content": "The Shops and Restaurants at Hudson Yards, a seven-story shopping center with more than 100 stores including Louis Vuitton, Kate Spade, Fendi, and the city's first Neiman Marcus, is officially open to the public. \r\n Hudson Yards is New York City's new $25 bil… [+1416 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "'A poll tax by any other name': Alexandria Ocasio-Cortez, Hillary Clinton, and Kamala Harris slam a Florida bill that would force ex-felons to pay fees before voting", "description": "Progressives are voicing outrage over a bill being pushed by the Republican-dominated Florida state legislature to limit the number of former felons who can vote. The GOP-sponsored bill would require former felons to pay all of their court fees and fines befo…", "url": "https://www.businessinsider.com/alexandria-ocasio-cortez-hillary-clinton-poll-tax-florida-bill-ex-felons-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9283685dfa9955df727ac4-1136-568.jpg", "publishedAt": "2019-03-20T20:43:14Z", "content": "Progressives are voicing outrage over a bill being pushed by the Republican-controlled Florida state legislature to limit the number of former felons who can vote, even after the vast majority of Floridians approved the re-enfranchisement of most ex-felons la… [+2404 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "Grimes speaks out about her feelings for Elon Musk and what it's been like since his 'funding secured' scandal", "description": "Grimes was featured in a profile for WSJ Magazine ahead of the release of her newest album. In the interview, Grimes discussed her relationship with Tesla CEO Elon Musk, who she referred to as a \"super-interesting goddamn person.\" Grimes said it was \"disturbi…", "url": "https://www.businessinsider.com/grimes-speaks-out-about-love-for-tesla-ceo-elon-musk-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c927d1ae0575a46204f06e3-1536-768.jpg", "publishedAt": "2019-03-20T20:39:34Z", "content": "Canadian singer Grimes says she was \"unprepared\" for the amount of attention she got last summer after tweeting about unionization efforts at Tesla, the company headed up by her then-boyfriend, Elon Musk. \r\n In a profile ahead of the release of her upcoming a… [+3818 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "A 36-year-old woman just became the first person to swim around Easter Island. It took her 19 hours.", "description": "Rapa Nui, or Easter Island, is one of the most remote places in the world. Sarah Ferguson, a 36-year-old South African swimmer, just became the first person to swim around the island. She logged 39.46 miles in 19 hours and 8 minutes. The area around Easter Is…", "url": "https://www.businessinsider.com/woman-swims-around-easter-island-19-hours-record-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9270b25b066e483570e469-1334-667.jpg", "publishedAt": "2019-03-20T20:36:00Z", "content": "Easter Island is one of the most remote islands in the world. It sits some 2,200 miles off the coast of Chile, and is 1,200 miles from the nearest piece of land. \r\n But even there, the water is filled with plastic. \r\n That was the motivation for elite South A… [+1377 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ryan Pickrell", "title": "Trump's acting defense chief is under investigation for allegedly trashing the F-35", "description": "Acting Secretary of Defense Patrick Shanahan is reportedly under investigation for alleged ethics violations, POLITICO reported. Shanahan is said to have boosted his former employer, Boeing, at the Pentagon while criticizing competitor Lockheed Martin and its…", "url": "https://www.businessinsider.com/acting-dod-chief-is-under-investigation-for-alleged-ethics-violations-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c929eaa401d584b796ab8ee-2732-1366.jpg", "publishedAt": "2019-03-20T20:28:45Z", "content": "Acting Secretary of Defense Patrick Shanahan, a former Boeing executive who took over at the Pentagon in January after the stunning resignation of Jim Mattis, is reportedly under investigation for alleged ethics violations, the Department of Defense Office of… [+2846 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Abigail Abesamis", "title": "How to add and remove apps on your Apple Watch", "description": "You can add new apps to an Apple Watch using a few different methods on your iPhone. An Apple Watch comes pre-loaded with basic apps, just like an iPhone. Install new apps on your Apple Watch by using the iPhone Watch app and tapping \"Install\" on Available Ap…", "url": "https://www.businessinsider.com/how-to-add-apps-to-apple-watch-remove", "urlToImage": "https://amp.businessinsider.com/images/5c929fa869e11c703b779d6a-2732-1366.jpg", "publishedAt": "2019-03-20T20:27:00Z", "content": "When you're trying to get the best use out of your Apple Watch, it's all about the apps. \r\n Like the iPhone, Apple Watches come pre-loaded with set apps, including Activity (the app that tracks your progress toward daily, weekly, and monthly move, stand, and … [+3718 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "VCs are investing hundreds of millions into quantum computing startups even as they're bracing for a 'quantum winter'", "description": "Investors are putting upwards of $400 million into quantum computing startups, but many experts believe there will be a \"quantum winter.\" Right now, experts say there is much hype around quantum computing, but it will be years before quantum computers outperf…", "url": "https://www.businessinsider.com/vcs-are-investing-in-quantum-startups-but-expect-a-quantum-winter-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c928ecf4f07ae60b702db32-960-480.jpg", "publishedAt": "2019-03-20T20:07:56Z", "content": "Matthew Kinsella, managing director at Maverick Ventures, says he's \"super bullish\" on quantum technologies. But before quantum computers become a huge success Kinsella is bracing for a \"quantum winter.\" \r\n A \"winter\" is the term industry insiders use to desc… [+3082 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Lyft's first Wall Street analyst to launch coverage of the stock gave it a buy rating. Here's why he says the company could be worth $25 billion (LYFT)", "description": "Lyft is racing towards an initial public offering (IPO) that could launch as soon as next week. Ahead of the IPO, the company nabbed its first buy rating from a Wall Street analyst. Tom White of D.A. Davidson gave the company a $75 price target, which transla…", "url": "https://www.businessinsider.com/lyfts-first-wall-street-analyst-gives-buy-rating-75-price-target-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c928fc15b066e4e234eeb2c-2732-1366.jpg", "publishedAt": "2019-03-20T20:01:18Z", "content": "More than a week before shares are set to trade on the Nasdaq stock exchange, Lyft has already nabbed its first buy rating from a Wall Street analyst. \r\n Tom White, an internet analyst at Montana-based D.A. Davidson, launched coverage of the ride-hailing name… [+3042 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Remi Rosmarin", "title": "7 leggings and sports bras that have pockets for necessities like phones, keys, and cards", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/womens-leggings-sports-bras-with-pockets-for-phones-cards-keys-headphones", "urlToImage": "https://amp.businessinsider.com/images/5c916846daa50732d2702926-1136-568.jpg", "publishedAt": "2019-03-20T20:00:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1478 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "Depression among Gen Z is skyrocketing — a troubling mental-health trend that could impact the rest of their lives", "description": "Across the US, young people are reporting more depression. Rates of depression have skyrocketed among kids, teens, and young adults under 25. Experts say these young people are at serious risk of long-term mental health issues, and more could be done to help …", "url": "https://www.businessinsider.com/depression-rates-by-age-young-people-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90e823124d041e4f092e52-480-240.jpg", "publishedAt": "2019-03-20T19:55:00Z", "content": "Depression rates in the US are soaring. \r\n Over the last decade, more and more people in nearly every age group, financial bracket, and circumstance across the country have reported worrying symptoms. They're losing interest in life, lacking zest for learning… [+6254 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Business Insider", "title": "12 everyday phrases that you're probably saying incorrectly", "description": "English is a difficult language to learn with so many grammar and spelling rules to follow. Even if it's your first language, you've probably found yourself saying things incorrectly too many times to count. Some of the most commonly used idioms aren't actual…", "url": "https://www.businessinsider.com/everyday-phrases-smart-people-say-incorrectly-statute-2015-10", "urlToImage": "https://amp.businessinsider.com/images/5c9297746123ca5a8711ccd3-1920-960.jpg", "publishedAt": "2019-03-20T19:43:00Z", "content": "Here are 12 everyday phrases you might be saying incorrectly. \r\n Some people say, \"I could care less.\" It's actually, \"I couldn't care less.\" \r\n Some people say, \"one in the same.\" It's actually, \"one and the same.\" \r\n Some people say, \"on accident.\" It's act… [+803 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "Walmart's executive vice president of supply chain admits the retailer's new on-time, in-full requirement is 'onerous' for some", "description": "Walmart recently upped the requirement for its suppliers to deliver goods on-time and in-full (OT IF) from 85% to 87%. That ruffled feathers in the supplier community, as it puts extra pressures on them. Greg Smith, executive vice president of supply chain fo…", "url": "https://www.businessinsider.com/walmart-otif-requirement-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bcbe6003f5c53a13176d3-960-480.jpg", "publishedAt": "2019-03-20T19:38:06Z", "content": "Raking in more than $500 trillion in revenue in 2017, Walmart is the largest company in the world. And, understandably, they're also the largest customer of many companies who sell their goods on Walmart's shelves. (Clorox, for instance, earns some 27% of its… [+4466 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "Popular oral-care startup Quip has a new $25 electric toothbrush for kids — here’s what it looks like and how it’s different", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/quip-kids-electric-toothbrush", "urlToImage": "https://amp.businessinsider.com/images/5c910f6d69e11c3ce055c1a5-750-375.jpg", "publishedAt": "2019-03-20T19:29:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+3135 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "What Disney buying Fox means for movie and TV consumers — from Marvel to Hulu", "description": "The Disney-Fox merger finally closed on Wednesday, and Disney now owns Fox's stake in Hulu and its popular movie franchises like \"Avatar\" and \"X-Men.\" Post-merger, the Marvel Cinematic Universe will drastically change, Disney will launch its own streaming ser…", "url": "https://www.businessinsider.com/how-disney-fox-merger-affects-consumers-hulu-marvel-streaming-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c77ed962628982edd019ae4-1920-960.jpg", "publishedAt": "2019-03-20T19:20:42Z", "content": "The $71 billion Disney-Fox deal officially closed on Wednesday, pushing Disney even further in its dominance of Hollywood and the entertainment industry. Disney now owns Fox's film studio, many of its television assets, its stake in Hulu, and its popular film… [+3438 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tomas Chamorro-Premuzic, Contributor", "title": "5 ways to decide if your boss is incompetent, according to a personality science expert", "description": "Dr. Tomas Chamorro-Premuzic is a psychologist who uses science and tech to help organizations predict human performance. He says that many people these days seem disenchanted with the idea of traditional employment, mostly because it may require putting up wi…", "url": "https://www.businessinsider.com/my-boss-is-incompetent-signs-personality-science-expert-2019-3", "urlToImage": null, "publishedAt": "2019-03-20T19:18:52Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Antonio Villas-Boas", "title": "This could be our first look at the Galaxy Fold's rumored creasing issue that Samsung is supposedly trying to fix", "description": "A recent video shows creasing down the middle of what is purportedly Samsung's unreleased foldable smartphone, the Galaxy Fold. The Galaxy Fold uses a plastic display, which could explain creasing over time. Bloomberg previously reported that Samsung is curre…", "url": "https://www.businessinsider.com/samsung-galaxy-fold-rumored-creasing-issue-leaked-video-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9284a069bdec48fb072664-1136-568.jpg", "publishedAt": "2019-03-20T19:15:14Z", "content": "A Samsung Galaxy Fold — or a phone that looks just like it — that's somehow out in the wild before its April 26 release date is showing signs of creasing, according to a recent video posted on the tech YouTube channel \"phoneoftime.\"\r\n Samsung is using its new… [+1051 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "Amazon's new entry-level Kindle has a front light so you can read in the dark — it's up for preorder now for $89.99", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/new-amazon-kindle-specs-price-availability", "urlToImage": "https://amp.businessinsider.com/images/5c9285ffe0575a47b5346ea7-1136-568.jpg", "publishedAt": "2019-03-20T19:15:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+2154 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Francesca Rea", "title": "Amazon has launched its first-ever skin-care line, called Belei — and all 12 products are $40 or less", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/amazon-launches-belei-skin-care-products", "urlToImage": "https://amp.businessinsider.com/images/5c927b4869bdec469323dfe9-1136-568.jpg", "publishedAt": "2019-03-20T19:03:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+2067 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "March Madness brackets require a final score in the championship game — here's one of the most likely outcomes", "description": "March Madness brackets require a score prediction for the final game of the tournament. We determined the average score of the final games over the last 29 years by calculating the average combined scores of the two teams, the average individual score, and th…", "url": "https://www.businessinsider.com/average-march-madness-final-score-past-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9284ba5b066e4c72432ca9-1334-667.jpg", "publishedAt": "2019-03-20T19:01:32Z", "content": "No one has ever gotten a perfect March Madness bracket. \r\n But all brackets, in the event of a tie, require a score prediction in the final game of the NCAA Tournament as a tiebreaker. Even if two people tie in a pool with imperfect brackets, the final score … [+1214 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Richard Feloni", "title": "The head of Siemens USA explains why it's making open-source training programs available across industries, as it looks to benefit from a new age of automation", "description": "Barbara Humpton is the CEO of the US subsidiary of Siemens, the large German engineering conglomerate that is developing both the technologies changing the workforce and the skills-training programs that are needed in response. Humpton is an advocate for open…", "url": "https://www.businessinsider.com/siemens-us-ceo-barbara-humpton-on-skills-training-and-leadership-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f5e9f73f5c1b122f9ca6-1920-960.jpg", "publishedAt": "2019-03-20T19:01:00Z", "content": "We're in the early stages of what the World Economic Forum calls \"the Fourth Industrial Revolution.\" As automation replaces jobs and advanced technologies create new ones, the developed world is being forced to rethink the way it educates students and trains … [+14846 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "Dai is the next big women's performance workwear brand you should know — here's what its clothes look and feel like", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/dai-womens-workwear-blazer-pants-review", "urlToImage": "https://amp.businessinsider.com/images/5c923fc5113a5040f0497bbb-750-375.jpg", "publishedAt": "2019-03-20T18:58:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+4880 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "ThirdLove founder reveals why the company spoke out against Victoria's Secret after one of its parent company's execs made controversial comments about transgender and plus-size models (LB)", "description": "ThirdLove ran a full-page ad in The New York Times in November, slamming Victoria's Secret after an executive at the lingerie brand's parent company made controversial comments about transgender and plus-size models in an interview with Vogue. The ad, which w…", "url": "https://www.businessinsider.com/why-thirdlove-slammed-victorias-secret-ad-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c925de169bdec41d8567765-750-375.jpg", "publishedAt": "2019-03-20T18:56:38Z", "content": "Last November, Victoria's Secret came under fire after one of its parent company's executives made controversial comments during an interview with Vogue. \r\n Ed Razek, chief marketing officer of L Brands, said in the interview that he didn't think the company'… [+2986 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andy Kiersz", "title": "The 30 best high-paying jobs of the future", "description": "Using employment projection and salary data from the Bureau of Labor Statistics, we found 30 high-paying jobs that are poised to enjoy healthy employment growth over the next decade. Several tech and medical occupations show up on the list. The future of work…", "url": "https://www.businessinsider.com/best-jobs-future-growth-2019-3", "urlToImage": "https://amp.businessinsider.com/images/58a4868801fe581d008b49c9-960-480.jpg", "publishedAt": "2019-03-20T18:56:14Z", "content": "The future of work is looking pretty bright, at least for nurses and software developers. \r\n Plenty of medical and tech jobs are likely to keep growing in the next several years, and pay handsomely as well. \r\n The Bureau of Labor Statistics' Employment Projec… [+742 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Warren", "title": "Ian Schrager, the cofounder of Studio 54, says the legendary NYC nightclub could be recreated today — but it would be different in 3 key ways", "description": "Ian Schrager, the cofounder of legendary nightclub Studio 54, says the club could be recreated today with a few adjustments. Studio 54 was a New York City club known for its wild parties in the early 1970s and '80s and for attracting high-profile guests like …", "url": "https://www.businessinsider.com/ian-schrager-studio-54-future-of-luxury-hotels-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9149f3e0575a2ca41fe570-1536-768.jpg", "publishedAt": "2019-03-20T18:55:00Z", "content": "Studio 54, the legendary nightclub known for its wild parties and high-profile guests like David Bowie and Andy Warhol, was the pinnacle of New York City nightlife in the 1970s and early '80s. \r\n For some, Studio 54 was a phenomenon that could never again exi… [+3009 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Lyft will be the first ride-hailing company to ever go public. Here’s how its numbers compare to Uber. (LYFT)", "description": "Lyft is Wall Street's first shot at ride-hailing. While the company is much smaller than Uber, it has been slowly gaining ground on its global competitor. Business Insider compiled numbers from Lyft's IPO filing in order to compare them to Uber's self-reporte…", "url": "https://www.businessinsider.com/lyft-uber-compared-ahead-of-ipos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c925756daa50741d31d5437-1136-568.png", "publishedAt": "2019-03-20T18:21:18Z", "content": "That makes sense, given Lyft is only active in the US and Canada. Uber, meanwhile, is active in thousands of markets in countries all around the globe. Lyft seems focused on the US for now, and has privately pitched investors on its singular ride-hailing (and… [+775 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sam Fellman", "title": "A short history of America's only Army tank factory, which Trump is about to tour", "description": "President Trump toured a sprawling manufacturing site in Ohio that has been building Army tanks and armored vehicles since World War II. It nearly shuttered in 2012 under the drastic “sequestration” cuts, but it now produces about 11 tanks a month and employs…", "url": "https://www.businessinsider.com/history-of-ohios-lima-army-tank-plant-only-tank-builder-in-the-us-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c927b6af73f5c442216d0a7-960-480.jpg", "publishedAt": "2019-03-20T18:20:54Z", "content": "President Donald Trump is touring the US's last tank facility on Wednesday in a move to highlight the impact of his soaring defense spending in a politically crucial state. \r\n The Joint Systems Manufacturing Center in Lima, Ohio, has been building Army tanks … [+858 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Smith", "title": "Here's a look at every single Apple store in the United States (AAPL)", "description": "We've compiled a list of every Apple store in the United States. Jump to your favorite state via the table of contents, or scroll down to see every state in alphabetical order. To understand Apple's retail footprint, it really helps to see it for yourself. Be…", "url": "https://www.businessinsider.com/every-apple-store-in-the-united-states-photos-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c9276555dfa9952ef34bdc7-750.jpg", "publishedAt": "2019-03-20T17:57:07Z", "content": "To understand Apple's retail footprint, it really helps to see it for yourself. \r\n Below, we've collected the photos and locations of every single Apple store in the United States. Apple currently has 271 US stores in operation. We'll be updating this list ov… [+860 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Amir Ismael", "title": "Save on computers and tech during Dell's big semi-annual sale — and more of today's best deals from around the web", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/deal-of-the-day-dell-semi-annual-sale-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92650ae0575a42032a7e13-640-320.jpg", "publishedAt": "2019-03-20T17:47:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+4024 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "JetBlue is selling one-way tickets for as little as $44 until Friday (JBLU)", "description": "JetBlue is selling one-way tickets for as little as $44 until Friday. The discounted fares are part of the airline's \"big spring sale,\" which ends at either 11:59 pm Eastern Time or the customer's local time, depending on which is earlier. You can find the fu…", "url": "https://www.businessinsider.com/jetblue-one-way-ticket-sale-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9279ce69e11c6880744084-1334-667.png", "publishedAt": "2019-03-20T17:46:47Z", "content": "JetBlue is selling one-way tickets for as little as $44 until Friday. \r\n The discounted fares are part of the airline's \"big spring sale,\" which ends at either 11:59 pm Eastern Time or the customer's local time, depending on which is earlier. \r\nRead more: Bri… [+542 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "The creators of 'Fortnite' now have more than 85 million people using their store to buy games on PC", "description": "Epic Games, the company behind 'Fortnite,' has welcomed more than 85 million users to its PC gaming store since December 2018. Much of that success can be credited to \"Fortnite.\" Since July 2017, a total of 250 million players have played \"Fortnite\" on PC, vi…", "url": "https://www.businessinsider.com/epic-games-store-total-users-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92751df73f5c42e2408753-1920-960.jpg", "publishedAt": "2019-03-20T17:36:18Z", "content": "The success of \"Fortnite\" has helped the game's creators carve out a major stake in the PC gaming market. During a keynote address at the Game Developers Conference earlier today, Epic Games announced that its digital storefront surpassed 85 million users in … [+2175 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sharon Feiereisen", "title": "I asked experts how to be healthier — here are the 8 best tips they gave me", "description": "I asked several health experts their best tips for getting healthier. Their answers ranged from meditating and journaling to simply spending more time in nature. It takes more than just diet and exercise to be healthy. I asked experts and entrepreneurs in hea…", "url": "https://www.businessinsider.com/8-best-tips-to-be-healthier-according-to-experts-2019-3", "urlToImage": "https://amp.businessinsider.com/images/538cb42cecad04084c21f678-2732-1366.jpg", "publishedAt": "2019-03-20T17:36:00Z", "content": "Meal prepping can be a great way for busy people to eat healthy and when it's done right, can help save food, money, and the environment in the process. \r\n However, it's not always done right. \r\n \"It often leads to wasted food — and all of the money, water an… [+786 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson", "title": "The 22 best football managers of all time", "description": "France Football, a soccer magazine in Europe, has ranked the top coaches in the sport's history. There are many familiar faces, from soccer's storied history through to today. Read all of Business Insider's coverage for the 2018-2019 season right here. A Fren…", "url": "https://www.businessinsider.com/best-football-managers-of-all-time-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a6a13091784252c008b4812-960-480.jpg", "publishedAt": "2019-03-20T17:31:00Z", "content": "A French soccer magazine has published a list of the best coaches in the history of world soccer. \r\nFrance Football used a criteria of trophies won, personality, and how the manager influenced the sport and other coaches in order to produce the ranking. \r\n As… [+639 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julie Bort", "title": "Bill Gates is $9.5 billion richer than he was a year ago, worth over $100 billion, but not just from Microsoft (MSFT)", "description": "Bill Gates is one of the world's biggest philanthropists who has given away billions of dollars of his money. That's why so many people think that Gates' personal wealth is shrinking as he gives his money away. But it isn't. Gates is astoundingly rich and get…", "url": "https://www.businessinsider.com/bill-gates-worth-over-100-billion-95-billion-richer-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9270bf69e11c668c3479a8-2732-1366.jpg", "publishedAt": "2019-03-20T17:18:27Z", "content": "Bill Gates is one of the world's biggest philanthropists. He and his wife Melinda have given away a whopping $45.5 billion in their lifetimes through their foundation and other charities, according to the Chronicle of Philanthropy Plus, his Giving Pledge, an … [+3206 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Stocks stumble after Trump warns tariffs on China could remain for a 'substantial period of time'", "description": "Stocks in the US fell Wednesday after President Donald Trump told reporters he could leave tariffs on Chinese goods for a \"substantial period of time.\" \"Not what we wanted to hear,\" wrote Peter Boockvar, the chief investment officer at Bleakley Advisory Group…", "url": "https://www.businessinsider.com/stock-market-news-us-stocks-fall-on-trump-china-tariff-commentary-2019-3", "urlToImage": "https://images.markets.businessinsider.com/image/5c92323b401d58392052fa82-1920/gettyimages-1131644645.jpg", "publishedAt": "2019-03-20T17:18:00Z", "content": "Jabin Botsford/The Washington Post via Getty Images\r\nStocks in the US fell Wednesday after President Donald Trump told reporters he could leave tariffs on Chinese goods for a \"substantial period of time.\"\r\n\"Not what we wanted to hear,\" wrote Peter Boockvar, t… [+864 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Stocks stumble after Trump warns tariffs on China could remain for a 'substantial period of time'", "description": "Stocks in the US fell Wednesday after President Donald Trump told reporters he could leave tariffs on Chinese goods for a \"substantial period of time.\" \"Not what we wanted to hear,\" wrote Peter Boockvar, the chief investment officer at Bleakley Advisory Group…", "url": "https://markets.businessinsider.com/news/stocks/stock-market-news-us-stocks-fall-on-trump-china-tariff-commentary-2019-3-1028046452", "urlToImage": "https://images.markets.businessinsider.com/image/5c92323b401d58392052fa82-1920/gettyimages-1131644645.jpg", "publishedAt": "2019-03-20T17:18:00Z", "content": "Jabin Botsford/The Washington Post via Getty Images\r\nStocks in the US fell Wednesday after President Donald Trump told reporters he could leave tariffs on Chinese goods for a \"substantial period of time.\"\r\n\"Not what we wanted to hear,\" wrote Peter Boockvar, t… [+1717 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "Michael Sanchez says he made a 'deal with the devil' in telling the National Enquirer about Jeff Bezos' affair", "description": "Michael Sanchez is the brother of Lauren Sanchez, Amazon CEO Jeff Bezos ' reported girlfriend, and has been named by multiple publications as the source behind the leaking of intimate texts and nude photos of the couple to the National Enquirer. In a new inte…", "url": "https://www.businessinsider.com/michael-sanchez-deal-with-the-devil-jeff-bezos-national-enquirer-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c923d625dfa994810404a97-1136-568.jpg", "publishedAt": "2019-03-20T17:09:00Z", "content": "Michael Sanchez says he made a \"deal with a devil\" in cooperating with the National Enquirer ahead of the paper's bombshell exposé revealing the couple's relationship. \r\n In new comments to Fox News, Sanchez admits he was in talks with the National Enquirer d… [+3344 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix and Erin Brodwin", "title": "A jury says that a common weed-killer chemical at the heart of an $80 million lawsuit contributed to a man’s cancer", "description": "A federal j ury said that Roundup, the popular weed-killer from the agrochemical company Monsanto, was a \"substantial factor\" in causing a man's cancer. Roundup's active ingredient is a widely-used agricultural pesticide called glyphosate, which has been tent…", "url": "https://www.businessinsider.com/monsanto-weed-killer-cancer-ruling-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c925d224f07ae568959302d-1920-960.jpg", "publishedAt": "2019-03-20T17:05:00Z", "content": "Tuesday ushered in another landmark verdict in the wave of lawsuits against Monsanto, the agrochemical giant behind the popular herbicide, Roundup, which has been accused of causing cancer. \r\n On March 19, a federal jury ruled that Roundup was a \"substantial\"… [+5464 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dakin Campbell", "title": "JPMorgan's investment bank is scrapping on-campus visits in favor of video interviews and online games as Wall Street targets the next generation", "description": "JPMorgan's corporate and investment bank will no longer visit college campuses to recruit, asking candidates instead to submit a video interview and play some behavioral science computer games. The bank made the change to level the playing field for diverse c…", "url": "https://www.businessinsider.com/jpmorgan-scraps-on-campus-recruiting-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c914c9b6123ca3a26567395-960-480.jpg", "publishedAt": "2019-03-20T17:00:00Z", "content": "No longer coming to a school near you. \r\n JPMorgan Chase's investment bank, one of the largest in the world, is scrapping the annual college recruiting visits that have launched generations of investment bankers and traders. Instead, the bank will ask its nex… [+4005 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dan DeFrancesco", "title": "An insurtech that's raised over $290 million just nabbed a former director of engineering at Uber to run its tech", "description": "Insurance-technology company Metromile nabbed a former senior engineer at Uber to run its tech, Business Insider has learned. Paw Anderson, who served as the senior director of engineering for Uber's advanced technology group, was recently named chief technol…", "url": "https://www.businessinsider.com/metromile-hired-a-cto-that-was-a-director-of-engineering-at-uber-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c926f9df73f5c422f5775a4-480-240.jpg", "publishedAt": "2019-03-20T16:57:22Z", "content": "A former senior engineer at Uber has joined a buzzy insurtech company aiming to disrupt the car-insurance business to run its tech. \r\n Paw Anderson, who previously served as a senior director of engineering for Uber's advanced technology group, was named chie… [+1369 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Beatrice Christofaro", "title": "80-year-old conman set up fake sites for Bernie Sanders, Beto O'Rourke, and others that tricked supporters into sending him $250,000, prosecutors say", "description": "An 80-year-old man from California was charged for stealing more than $250,000 with fake donation sites for political candidates, prosecutors said. In a years-long scheme, John Pierre Dupont pretended to raise money for Bernie Sanders, Beto O'Rourke, and othe…", "url": "https://www.businessinsider.com/conman-steals-250k-fake-bernie-sanders-beto-orourke-sites-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9270d101df72528523d1a2-1920-960.jpg", "publishedAt": "2019-03-20T16:56:58Z", "content": "An 80-year-old California conman has been charged for stealing more than $250,000 by setting up fake donation websites for prominent Democrats, the Department of Justice (DoJ) said on Tuesday. \r\n John Pierre Dupont pretended to raise money for presidential co… [+2731 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "GOP senators slam Trump after his days-long tirade against John McCain", "description": "President Trump went after the late Arizona Sen. John McCain again this week. Republicans have grown frustrated with Trump's repeated attacks on McCain, a war hero they revered. On the Democratic side, Senate Minority Leader Chuck Schumer has proposed renamin…", "url": "https://www.businessinsider.com/gop-senators-slam-trump-tirade-against-john-mccain-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c925c885dfa994d9a1c47ab-2732-1366.jpg", "publishedAt": "2019-03-20T16:56:06Z", "content": "WASHINGTON — President Donald Trump does not like John McCain, the longtime senator from Arizona, 2008 Republican presidential nominee, and Vietnam war hero. The president has criticized and insulted McCain on and off for years. \r\n Since Trump's ascent to the… [+2731 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "UBS' CEO warns this is 'one of the worst' markets in years (UBS)", "description": "UBS shares dropped 3% after the bank said it would slow hiring and slash costs by $300 million as it weathers \"one of the worst first-quarter environments\" in years. CEO Sergio Ermotti blamed declines in global wealth management and investment banking revenue…", "url": "https://markets.businessinsider.com/news/stocks/ubs-stock-price-revenue-down-weathers-one-of-worst-markets-in-years-2019-3-1028046347", "urlToImage": "https://images.markets.businessinsider.com/image/5c926a3f113a5048984455e5-2400/rtr3ddbo.jpg", "publishedAt": "2019-03-20T16:50:00Z", "content": "Michael Buholzer/Reuters\r\nUBS will slow its hiring and cut its costs by $300 million this year as it weathers \"one of the worst first-quarter environments in recent history\", CEO Sergio Ermotti told investors at a conference in London on Wednesday. \r\nCautious… [+1424 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Johnson", "title": "How to restart and force-restart any iPhone model", "description": "You may need to restart or force-restart your iPhone when it runs into software bugs that cause the phone to run slowly, its sound to stop working, or for any number of other inconveniences. Most iPhone glitches aren't permanent; you can generally solve unusu…", "url": "https://www.businessinsider.com/how-to-restart-iphone-7-8-x-xs-xr", "urlToImage": "https://amp.businessinsider.com/images/5c9268326123ca5120615ab2-2560-1280.jpg", "publishedAt": "2019-03-20T16:41:00Z", "content": "Like the old joke from the British sitcom \"The IT Crowd,\" you can solve almost any computer problem by \"turning it off and back on again.\" \r\n There's a lot of truth in that, and generally anytime you need to troubleshoot an issue with a computer - your iPhone… [+4128 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Akin Oyedele", "title": "Bank of America says these are the 3 triggers that should prompt investors to sell stocks immediately", "description": "A burst of inflows into equity exchange-traded funds last week was a sign that the lengthy bull market remains resilient, according to Bank of America Merrill Lynch. Although the flows were bullish, they were far from indicating the extreme sentiment that wou…", "url": "https://www.businessinsider.com/stock-market-investing-when-to-sell-and-turn-bearish-bank-of-america-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c08e50c0e2bf811f56eac76-1920-960.jpg", "publishedAt": "2019-03-20T16:40:07Z", "content": "For much of the first quarter, it seemed like many investors lacked confidence in the stock market's rally, judging from where they put their money. \r\n Investors pulled $46 billion out of equity funds this year through March 14, according to data compiled by … [+2840 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kelly McLaughlin", "title": "New Zealand's prime minister Jacinda Ardern has been applauded for her actions following the Christchurch mosque shootings. Here's everything you need to know about her.", "description": "New Zealand Prime Minister Jacinda Ardern was sworn into office in October 2017. She has been applauded for being an outspoken voice against sexism and racism during her time in office. In her response to the Christchurch mosque shootings, Ardern urged people…", "url": "https://www.businessinsider.com/new-zealand-prime-minister-jacinda-ardern-biography-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92661be0575a42390449d7-960-480.jpg", "publishedAt": "2019-03-20T16:35:20Z", "content": "When Ardern assumed office in October 2017, she became New Zealand's youngest leader in 150 years. \r\n Her platform focused on education reform, poverty, and mental healthcare, and she campaigned with \"relentless positivity,\" NPR reported at the time. \r\n Arder… [+692 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Joe Biden voted for the Iraq War, which started 16 years ago today, and his support could cause problems for his long-rumored 2020 presidential run", "description": "Former Vice President Joe Biden's voted in favor of the 2003 invasion of Iraq, which began 16 years ago on Wednesday. In the months leading up to the start of the conflict, Biden cited former Secretary of State Henry Kissinger to defend his stance, and conten…", "url": "https://www.businessinsider.com/joe-biden-iraq-war-vote-anniversary-2020-election-problem-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c925f905b066e4539740d19-1920-960.jpg", "publishedAt": "2019-03-20T16:28:50Z", "content": "Former Vice President Joe Biden's vote in favor of the 2003 invasion of Iraq, which began 16 years ago today, could cause the long-rumored presidential candidate problems during the 2020 Democratic primaries. \r\n Biden, a US senator for Delaware at the time, d… [+4013 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Here comes the Fed...", "description": "The Federal Reserve is widely expected to hold interest rates steady Wednesday. With forecasts for slower growth this year, focus will be on signals for future policy moves. Some expect the central bank's next policy move could be a rate cut. The Federal Rese…", "url": "https://www.businessinsider.com/federal-reserve-statement-interest-rate-decision-march-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c925db7401d583f7e398cce-2732-1366.jpg", "publishedAt": "2019-03-20T16:22:00Z", "content": "The Federal Reserve is widely expected to hold interest rates steady on Wednesday and to signal further that it could be awhile before another increase. \r\n Focus will be on whether the central bank changes its outlook for the economy. Officials last forecast … [+1511 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Here comes the Fed...", "description": "The Federal Reserve is widely expected to hold interest rates steady Wednesday. With forecasts for slower growth this year, focus will be on signals for future policy moves. Some expect the central bank's next policy move could be a rate cut. The Federal Rese…", "url": "http://markets.businessinsider.com/news/stocks/Here-comes-the-Fed-1028046266", "urlToImage": "https://images.markets.businessinsider.com/image/5c925d8e003f5c42bf1e8342-2400/ap19006605765810.jpg", "publishedAt": "2019-03-20T16:22:00Z", "content": "AP Photo/Susan Walsh, File\r\nThe Federal Reserve is widely expected to hold interest rates steady Wednesday.\r\nWith forecasts for slower growth this year, focus will be on signals for future policy moves.\r\nSome expect the central bank's next policy move could b… [+1776 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "You're going to need pretty strong internet to run Google's Netflix-like video game service", "description": "Google has a huge new gaming platform named Stadia, which will stream blockbuster games to nearly any device. Rather than relying on a traditional game console, Stadia runs in the cloud — games are streamed to your device, like Netflix does with movies and TV…", "url": "https://www.businessinsider.com/google-stadia-internet-speed-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c925dd069e11c62c93bfa34-2560-1280.jpg", "publishedAt": "2019-03-20T16:20:55Z", "content": "When Netflix transitioned from its original business of mailing customers physical DVDs and became a company primarily focused on streaming movies over the internet, customers had reservations. \r\n There were questions about the smaller library of content avai… [+3003 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Pete Buttigieg says 'disruption' of blue-collar industries has helped fuel white nationalism", "description": "Mayor Pete Buttigieg, a 2020 presidential candidate, argued that a rise in white nationalism in the US is tied to economic insecurity among many blue-collar workers. The Indiana Democrat said a new era of automation in US industries has destabilized the work-…", "url": "https://www.businessinsider.com/pete-buttigieg-blue-collar-jobs-white-nationalism-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9240f901df724a09371612-1136-568.jpg", "publishedAt": "2019-03-20T16:20:35Z", "content": "Mayor Pete Buttigieg of South Bend, Indiana, a 2020 presidential candidate, argued that a rise in white nationalism and domestic terrorism in the US is tied to economic insecurity and the transformation in blue collar industries in the US. \r\n \"As we see dislo… [+2771 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Amir Ismael", "title": "The best white sneakers you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-white-sneakers", "urlToImage": "https://amp.businessinsider.com/images/5c9252bb4f07ae54ce01be33-960-480.jpg", "publishedAt": "2019-03-20T16:20:00Z", "content": "Why you'll love them: As a hardwood-legend-turned-street-style-icon, the Nike Air Force 1 has plenty of crossover between sports and fashion. \r\n In 1982, Nike debuted the Air Force 1 as its premier basketball sneaker. The high-top silhouette featured everythi… [+2808 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Audrey Schomer", "title": "Instagram in-app purchases will boost ad sales and affiliate fees (FB, NKE, LVMUY, PVH, AMZN)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here. Instagram is rolling out a checkout button in the app that will …", "url": "https://www.businessinsider.com/instagram-in-app-checkout-button-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c5093db2bdd7f5e2b025c9b-1920-960.jpg", "publishedAt": "2019-03-20T16:19:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Instagram is rolling out a checkout button in the app that wil… [+3122 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nicholas Shields", "title": "Why Nvidia is broadening its AV portfolio (NVDA, TSLA, TM, VLVLY, AUDVF)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Transportation & Logistics Briefing subscribers. To receive the full story plus other insights each morning, click here. Graphics processor unit (GPU) designer Nvidia annou…", "url": "https://www.businessinsider.com/nvidia-expands-av-tech-footprint-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92586d4f07ae55db776434-2732-1366.jpg", "publishedAt": "2019-03-20T16:16:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Transportation &amp; Logistics Briefing subscribers. To receive the full story plus other insights each morning, click here. Graphics processor unit (GPU) designer Nvidia a… [+2016 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Scott Davis", "title": "Here is who the experts are picking to make the Final Four in March Madness", "description": "We looked over the brackets and picks of college basketball experts to get their predictions for the Final Four. This year's NCAA Tournament looks like top-heavy bracket, with most experts choosing No. 1 and No. 2 seeds to make the Final Four and win the whol…", "url": "https://www.businessinsider.com/expert-picks-march-madness-final-four-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9253da5dfa994c1f1c7ec6-1334-667.jpg", "publishedAt": "2019-03-20T16:15:04Z", "content": "While everyone likes to consider themselves college basketball experts by the time the NCAA Tournament rolls around, when filling out a bracket, sometimes it's best to look to those who truly are experts. \r\n With March Madness upon us, we surveyed the bracket… [+1907 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Meghan Morris", "title": "A do-good investing firm founded by Warren Buffett's grandson and ex-Gates executive just raised its first funding around from the world's richest families", "description": "Some of the world's wealthiest investors put up almost $15 million to back an investment firm focused on doing good and making money. i(x) was founded by Howard W. Buffett – Warren Buffett's grandson, who authored a book on social value investing – and by Tre…", "url": "https://www.businessinsider.com/ix-raises-15-million-for-a-705-million-valuation-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9253ac003f5c413f7eeaa2-2732-1366.jpg", "publishedAt": "2019-03-20T16:11:15Z", "content": "Some of the world's wealthiest investors are buying into the idea that capitalism will change the world for good - and they don't have to lose money in the process. \r\n i(x), an impact investing-focused firm launched in 2016 by Warren Buffett's grandson Howard… [+3134 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "You can wirelessly charge your AirPods without buying the new ones — you just need Apple's new $79 case", "description": "Apple launched a new wireless charging case for AirPods on Wednesday, which is compatible with both generations of the wireless earbuds. The case is priced at $79 and is available to order on Apple's website. It means AirPods owners will no longer have to tur…", "url": "https://www.businessinsider.com/apple-airpods-2-wireless-charging-case-works-with-older-airpods-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a9eb2cb5cc4101d008b463e-1920-960.jpg", "publishedAt": "2019-03-20T16:09:06Z", "content": "Apple refreshed its AirPods on Wednesday with a few new features, including support for hands-free Siri access, faster pairing with Apple devices, and the option to purchase Apple's earbuds with a new case that's compatible with wireless chargers. \r\n But you … [+1464 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "Jordan Peele's latest movie 'Us' is nothing like his breakout hit 'Get Out' — and that's a good thing", "description": "Jordan Peele's \"Us\" is the follow-up to his hit 2017 movie, \"Get Out.\" It's another creepy tale, but it's very different than his first movie. Along with Peele showing off his incredible writing talents, the movie's star Lupita Nyong’o gives a powerful perfor…", "url": "https://www.businessinsider.com/jordan-peele-us-movie-review-nothing-like-get-out-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9256fd003f5c419c0ea52d-1136-568.jpg", "publishedAt": "2019-03-20T15:57:16Z", "content": "Jordan Peele is in a tough spot. \r\n His directorial debut, \"Get Out,\" was not just a box-office hit that earned him a best original screenplay Oscar. It was also a movie that grabbed the cultural zeitgeist in the country. How the heck do you follow that up? \r… [+2769 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dan DeFrancesco", "title": "Wall Street's appetite for alternative data has turned into a gold rush, but investors say there's more dirt than nuggets", "description": "Investors speaking on a panel in New York on Tuesday said they struggle to find viable alternative data providers. Data sets often times don't meet their minimum requirements for usage. Investors said even the data that is up to par often times can't be integ…", "url": "https://www.businessinsider.com/wall-streets-appetite-for-alternative-data-has-turned-into-a-gold-rush-but-investors-say-theres-more-dirt-than-nuggets-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9169df01df723eaf515035-320-160.jpg", "publishedAt": "2019-03-20T15:55:18Z", "content": "Alternative data might be one of the hottest industries on Wall Street, but some investors say you're hard pressed to find viable options in the space. \r\n Data experts at quantitative hedge funds said while the alternative data field might be booming, with se… [+2810 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanya Dua", "title": "Ad agencies say consulting firms never actually produce work for clients. Here's how Accenture Interactive proved them wrong at SXSW this year.", "description": "Accenture Interactive had a sprawling showcase at SXSW last week to highlight all the work it is doing for brands, its most splashy presence at the festival yet. The company showed off a facial recognition-powered photo booth for Disney, an augmented reality …", "url": "https://www.businessinsider.com/accenture-interactive-proves-ad-agencies-wrong-with-brand-work-showcase-disney-and-dupont-at-sxsw-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9130e501df7234f25c3f42-1920-960.jpg", "publishedAt": "2019-03-20T15:55:07Z", "content": "Ad agencies often criticize consulting firms that are encroaching on their businesses by saying they don't produce any actual work for brands. Accenture Interactive clapped back at SXSW last week with a sprawling showcase spanning two floors of a downtown Aus… [+4249 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "A Royal Caribbean passenger is reportedly suing the company for $10 million after he broke his pelvis on a trampoline (RCL)", "description": "A Royal Caribbean Cruises passenger is suing the company after he broke his pelvis on a trampoline, according to a lawsuit filed on March 12. The defendant, Casey Holladay, is seeking $10 million in damages, the Miami Herald reports. Holladay allegedly suffer…", "url": "https://www.businessinsider.com/royal-caribbean-passenger-reportedly-sues-company-for-10-million-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9256c5401d583ea838b92f-1920-960.jpg", "publishedAt": "2019-03-20T15:43:28Z", "content": "A Royal Caribbean Cruises passenger is suing the company after he broke his pelvis on a trampoline, according to a lawsuit filed on March 12. \r\n The defendant, Casey Holladay, is seeking $10 million in damages, the Miami Herald reports. He is suing Royal Cari… [+1458 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Daniel Boan", "title": "Kylie Jenner put her twist on the underwear-as-outwear trend in a sheer $35 T-shirt dress", "description": "Kylie Jenner wore a sheer T-shirt dress in her latest Instagram post. The thermal T-shirt dress is by Sorella and currently retails for $35. She paired the sheer dress with a neon-green bra and underwear set, which added a touch of the underwear-as-outerwear …", "url": "https://www.businessinsider.com/kylie-jenner-sheer-t-shirt-dress-2019-3", "urlToImage": null, "publishedAt": "2019-03-20T15:37:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Emma Court", "title": "The treatment that cured 2 men of HIV may also help with a remarkable array of more than 70 deadly diseases", "description": "Bone marrow transplants have now seemingly cured a second man of HIV after he was being treated for an aggressive form of cancer. The treatment can be used for more than 70 different diseases, including many types of cancer, blood disorders, autoimmune diseas…", "url": "https://www.businessinsider.com/what-is-a-bone-marrow-transplant-and-how-does-it-work-hiv-cure-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c914d2a5dfa9938b1016735-2732-1366.jpg", "publishedAt": "2019-03-20T15:32:00Z", "content": "The second person ever appears to have been successfully cured of HIV, a viral infection that attacks the body's immune system and can worsen into the devastating disease AIDS. \r\n The treatment wasn't a new scientific technique or high-tech drug. Instead, the… [+4037 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Harrison Jacobs", "title": "After spending a month in Morocco, I can tell you the best part of the country isn't its cities", "description": "Tourism in Morocco is booming. The Majorelle Gardens in Marrakesh, a landscape garden designed and cultivated by French artist Jacques Majorelle and later bought and restored by designer Yves Saint Laurent, is considered the top tourist destination in all of …", "url": "https://www.businessinsider.com/morocco-travel-tip-what-to-see-best-part-of-country-landscape-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c925cab401d583f7e398cc5-1920-960.jpg", "publishedAt": "2019-03-20T15:32:00Z", "content": "Everyone, it seems, is going to Morocco these days. \r\n And why not? The country tops travel lists, is the subject of countless magazine features, has enough Instagrammable locations to fill a lengthy list, and sports cheap, short flights from most destination… [+2888 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "More than 70% of March Madness brackets have Duke going to the Final Four — here are the 15 most popular picks", "description": "March Madness is back! For those filling out brackets, you have until noon on Thursday to finalize your picks. Below we break down who the public is picking to reach the Final Four this year — spoiler alert: everyone loves Duke. Check out the rest of our Marc…", "url": "https://www.businessinsider.com/march-madness-predictions-final-four-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c924652401d583c79099c85-1536-768.jpg", "publishedAt": "2019-03-20T15:26:40Z", "content": "Last year more than 17 million brackets were submitted to ESPN, and this year will likely beat that total, with even more fans tuning in to see the likes of Zion Williamson and the Duke Blue Devils. \r\nAccording to ESPN, a whopping 70.4% of brackets submitted … [+409 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "George Paul", "title": "Qualcomm is untethering PC VR headsets — and pushing XR into the mainstream (QCOMM)", "description": "Qualcomm is ushering in a new category of extended reality (XR) headsets — “Boundless XR for PCs” — that negate the need for cables and tracking sensors. For context, Qualcomm includes VR, AR, and AI under the umbrella term XR. The company optimized its exist…", "url": "https://www.businessinsider.com/qualcomm-boundless-xr-headsets-eliminate-cables-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92391d5b066e3ee70ab747-640-320.png", "publishedAt": "2019-03-20T15:23:00Z", "content": "Qualcomm is ushering in a new category of extended reality (XR) headsets — \"Boundless XR for PCs\" — that negate the need for cables and tracking sensors. For context, Qualcomm includes VR, AR, and AI under the umbrella term XR. \r\nBusiness Insider Intelligence… [+1806 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Mayer", "title": "The best tinted sunscreen you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-tinted-sunscreen", "urlToImage": "https://amp.businessinsider.com/images/5c911b096123ca303a0de47b-960-480.jpg", "publishedAt": "2019-03-20T15:20:00Z", "content": "I'm diligent about wearing sunscreen but reapplying every two hours is not a thing, unless I'm at the beach. I never understand how I'm supposed to do that without screwing up my makeup. But the brand Colorscience offers a unique solution. \r\n The Sunforgettab… [+1183 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shana Lebowitz", "title": "Ex-Googlers, Stanford professors, and startup CEOs share their best advice on making a career change", "description": "Thinking about making a career change? Find out what these experts and executives have to say about quitting your job and searching for a new one. For example, don't change industry and function at the same time, and don't wait until you're doing bad work to …", "url": "https://www.businessinsider.com/career-change-advice-experts-executives-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b3166821ae6621e008b48cc-1920-960.jpg", "publishedAt": "2019-03-20T15:12:05Z", "content": "Blake is a career coach, a former Googler, and the author of \"Pivot: The Only Move That Matters Is Your Next One.\" \r\n She said the best way to make a career change is a four-step process: plant, scan, pilot, launch. \r\n First, you figure out what's currently w… [+595 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eleni Digalaki", "title": "UK fintechs might struggle to lure talent amid Brexit", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here. Brexit has raised concerns among financial services organizations over…", "url": "https://www.businessinsider.com/uk-fintech-talent-struggle-amid-brexit-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c925335401d583e4d0737ec-2732-1366.jpg", "publishedAt": "2019-03-20T15:11:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Brexit has raised concerns among financial services organizations ov… [+3718 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "23andMe can now tell you your risk of developing diabetes, based on your DNA. Here's what doctors want you to know.", "description": "23andMe released a new test that tells you about your risk for Type 2 diabetes, based on your DNA. About 30 million people in the US have diabetes ; the majority of those people have Type 2 diabetes. We asked doctors who specialize in diabetes care what users…", "url": "https://www.businessinsider.com/23andme-type-2-diabetes-risk-report-how-it-works-what-to-know-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5beb07980591f26bf43d7c9e-1920-960.jpg", "publishedAt": "2019-03-20T15:03:00Z", "content": "23andMe can now tell you if you're at an increased risk for developing a common condition in your lifetime. \r\n In March, the consumer genetics testing company released a new report that calculates an individual's risk of developing Type 2 diabetes, based on t… [+4067 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "AMD's CEO was at Google's big streaming video-game unveiling, and it may hint big plans for the future (AMD, GOOG)", "description": "AMD 's graphics processing unit was chosen to run Google's new streaming-video-game platform. The presence of AMD CEO Lisa Su at Tuesday's developer's conference could be a sign the two companies will work more closely in the future. Watch AMD trade live. AMD…", "url": "https://www.businessinsider.com/amd-stock-price-ceo-google-stadia-unveiling-hint-about-future-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a71d27a7e7a354f028b4bf8-1920-960.jpg", "publishedAt": "2019-03-20T14:58:00Z", "content": "AMD was the biggest winner on Tuesday, spiking 12%, after Google unveiled Stadia, its plan to upend the video-game industry. \r\n At its developer's conference on Tuesday, Google formally announced that it would use AMD's graphics processing units for its new c… [+1628 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "AMD's CEO was at Google's big streaming video-game unveiling, and it may hint big plans for the future (AMD, GOOG)", "description": "AMD 's graphics processing unit was chosen to run Google's new streaming-video-game platform. The presence of AMD CEO Lisa Su at Tuesday's developer's conference could be a sign the two companies will work more closely in the future. Watch AMD trade live. AMD…", "url": "https://markets.businessinsider.com/news/stocks/amd-stock-price-ceo-google-stadia-unveiling-hint-about-future-2019-3-1028045987", "urlToImage": "https://images.markets.businessinsider.com/image/5a71d2ee24d5051e008b47c0-1997/2798682528597ec63847ao.jpg", "publishedAt": "2019-03-20T14:58:00Z", "content": "AMD\r\nAMD's graphics processing unit was chosen to run Google's new streaming-video-game platform. \r\nThe presence of AMD CEO Lisa Su at Tuesday's developer's conference could be a sign the two companies will work more closely in the future. \r\nWatch AMD trade l… [+1881 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Slotnick", "title": "A look inside an exclusive AmEx cardmember event, where attendees enjoy luxury hotel accommodations and meals prepared by award-winning chefs", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen…", "url": "https://www.businessinsider.com/inside-look-of-american-express-experiences-cardmember-events", "urlToImage": "https://amp.businessinsider.com/images/5c3a3972bd77301bda64c953-2732-1366.jpg", "publishedAt": "2019-03-20T14:49:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. Business Insider may receive a commission from The Points Guy Affiliate Network, but our reporting and recommendations are always independen… [+3830 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Francesca Rea", "title": "9 commuter essentials to keep you dry on rainy days to and from work", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/commuter-products-for-rain", "urlToImage": "https://amp.businessinsider.com/images/5c91660869bdec32553dc8e6-750-375.jpg", "publishedAt": "2019-03-20T14:48:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1106 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Will Martin", "title": "A Danish MP was shamed and told she was 'unwanted' after bringing her five-month old baby to parliament", "description": "A Danish MP was told by a the Speaker in her parliament that she was \"unwanted\" after bringing her baby daughter into the chamber. Mette Abildgaard, an MP for Denmark's Conservative People's Party, brought the five-month year old to work after her childcare p…", "url": "https://www.businessinsider.com/denmark-mp-told-she-was-unwanted-after-bringing-baby-to-parliament-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9236f94f07ae4ffa672516-1920-960.jpg", "publishedAt": "2019-03-20T14:44:49Z", "content": "A Danish MP was told by the Speaker of Denmark's parliament that she was \"unwanted\" after bringing her baby daughter into the debating chamber. \r\n Mette Abildgaard, an MP for Denmark's Conservative People's Party, brought her five-month year to work because h… [+1938 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "The market has completely flipped its expectations for the Fed", "description": "Previously, market watchers had been anticipating two interest rate increases in 2019. But forecasts for growth have dimmed in major economies, including the US. Wall Street now sees a Federal Reserve rate cut as more likely for its next move. Market watchers…", "url": "https://www.businessinsider.com/federal-reserve-system-market-completely-flipped-expectations-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c924c0e6123ca4c5921f195-2732-1366.jpg", "publishedAt": "2019-03-20T14:37:00Z", "content": "Market watchers have long been anticipating a steady increase in borrowing costs. But as outlooks for the economy dim, they see an increasing possibility that the Federal Reserve could actually lower interest rates in its next policy move. \r\n Expectations for… [+2063 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "The market has completely flipped its expectations for the Fed", "description": "Previously, market watchers had been anticipating two interest rate increases in 2019. But forecasts for growth have dimmed in major economies, including the US. Wall Street now sees a Federal Reserve rate cut as more likely for its next move. Market watchers…", "url": "https://markets.businessinsider.com/news/stocks/federal-reserve-system-market-completely-flipped-expectations-2019-3-1028045917", "urlToImage": "https://images.markets.businessinsider.com/image/5bfefb8d101142567737f7f3-2400/ap18332652028488.jpg", "publishedAt": "2019-03-20T14:37:00Z", "content": "Previously, market watchers had been anticipating two interest rate increases in 2019.\r\nBut forecasts for growth have dimmed in major economies, including the US. \r\nWall Street now sees a Federal Reserve rate cut as more likely for its next move.\r\nMarket watc… [+2298 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "A 'warrior’s warrior’: Here's why insiders say the first-time CFO running Lyft’s $20 billion IPO is the perfect fit (LYFT)", "description": "Brian Roberts, who joined Lyft as chief financial officer in 2014, had no previous experience as a CFO. Instead, the 50-year-old brought a wealth of tech, retail, and financial knowledge acquired at Microsoft, Walmart, and two banks. He's playing a lead role …", "url": "https://www.businessinsider.com/lyft-cfo-brian-roberts-brings-banking-retail-experience-to-ipo-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c914c42e0575a2d340242d6-2732-1366.jpg", "publishedAt": "2019-03-20T14:30:00Z", "content": "Lyft had never had a chief financial officer before hiring Brian Roberts from Walmart in 2014. \r\n And Roberts, for all his experience in consumer retail and banking, had never been a CFO before. \r\n But now, with Roberts now in the ride-hailing company's C-Sui… [+4747 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ryan Pickrell", "title": "US Navy's carrier-based F-35C stealth fighters may not be ready for combat after all", "description": "The US Navy declared its carrier-capable F-35C Lightning II Joint Strike Fighters combat-ready last month, but an alarming new report concludes the jets are nowhere close. The Project on Government Oversight, citing Pentagon and Navy documents, says that the …", "url": "https://www.businessinsider.com/us-navys-f-35cs-may-not-be-ready-for-combat-after-all-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9244d56123ca4b094bf853-960-480.jpg", "publishedAt": "2019-03-20T14:21:10Z", "content": "The US Navy has declared its F-35Cs ready for combat — stealth fighters designed to take off and land on aircraft carriers — but the service's own testing data says these fighters are nowhere close to ready, an independent non-partisan watchdog reports. \r\n \"T… [+3188 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Abby Jackson", "title": "Former Oath and AOL CEO Tim Armstrong is getting a $60 million payout", "description": "Former AOL CEO Tim Armstrong is getting a $60 million payout package from Verizon. The so-called golden parachute follows Armstrong's departure from the company in October, and comes after Verizon wrote down about about half of Oath's $9 billion value. The in…", "url": "https://www.businessinsider.com/former-oath-ceo-tim-armstrong-is-getting-a-60-million-payout-package-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c923e494f07ae50d116b174-2560-1280.jpg", "publishedAt": "2019-03-20T14:13:29Z", "content": "Tim Armstrong, the former CEO of AOL and later Verizon's media and advertising business, Oath, is getting a $60 million payout package from Verizon, The Wall Street Journal reported on Tuesday.\r\n The so-called golden parachute follows Armstrong's departure fr… [+1641 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Johnson", "title": "How to hide apps on your iPhone's home screen and search function", "description": "Apple doesn't provide an official way to hide apps, but you can store iPhone apps you want to hide in a folder, shielding it from view. iPhone folders support many \"pages\" of apps, so you can store \"private\" apps on back pages in a folder. You can also config…", "url": "https://www.businessinsider.com/how-to-hide-apps-on-iphone", "urlToImage": "https://amp.businessinsider.com/images/5c924483003f5c3ead1473da-2560-1280.jpg", "publishedAt": "2019-03-20T14:12:00Z", "content": "Apple makes it easy to manage the apps on your iPhone. You can reorganize your apps onto different pages and folders, and outright delete the ones you never use (except for a handful of built-in apps that are an essential part of the operating system). \r\n Unf… [+3607 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "New Zealand's prime minister calls for a global fight against racism and an end to scapegoating immigrants after mass shooting", "description": "New Zealand Prime Minister Jacinda Ardern says there needs to be a global campaign against racism after a mass shooting at two mosques in Christchurch. The alleged shooter wrote a 74-page manifesto espousing white nationalist beliefs. \"What New Zealand experi…", "url": "https://www.businessinsider.com/new-zealand-pm-jacinda-ardern-global-anti-racism-fight-shooting-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9247a069e11c5ed57752c2-2732-1366.jpg", "publishedAt": "2019-03-20T14:11:36Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "The best double strollers you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-double-stroller", "urlToImage": "https://amp.businessinsider.com/images/5c881d5101df72002e5b6e84-1536-768.jpg", "publishedAt": "2019-03-20T14:00:00Z", "content": "Why you'll love it: The Bugaboo Donkey2 Complete Stroller can be configured to carry two bassinets, two forward- or rear-facing seats, or it can be collapsed down to a single child stroller. \r\n Two things to note here: First, I own a Bugaboo Donkey stroller a… [+2095 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Zoë LaRock", "title": "Study shows Apple Watch might not live up to the hype (AAPL)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Health Briefing subscribers. To receive the full story plus other insights each morning, click here. The r esults are in from Stanford University’s Apple Heart Stud…", "url": "https://www.businessinsider.com/stanford-apple-heart-study-results-question-apple-watch-accuracy-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c924645401d583c7c5792a3-640-320.jpg", "publishedAt": "2019-03-20T13:59:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Health Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n The results are in from Stanford University's Apple Heart Stu… [+3906 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marissa Perino", "title": "San Francisco isn't one of the world's most expensive cities, despite everyone complaining how expensive it is. But 2 major US cities are", "description": "The Economist Intelligence Unit recently released its latest Worldwide Cost of Living index, which ranks the most expensive cities around the globe. This year, American cities New York and Los Angeles made the list. While neither made the cut in 2018, both ha…", "url": "https://www.businessinsider.com/most-expensive-cities-in-america-world-ranking-nyc-la-san-francisco-2019-3", "urlToImage": "https://amp.businessinsider.com/images/582d2f0dba6eb6b1018b4c91-1136-568.jpg", "publishedAt": "2019-03-20T13:59:00Z", "content": "New York City and Los Angeles are once again ranked among the world's most expensive cities. \r\n The two US cities are the only two North American locations to make this year's list, released by the Economist Intelligence Unit. The No. 1 spot this year is shar… [+2274 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Áine Cain", "title": "We taste-tested 7 of Costco's Kirkland wines and were blown away by their price and quality. Here's how they ranked from worst to best. (COST)", "description": "Costco sells a number of wines under its private label Kirkland. Business Insider's retail desk recently did a wine tasting with a number of these Costco wines. Here's what we thought of Kirkland's selections. Costco is known for its quality wine selection. B…", "url": "https://www.businessinsider.com/costco-kirkland-wine-review-taste-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c916435daa50732bd703c53-1920-960.jpg", "publishedAt": "2019-03-20T13:53:17Z", "content": "I'm a sucker for oaky, fruity red wines, and this Malbec was just the ticket. \r\n But I'm not alone. Most of us at the tasting actually picked out the Kirkland Malbec as the top wine. For just $6.99, you're getting a complex, satisfying, and juicy, wine. \r\n My… [+773 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dakin Campbell", "title": "A startup that scrapes the web just raised money from Visa's former CEO in a sign of the growing importance of the $2 billion industry", "description": "Alternative data startup Thinknum raised $12 million in a series A round from investors including Green Visor Capital, which counts ex-Visa CEO Joe Saunders as a partner. Thinknum scrapes websites, or extracts information using an automated software program, …", "url": "https://www.businessinsider.com/web-scraping-startup-raises-money-from-ex-ceo-visa-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c921c2569e11c59b3219662-2732-1366.jpg", "publishedAt": "2019-03-20T13:40:00Z", "content": "Alternative data has started to pay. \r\n That's one conclusion to take from today's news that alternative data startup Thinknum had raised $11.6 million in a series A round from investors including Green Visor Capital, according to a statement. Joe Saunders, t… [+3157 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Green", "title": "Chase has introduced a low-cost account (JPM)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Payments Briefing subscribers. To receive the full story plus other insights each morning, click here. JPMorgan Chase began offering a low-cost account, called Secure, that…", "url": "https://www.businessinsider.com/chase-secure-low-cost-account-2019-3", "urlToImage": "https://amp.businessinsider.com/images/545135696bb3f79b37dea9a7-750-375.jpg", "publishedAt": "2019-03-20T13:39:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Payments Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n JPMorgan Chase began offering a low-cost account, called Secure, th… [+2850 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Smith", "title": "THE APPLE STORE WORLD TOUR: From Albuquerque to Zurich, here's a look at every Apple Store across the globe (AAPL)", "description": "To understand Apple's global retail footprint, it helps to see it for yourself. We've compiled a list of every Apple store in the world. Jump to your favorite country or state via the table of contents, or scroll down to see every store alphabetically. It's h…", "url": "https://www.businessinsider.com/every-apple-store-in-the-world-full-list-photos-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c8c07ab5b066e5df962fa0f-750.jpg", "publishedAt": "2019-03-20T13:38:31Z", "content": "It's hard to believe Apple was started out of a garage in California just over 40 years ago. Today, Apple is worth hundreds of billions of dollars and has over 500 stores in 24 countries around the world. \r\n Apple stores weren't even a \"thing\" until 2001. Tha… [+2650 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "The first trailer of Quentin Tarantino's new movie starring Leonardo DiCaprio and Brad Pitt is out, and we can't wait to see more", "description": "Here is the first tease of Quentin Tarantino's new movie, \"Once Upon a Time in... Hollywood.\" It stars Leonardo DiCaprio, Brad Pitt, Margot Robbie, and someone giving a great Bruce Lee impersonation. The movie opens in July. It's finally here! The first foota…", "url": "https://www.businessinsider.com/quentin-tarantino-once-upon-a-time-in-hollywood-teaser-trailer-watch-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c923af4401d583a0364d5ae-960-480.jpg", "publishedAt": "2019-03-20T13:35:46Z", "content": "It's finally here! \r\n The first footage of Quentin Tarantino's ninth movie, \"Once Upon a Time in... Hollywood,\" has gone online and it certainly has us excited. \r\n Though the early talk on the movie — which stars Leonardo DiCaprio, Brad Pitt, and Margot Robbi… [+985 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Charlie Wood", "title": "State AGs put tech giants on notice: 'Something must be done with these companies... they have become too big'", "description": "The attorney general for Louisiana, Jeff Landry, has described a growing unease among US attorneys general about the power of tech companies like Google, Facebook, and Amazon. Landry told SiriusXM's \"Breitbart News Daily\" show that \"all actions\" are being con…", "url": "https://www.businessinsider.com/jeff-landry-state-attorneys-general-want-to-curb-power-of-big-tech-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92323b4f07ae4f9d297da4-2732-1366.jpg", "publishedAt": "2019-03-20T13:18:19Z", "content": "A US attorney general has said \"all actions\" are on the table when it comes to curbing the power of tech giants like Google, Facebook, and Amazon. \r\n Speaking to SiriusXM's \"Breitbart News Daily\" radio show, Jeff Landry, the attorney general for Louisiana, de… [+2924 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Laura McCamy", "title": "San Francisco's new public trains are clean, spacious and surprisingly quiet — here's what it's like to ride one", "description": "The San Francisco region's Bay Area Rapid Transit system rolled out the first 10 trains of its \"Fleet of the Future\" last year. The new trains will eventually completely replace the noisy, aging trains currently serving the Bay Area, many of which have been a…", "url": "https://www.businessinsider.com/san-francisco-new-bart-trains-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c916633113a503678521483-2732-1366.jpg", "publishedAt": "2019-03-20T13:14:00Z", "content": "I first arrived in the San Francisco Bay Area in 1987. At the time, public Bay Area Rapid Transit trains were the pleasant and speedy way to get from my home in Noe Valley to the Financial District. \r\n The seats were cushy and fabric-covered, the cars were ca… [+1326 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Greg Magana", "title": "Amazon rules the product search process (AMZN)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here. Online shoppers are relying heavily on Amazon throughout the shoppi…", "url": "https://www.businessinsider.com/online-shoppers-rely-heavily-on-amazon-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c23b7ffbd77302b0232fc34-2732-1366.jpg", "publishedAt": "2019-03-20T13:13:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Online shoppers are relying heavily on Amazon throughout the shop… [+3096 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lauren Johnson", "title": "Ad-tech companies are moving full speed ahead to chase OTT ad dollars. Here are the 13 companies poised to win the most.", "description": "A growing number of ad-tech companies are moving into over-the-top advertising as ad dollars shift from TV to streaming video. While ad-tech companies are clamoring to get a share of the OTT ad market that's coming from the $70 billion in TV advertising, not …", "url": "https://www.businessinsider.com/top-ad-tech-ott-companies-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90063c69bdec10283f4017-1136-568.jpg", "publishedAt": "2019-03-20T13:12:57Z", "content": "More people are cutting the cord and advertisers clamoring to use data to target and measure video campaigns, but the $70 billion TV advertising industry has operated the same way it has for decades. \r\n Ad-tech firms say that it's ripe for disruption, and a c… [+3385 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "Trump attacks senior adviser Kellyanne Conway’s 'stone cold LOSER & husband from hell!'", "description": "President Trump went after George Conway, the husband of White House Counselor Kellyanne Conway, calling him a loser and \"husband from hell!\" Conway regularly posts on Twitter descriptions of mental disorders in reference to the president, despite his wife's …", "url": "https://www.businessinsider.com/trump-tweet-attacks-george-conway-kellyanne-conway-husband-from-hell-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92324969bdec3bca728532-1334-667.jpg", "publishedAt": "2019-03-20T13:11:19Z", "content": "President Donald Trump attacked the husband of his senior counselor at the White House, Kellyanne Conway, on Wednesday as a \"stone cold LOSER\" and fired off a barrage of other insults. \r\n George Conway, a lawyer and frequent critic of Trump, routinely posts c… [+1440 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "Starbucks is reimagining the core belief that turned the chain into a $88 billion juggernaut", "description": "Starbucks is reimagining the \"third place,\" a concept concerned with the importance of connection that has long been the cornerstone of the coffee giant's business. The company is investing in drive-thru and delivery, as well as new technology — methods that …", "url": "https://www.businessinsider.com/starbucks-reimagine-third-place-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c1d18ee404f4d419558a282-1920-960.jpg", "publishedAt": "2019-03-20T13:03:00Z", "content": "Starbucks is about to enter an era of change, in which the coffee giant reexamines a belief that has been the cornerstone of its success. \r\n On Wednesday, Starbucks announced plans to \"reimagine\" the third place, a concept that has long been the chain's guidi… [+2086 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Ciolli", "title": "A Wall Street strategist who called the last stock plunge says investors are foolishly ignoring one thriving corner of the market", "description": "Large- and small-cap stocks capture all the attention in the market, but one market expert says there's an overlooked middle class that's been thriving. Ed Clissold — the chief US equity strategist at Ned Davis who successfully predicted the December stock me…", "url": "https://www.businessinsider.com/stock-market-trading-investing-recommendations-mid-caps-ed-clissold-ned-davis-research-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9238874f07ae50055d94fc-1920-960.jpg", "publishedAt": "2019-03-20T13:02:46Z", "content": "When it comes to stock market analysis, the market's biggest companies are often pitted against the smallest. \r\n For example, when the US-China trade war first started rearing its angry head, the prevailing narrative was that more domestically focused small-c… [+2368 chars]"}]}