{"status": "ok", "totalResults": 3613, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Boeing slides after authorities say Ethiopian Airlines and Lion Air crashes have 'clear similarities' (BA)", "description": "The March 10 Ethiopian Airlines crash that killed all 157 people on board has parallels to the October Lion Air crash of the same Boeing model that killed 189 people, according to Ethiopia's transport minister. The two crashes have resulted in the worldwide g…", "url": "https://www.businessinsider.com/boeing-stock-price-ethiopian-airlines-lion-air-crashes-similar-2019-3", "urlToImage": "https://images.markets.businessinsider.com/image/5c8f9e014f07ae0bd44dc263-2400/2016-07-27t120000z1675375504s1betryfkfaartrmadp3malaysia-airlines-orders.jpg", "publishedAt": "2019-03-18T14:43:00Z", "content": "The March 10 Ethiopian Airlines crash that killed all 157 people on board has parallels to the October Lion Air crash of the same Boeing model that killed 189 people, according to Ethiopia's transport minister.\r\nThe two crashes have resulted in the worldwide … [+1732 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hayley Peterson", "title": "Walmart says it's killing a popular price-matching tool because it already offers the lowest prices — and outraged customers are accusing the company of lying (WMT)", "description": "Walmart is ending Savings Catcher, a popular price-matching tool that automatically refunded customers for any price differences between Walmart and its competitors. In an email to shoppers, Walmart said it's ending the program because it already offers the l…", "url": "https://www.businessinsider.com/walmart-savings-catcher-price-match-tool-2019-3", "urlToImage": "https://amp.businessinsider.com/images/56327bda9dd7cc25008c5d69-2732-1366.jpg", "publishedAt": "2019-03-18T14:40:36Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "These $12 pant hangers save me a ton of space in my tiny closet — each one holds at least 5 pairs", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/pant-hanger-space-saving-closet-hack-whitmor-swing-arm-slack-hanger-review", "urlToImage": "https://amp.businessinsider.com/images/5c8bd5ed113a50561e1445db-750-375.jpg", "publishedAt": "2019-03-18T14:38:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+2961 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Brodwin", "title": "24 easy habits that psychologists have linked with health and happiness", "description": "There science-linked ways to be happier and healthier. And they're not so hard to do. Jotting down your feelings and star gazing are easy ways to lift your spirits. Here are 22 other easy ways to boost your mood that psychologists and social scientists swear …", "url": "https://www.businessinsider.com/science-backed-things-that-make-you-happier-2015-6", "urlToImage": "https://amp.businessinsider.com/images/5c8fac7869bdec7ff7714dd5-1920-960.jpg", "publishedAt": "2019-03-18T14:34:00Z", "content": "If living in a big city has you feeling a bit down, there's good news: A brief walk in nature could be all it takes to chase away those negative thoughts. \r\n At least that's the finding of a new study published last month. \r\n In the study, a group of 38 North… [+642 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mekebeb Tesfaye", "title": "Financial service consumers are willing to share their personal data for benefits and discounts (ACN)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here. Despite concerns around the privacy of their data, 60% of consumers wo…", "url": "https://www.businessinsider.com/financial-service-consumers-share-personal-data-for-benefits-discounts-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a2eca8d8a4986b0008b51ec-960-480.jpg", "publishedAt": "2019-03-18T14:28:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Despite concerns around the privacy of their data, 60% of consumers … [+3663 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "'Ridiculous!': Donald Trump says the 'Fake News media' is 'working overtime' to blame him for New Zealand mosque shooting", "description": "President Donald Trump on Monday said the \"Fake News Media\" is \"working overtime\" to blame him for a mass shooting at two mosques in New Zealand last week. The alleged shooter praised Trump in a manifesto. Trump has faced criticism for not expressing more con…", "url": "https://www.businessinsider.com/trump-says-fake-news-media-blames-him-for-new-zealand-shooting-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fa637124d0402407fec9a-2732-1366.jpg", "publishedAt": "2019-03-18T14:23:43Z", "content": "President Donald Trump on Monday said the \"Fake News Media\" is \"working overtime\" to blame him for a mass shooting in Christchurch, New Zealand that saw dozens of people killed or wounded at two mosques. \r\n \"The Fake News Media is working overtime to blame me… [+2243 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "The inventor of Jelly Belly has launched cannabis-infused jelly beans", "description": "Jelly Belly's inventor, David Klein, is getting into the cannabis business. Klein recently launched a CBD-infused jelly bean business called Spectrum Confections. While Jelly Belly itself is not connected to the venture, cannabis-infused candies are on the cu…", "url": "https://www.businessinsider.com/jelly-belly-inventor-cbd-infused-jelly-beans-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f9c755b066e01bb14229a-2732-1366.jpg", "publishedAt": "2019-03-18T14:19:03Z", "content": "The inventor of Jelly Belly has a trendy new jelly bean creation. \r\n David Klein — who invented Jelly Belly in 1976 — recently launched a CBD-infused jelly bean brand called Spectrum Confections. The candy comes in 38 flavors, including roasted marshmallow, p… [+1056 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "George Paul", "title": "Why Huawei's Android backup would flop", "description": "Huawei has built its own proprietary smartphone operating system that can be used as a backup in case it’s barred from using Android, Huawei’s mobile chief Richard Yu Chengdong confirmed in an interview cited by South China Morning Post. Huawei’s smartphones …", "url": "https://www.businessinsider.com/huawei-android-backup-operating-system-would-fail-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f987569e11c1228444752-2732-1366.jpg", "publishedAt": "2019-03-18T14:08:54Z", "content": "Huawei has built its own proprietary smartphone operating system that can be used as a backup in case it's barred from using Android, Huawei's mobile chief Richard Yu Chengdong confirmed in an interview cited by South China Morning Post. \r\nBusiness Insider In… [+2192 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson", "title": "Roger Federer threw away a first set lead to lose the Indian Wells men's title to Dominic Thiem, but said after that he lost to the better ma-", "description": "Roger Federer threw away a first set lead to lose the Indian Wells Masters final to Dominic Thiem on Sunday. Thiem produced a nerveless comeback to win the second and third sets thanks to pin-point accuracy, point-clinching backhands, and incredible crosscour…", "url": "https://www.businessinsider.com/roger-federer-lost-to-the-better-man-dominic-thiem-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f8dd8daa5077c9d1e30c7-1920-960.jpg", "publishedAt": "2019-03-18T14:06:45Z", "content": "Roger Federer threw away a first set lead to lose the BNP Paribas Open title to Dominic Thiem, a man he later admitted was simply better on the day. \r\n Federer enjoyed a remarkable start at the Indian Wells Masters final on Sunday, coasting to an early 3-0 le… [+2233 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "The best USB-C hubs you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-usb-c-hub", "urlToImage": "https://amp.businessinsider.com/images/5b3e665e39a28723008b491e-750-375.jpg", "publishedAt": "2019-03-18T14:00:00Z", "content": "Why you'll love it: The Satechi Aluminum Multi-Port Adapter V2 is well-designed, supports pass-through charging, and has a large variety of ports. \r\n If you're looking for a great USB-C hub and want one of the best out there, then the Satechi Aluminum Multi-P… [+1408 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Prada's profits sank after Paris riots, trade, and growth fears hit Chinese demand", "description": "Prada's shares slumped 11% after the luxury brand posted lower earnings for the fourth year in a row. Its challenges included the US-China trade war, protests in France, a \"blackface\" scandal, and slowing growth in China. Prada's shares slumped 11% on Monday …", "url": "https://www.businessinsider.com/pradas-profits-sank-after-riots-trade-and-fear-hit-chinese-demand-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8fa348e0575a7ee57819d7-750-375.jpg", "publishedAt": "2019-03-18T13:59:20Z", "content": "Prada's shares slumped 11% on Monday after the Italian fashion house posted its fourth full-year earnings decline in four years. \r\n The Hong-Kong listed group's operating profits shrunk by a tenth to 323 million ($366 million) in 2018. Sales in China flatline… [+1596 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Prada's profits sank after Paris riots, trade, and growth fears hit Chinese demand", "description": "Prada's shares slumped 11% after the luxury brand posted lower earnings for the fourth year in a row. Its challenges included the US-China trade war, protests in France, a \"blackface\" scandal, and slowing growth in China. Prada's shares slumped 11% on Monday …", "url": "https://markets.businessinsider.com/news/stocks/pradas-profits-sank-after-riots-trade-and-fear-hit-chinese-demand-2019-3-1028038302", "urlToImage": "https://images.markets.businessinsider.com/image/5c8fa2ad5dfa9905f5614874-2400/rtr1h693.jpg", "publishedAt": "2019-03-18T13:59:20Z", "content": "REUTERS/Eduardo Munoz\r\nPrada's shares slumped 11% on Monday after the Italian fashion house posted its fourth full-year earnings decline in four years.\r\nThe Hong-Kong listed group's operating profits shrunk by a tenth to €323 million ($366 million) in 2018. S… [+1606 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Greg Magana", "title": "Amazon is testing mobile pop-up ads on its rivals' listings", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here. Amazon recently tested a feature in its mobile app that showed pop-…", "url": "https://www.businessinsider.com/amazon-promoting-private-labels-under-competitor-listings-2019-3", "urlToImage": "https://amp.businessinsider.com/images/58878d03ee14b61c008b98ab-1920-960.jpg", "publishedAt": "2019-03-18T13:59:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Amazon recently tested a feature in its mobile app that showed po… [+3315 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Johnson", "title": "How to move and create folders for apps on any iPhone model", "description": "You can easily move apps to organize them on different pages of your iPhone or into folders, once you master getting your iPhone into \"jiggle mode.\" Lightly press an app for about 3 seconds until it starts to jiggle – then you can move apps around your iPhone…", "url": "https://www.businessinsider.com/how-to-move-apps-on-iphone", "urlToImage": "https://amp.businessinsider.com/images/5c8f9f4c01df72084a372103-960-480.jpg", "publishedAt": "2019-03-18T13:56:00Z", "content": "You spend a lot of time using your iPhone, so it pays to organize your apps. \r\n Rather than flipping through page after page of disorganized icons, you can store all of your social media apps in one folder and your games in another. Or divide your apps into p… [+3982 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "Beto O'Rourke announces massive $6.1 million fundraising haul in first day of campaign, dwarfing the rest of the 2020 field", "description": "Democratic presidential candidate Beto O'Rourke raised over $6.1 million in the first 24 hours of his campaign, he announced Monday. The fundraising surpasses all of the other Democratic candidates' first day hauls. By raising massive amounts of money, O'Rour…", "url": "https://www.businessinsider.com/beto-orourke-fundraising-first-campaign-day-tops-bernie-sanders-democrats-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f9ca55dfa99053a68e903-2732-1366.jpg", "publishedAt": "2019-03-18T13:54:17Z", "content": "Democratic presidential candidate Beto O'Rourke announced a $6,136,763 fundraising haul in the first 24 hours of his campaign, topping the rest of the 2020 field. \r\n \"In just 24 hours, Americans across this country came together to prove that it is possible t… [+1854 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "The Stanford professor who rejected one of Elizabeth Holmes’s early ideas explains what it was like to watch the rise and fall of Theranos", "description": "Dr. Phyllis Gardner, a Stanford Medical School professor, was one of the earliest people to be skeptical of Theranos founder Elizabeth Holmes. Gardner had rejected one of Holmes' early ideas for a patch that could deploy antibiotics. Gardner has followed alon…", "url": "https://www.businessinsider.com/stanford-professor-phyllis-gardner-on-theranos-and-elizabeth-holmes-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c0af05b066e5dfe00464d-1136-568.jpg", "publishedAt": "2019-03-18T13:50:00Z", "content": "Stanford Medical School professor Dr. Phyllis Gardner was used to being approached by entrepreneurial students looking to make a dent in the biotech world. \r\n So when Elizabeth Holmes approached her after she arrived at Stanford in 2002 with an idea to build … [+4673 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Brodwin", "title": "There's growing evidence that eating fat won't make you fat, but sugar will", "description": "In the World Cup of food wars, sugar and fat are the playoff teams. Emerging science suggests that when eaten on its own, fat does not contribute to weight gain. Sugar, however, does. Increasingly alarmed by the sugar in our diets, scientists recommend cuttin…", "url": "https://www.businessinsider.com/eating-fat-wont-make-you-fat-sugar-will-2018-7", "urlToImage": "https://amp.businessinsider.com/images/59db7bed92406c35008b4c57-1136-568.jpg", "publishedAt": "2019-03-18T13:43:00Z", "content": "In the World Cup of food wars, sugar and fat are the playoff teams. \r\n It makes intuitive sense that rich foods like creamy avocados or butter-drenched salmon would contribute to weight gain. Similarly, stacking up on sweet treats like sugary cereals and carb… [+4531 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Arjun Reddy and Ethel Jiang", "title": "MORGAN STANLEY: These 9 stocks are going to be winners over the long run", "description": "Morgan Stanley highlights the stocks you want to own even if markets head for a slowdown. The firm highlights companies based on enduring competitive advantages, not just valuation. Business Insider has highlighted Morgan Stanley's top stock pick for each ind…", "url": "https://www.businessinsider.com/stock-picks-winners-in-each-sector-morgan-stanley-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f978469bdec7d235fe183-2732-1366.jpg", "publishedAt": "2019-03-18T13:42:00Z", "content": "Morgan Stanley thinks the longest bull market in history may be coming to a close, and that stock-picking is going to become more important if markets head for a slowdown. \r\n To help investors make better decisions, the firm highlighted a list of stocks that … [+440 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Green", "title": "US sanctions could shut Mastercard and Visa out of Venezuela (V, MA)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Payments Briefing subscribers. To receive the full story plus other insights each morning, click here. Financial sanctions that the US might impose on Venezuela could restr…", "url": "https://www.businessinsider.com/us-venezuela-sanctions-could-block-mastercard-visa-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c5212ae2bdd7f0c3b032c17-1920-960.jpg", "publishedAt": "2019-03-18T13:24:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Payments Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Financial sanctions that the US might impose on Venezuela could res… [+2901 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Netflix's biggest bull and bear agree on one thing about its key growth measure during an economic slowdown (NFLX)", "description": "The biggest Netflix bull and bear on Wall Street can find plenty to disagree on. But there's some commonality in how they view the platform's future subscriber growth. Watch Netflix trade live. Investing in the world's largest online-subscription video platfo…", "url": "https://markets.businessinsider.com/news/stocks/netflix-stock-price-biggest-bull-bear-weigh-in-on-subscriber-growth-2019-3-1028037971", "urlToImage": "https://images.markets.businessinsider.com/image/5bd35a7acd6f383d601cee77-1024/gettyimages-948027478.jpg", "publishedAt": "2019-03-18T13:07:00Z", "content": "Ernesto S. Ruscio/Getty Images for Netflix\r\nThe biggest Netflix bull and bear on Wall Street can find plenty to disagree on. \r\nBut there's some commonality in how they view the platform's future subscriber growth.\r\nWatch Netflix trade live.\r\nInvesting in the … [+2957 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Netflix's biggest bull and bear agree on one thing about its key growth measure during an economic slowdown (NFLX)", "description": "The biggest Netflix bull and bear on Wall Street can find plenty to disagree on. But there's some commonality in how they view the platform's future subscriber growth. Watch Netflix trade live. Investing in the world's largest online-subscription video platfo…", "url": "https://www.businessinsider.com/netflix-stock-price-biggest-bull-bear-weigh-in-on-subscriber-growth-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c0173124d045d627bb0f2-960-480.jpg", "publishedAt": "2019-03-18T13:07:00Z", "content": "Investing in the world's largest online-subscription video platform can be an inherently polarizing discussion. \r\nNetflix bulls and bears tend to disagree on whether the stock's valuation is justified, if the company is too quickly burning through cash, and i… [+2753 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bill Bostock", "title": "The Saudi hit squad linked to the Khashoggi murder reportedly asked for a performance-related bonus for torturing and kidnapping so many people", "description": "The Saudi hit squad believed to have killed journalist Jamal Khashoggi reportedly asked for a bonus as they had been so busy torturing and kidnapping state dissidents. The \"Saudi Rapid Intervention Group\" was set up in 2017 by Crown Prince Mohammed bin Salman…", "url": "https://www.businessinsider.com/saudi-hit-squad-khashoggi-death-reportedly-asked-for-bonus-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c373508e04d6269921b16d3-960-480.jpg", "publishedAt": "2019-03-18T13:06:57Z", "content": "The elite Saudi hit squad believed to be involved in the death of journalist Jamal Khashoggi reportedly asked the country's Crown Prince for a bonus because they had tortured and kidnapped so many people. \r\n The squad, reportedly dubbed the \"Saudi Rapid Inter… [+1768 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "MoviePass is bringing back an unlimited plan, but there's a catch", "description": "MoviePass will bring back a $9.95-per-month unlimited plan in the coming days, a source with knowledge of the decision told Business Insider. But the unlimited plan will have restrictions on those with \"excessive individual usage.\" This comes on the heels of …", "url": "https://www.businessinsider.com/moviepass-bringing-back-unlimited-plan-details-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f075fe0575a777f1c24c3-1136-568.jpg", "publishedAt": "2019-03-18T12:59:42Z", "content": "MoviePass is bringing back an unlimited plan. \r\n Despite the recent exodus of executives and managers at the company, the movie-ticket subscription service has been working hard behind the scenes to bring back a plan similar to the one that got it so many sub… [+3005 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "Apple just surprised everyone with major updates to the iPad Air and iPad Mini", "description": "Apple announced major updates to the iPad Air and iPad Mini lines on Monday morning. Both devices are getting updated internals. Perhaps most significantly, both the iPad Air and iPad Mini now support the Apple Pencil. Apple just surprised everyone by announc…", "url": "https://www.businessinsider.com/new-apple-ipad-air-mini-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f9458daa5077d2b35dd14-1920-960.jpg", "publishedAt": "2019-03-18T12:55:26Z", "content": "Apple just surprised everyone by announcing major updates to both the iPad Air and iPad Mini. \r\n Both devices are getting their internals upgraded, and both are getting support for Apple's stylus — the Apple Pencil. \r\n The same A12 Bionic chip that powers App… [+503 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eric Rosenberg", "title": "After more than a decade fine-tuning my finances, here's my 4-step process to make building wealth automatic", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, but our reporting and recommendations are always independent and objective. Automating …", "url": "https://www.businessinsider.com/how-to-automate-your-savings", "urlToImage": "https://amp.businessinsider.com/images/5c86959f2628983a8708cb55-2732-1366.jpg", "publishedAt": "2019-03-18T12:45:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, but our reporting and recommendations are always independent and objective. The hardest… [+4122 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Elon Musk: SpaceX spera di lanciare questa settimana ‘Test Hopper’, un prototipo per la nave spaziale per mandare persone su Marte - Business Insider Italia", "description": "SpaceX ha costruito un razzo in acciaio inossidabile presso il suo sito di lancio vicino alla spiaggia di Boca Chica, situata all'estremità meridionale del Texas. \"Test Hopper\" è il primo prototipo parzialmente funzionale di Starship: un sistema di lancio che…", "url": "https://it.businessinsider.com/elon-musk-spacex-spera-di-lanciare-questa-settimana-test-hopper-un-prototipo-per-la-nave-spaziale-per-mandare-persone-su-marte/", "urlToImage": "https://cdn.gelestatic.it/businessinsider/it/2019/03/5c8de6a1daa5076d6e3f53e2-1136-1136-1024x1024.jpg", "publishedAt": "2019-03-18T12:21:36Z", "content": "SpaceX ha costruito un razzo in acciaio inossidabile presso il suo sito di lancio vicino alla spiaggia di Boca Chica, situata all’estremità meridionale del Texas.\r\n“Test Hopper” è il primo prototipo parzialmente funzionale di Starship: un sistema di lancio ch… [+10565 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Ciolli and Rachel Cohn", "title": "The founder and CIO of $12 billion Ariel Investments breaks down how his top-ranked flagship fund has crushed its peers over the past 10 years", "description": "John Rogers — the CEO, chief investment officer, and lead portfolio manager at $12 billion Ariel Investments — spoke with Business Insider to break down his top fund's outsized success since the financial crisis. The $1.8 billion flagship Ariel Fund was No. 1…", "url": "https://www.businessinsider.com/2019-market-outlook-john-rogers-ariel-investments-on-fund-performance-whats-ahead-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a6e24124d04338a3b8c86-1920-960.jpg", "publishedAt": "2019-03-18T11:55:00Z", "content": "John Rogers— the CEO, chief investment officer, and lead portfolio manager at $12 billion Ariel Investments — spoke with Business Insider senior investing editor Joe Ciolli. \r\n They chatted about his fund's market-beating performance since the financial crisi… [+10153 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "PewDiePie briefly lost his crown as the biggest YouTuber on the planet", "description": "PewDiePie briefly lost his crown as the most subscribed channel on YouTube. Bollywood channel T-Series edged ahead for more than two hours on Monday morning. PewDiePie and fellow YouTubers have campaigned to keep the vlogger on top. YouTube star PewDiePie, re…", "url": "https://www.businessinsider.com/pewdiepie-lost-youtube-crown-to-t-series-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c3dd8a4bd7730375d3037e6-1136-568.jpg", "publishedAt": "2019-03-18T11:52:43Z", "content": "YouTube star PewDiePie, real name Felix Kjellberg, was briefly dethroned as YouTube's most subscribed channel by music channel T-Series. \r\n T-Series, a Bollywood production company which releases lavish music videos, has been poised to overtake PewDiePie for … [+1084 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson", "title": "A laser-guided free kick, a poke from a brilliant back-heel, and an audacious chipped goal: Lionel Messi’s 51st career hat trick was so good the opposition fans stood and applauded", "description": "Lionel Messi's most recent display was one of his best of the season as opposition fans couldn't help but stand and applaud. Messi converted an 18th-minute free kick, poked home a brilliant Suarez back-heel just before half time, and scored a stunning chip fr…", "url": "https://www.businessinsider.com/lionel-messi-hat-trick-so-good-opposition-fans-applauded-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f688e4f07ae07c6344492-1920-960.jpg", "publishedAt": "2019-03-18T11:35:16Z", "content": "Lionel Messi performed so well on Sunday that even opposition fans couldn't help but stand and applaud. \r\n With a low center of gravity, ball skills that made it look like he's got glue on his cleats, and incredible vision, Messi evaded his man markers, found… [+2464 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Deutsche Bank and Commerzbank are finally merging — but critics worry about job cuts and patchy past deals", "description": "Deutsche Bank and Commerzbank have agreed to hold formal talks about merging to create Europe's fourth-largest lender. Critics have highlighted up to 20,000 job losses, the pair's bad deals in the past, and existing challenges for both banks. After months of …", "url": "https://www.businessinsider.com/deutsche-bank-commerzbank-start-formal-merger-talks-amid-criticism-2019-3", "urlToImage": "https://images.markets.businessinsider.com/image/5c8f774969bdec7ac873d696-620/ddd-7.jpg", "publishedAt": "2019-03-18T11:15:03Z", "content": "Flickr/dustpuppy\r\nAfter months of speculation, Deutsche Bank and Commerzbank have agreed to hold formal talks about a merger. However, a tie-up of Germany's two largest lenders has raised eyebrows as it could lead to tens of thousands of job losses, the pair'… [+2237 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "The US is set to become the world's biggest oil exporter thanks to the fracking revolution", "description": "US energy production has reached record levels in recent years following a boom in shale production. The International Energy Agency's (IEA) latest five-year outlook sees the US overtaking Russia and potentially Saudi Arabia as an oil exporter by 2024. “The U…", "url": "https://www.businessinsider.com/oil-us-shale-revolution-to-make-it-worlds-biggest-oil-exporter-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f7a56f73f5c796569be42-2732-1366.jpg", "publishedAt": "2019-03-18T11:11:00Z", "content": "The US shale revolution has made it to one of the world's largest energy producers and potentially the largest oil exporter globally within five years. \r\n A five-year outlook from the International Energy Agency (IEA) sees the US potentially overtaking energy… [+1076 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lucia Moses", "title": "NBCUniversal and Sky unveil the first step of their plan to battle the tech giants", "description": "After Comcast's 2018 acquisition of Sky, it's starting to integrate Sky's and NBCUniversal's ad targeting capabilities. It will morph NBCU's Audience Studio into Sky's AdSmart offering in Comcast's first joint ad initiative since closing the $39 billion deal …", "url": "https://www.businessinsider.com/nbcuniversal-and-skys-plan-to-take-on-facebook-and-google-takes-shape-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bd75b401d5853f1485cc4-1334-667.jpg", "publishedAt": "2019-03-18T11:00:00Z", "content": "Comcast is starting to make good on getting benefits out of its 2018 acquisition of European pay-TV giant Sky. \r\n In Comcast's first joint ad initiative since the deal, NBCUniversal and Sky will start to share each other's ad targeting tools, they announced M… [+2942 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "10 things you need to know before the opening bell (SPY, SPX, QQQ, DIA, TSLA, F, WP, FIS)", "description": "Here is what you need to know. Theresa May could cancel a 3rd vote on her Brexit deal. A vote will only happen if the government is \"confident\" it will pass, according to Chancellor Phillip Hammond. Car-loan payments hit a 10-year high. America's love for spo…", "url": "https://www.businessinsider.com/stock-market-news-opening-bell-march-18-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f77315b066e7dbe02a644-1920-960.jpg", "publishedAt": "2019-03-18T10:51:00Z", "content": "Here is what you need to know. \r\n Theresa May could cancel a 3rd vote on her Brexit deal. A vote will only happen if the government is \"confident\" it will pass, according to Chancellor Phillip Hammond. \r\n Car-loan payments hit a 10-year high. America's love f… [+1803 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "10 things you need to know before the opening bell (SPY, SPX, QQQ, DIA, TSLA, F, WP, FIS)", "description": "Here is what you need to know. Theresa May could cancel a 3rd vote on her Brexit deal. A vote will only happen if the government is \"confident\" it will pass, according to Chancellor Phillip Hammond. Car-loan payments hit a 10-year high. America's love for spo…", "url": "https://markets.businessinsider.com/news/stocks/stock-market-news-opening-bell-march-18-2019-2019-3-1028037246", "urlToImage": "https://images.markets.businessinsider.com/image/5c8f7715124d047cc71633f2-2400/ap19076770275615.jpg", "publishedAt": "2019-03-18T10:51:00Z", "content": "Your Personalized Market Center"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bill Bostock", "title": "New Zealand quickly moves to reform gun laws after mosque massacre that killed 50, and promises detailed proposals within 10 days", "description": "New Zealand's Prime Minister Jacinda Ardern said Monday that the country will have a concrete proposal for new gun control laws within 10 days of Friday's mass shooting in the city of Christchurch. On Monday, Ardern said the attack \"exposed a range of weaknes…", "url": "https://www.businessinsider.com/new-zealand-gun-reform-3-days-after-christchurch-mosuqe-massacre-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f67c869e11c0e3f2e8033-2732-1366.jpg", "publishedAt": "2019-03-18T10:45:01Z", "content": "New Zealand has agreed to move forward with tighter gun control, three days after a man killed at least 50 worshippers at two mosques in Christchurch. \r\n \"Within 10 days of this horrific act of terrorism we will have announced reforms which will, I believe, m… [+2618 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Apple is reportedly 'squeamish' about how iPhones and Macs are being featured in its new TV shows", "description": "Apple is expected to unveil its streaming service later this month, along with a crop of original series. The hands-on approach of Apple executives has been noted by some producers. The New York Times now reports that executives have given notes on how Apple …", "url": "https://www.businessinsider.com/apple-squeamish-about-apple-products-in-new-tv-shows-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5bd05f99d2e6484e28430212-2732-1366.jpg", "publishedAt": "2019-03-18T10:33:51Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Thomas Colson", "title": "Theresa May could cancel plans to hold a third vote on her Brexit deal this week", "description": "Theresa May could pull a planned third vote on her Brexit deal because she is likely to lose it. Downing Street could delay a third meaningful vote, which had been scheduled for Tuesday, until after a key summit of European Union leaders on Thursday. The prim…", "url": "https://www.businessinsider.com/theresa-may-could-pull-third-brexit-vote-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f603c4f07ae075b60ddf6-2732-1366.jpg", "publishedAt": "2019-03-18T09:52:43Z", "content": "LONDON — Theresa May could scrap plans to hold a vote on her Brexit deal this week, according to two of her ministers, a move which would set up a dramatic showdown with her pro-Leave colleagues as European leaders decide whether to let the United Kingdom del… [+2131 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Trista Kelley", "title": "Payment processing company Worldpay is getting bought by US firm FIS in $43 billion deal", "description": "The combination of stock and cash values the deal at about $43 billion including debt. \"Scale matters in our rapidly changing industry,\" says FIS CEO Gary Norcross. Worldpay, once part of RBS, allows secure card payments online, via card processing machines o…", "url": "http://markets.businessinsider.com/news/stocks/Payment-processing-company-Worldpay-is-getting-bought-by-US-firm-FIS-in-43-billion-deal-1028036952", "urlToImage": "https://images.markets.businessinsider.com/image/5c8f611c113a507c18402654-2000/rtx3i278.jpg", "publishedAt": "2019-03-18T09:32:53Z", "content": "Steve Marcus/Reuters\r\nWorldpay agreed to be bought by Florida firm Fidelity National Information Services, valuing the combined companies at about $43 billion. \r\nThe companies announced the deal on Monday. Worldpay shares surged more than 10% in US premarket … [+878 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Trista Kelley", "title": "Payment processing company Worldpay is getting bought by US firm FIS in $43 billion deal", "description": "The combination of stock and cash values the deal at about $43 billion including debt. \"Scale matters in our rapidly changing industry,\" says FIS CEO Gary Norcross. Worldpay, once part of RBS, allows secure card payments online, via card processing machines o…", "url": "https://www.businessinsider.com/worldpay-is-getting-bought-by-us-firm-fis-for-43-billion-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5ba927c7de956033468b456f-1136-568.jpg", "publishedAt": "2019-03-18T09:32:53Z", "content": "Worldpay agreed to be bought by Florida firm Fidelity National Information Services, valuing the combined companies at about $43 billion. \r\n The companies announced the deal on Monday. Worldpay shares surged more than 10% in US premarket trading. \r\n Worldpay,… [+864 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "Ford paid its CEO a $17.7 million salary despite profits slumping by half in 2018", "description": "Ford CEO Jim Hackett's compensation rose 6% to $17.75 million, from $16.7 million in 2017, despite the company's difficult 2018 results which saw profits drop by more than 50%. The automaker struggled in Europe and Asia last year as it attempts to complete a …", "url": "https://www.businessinsider.com/ford-ceo-jim-hackett-compensation-rose-6-to-1775-million-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f59b7daa507798c246404-2732-1366.jpg", "publishedAt": "2019-03-18T09:30:52Z", "content": "Ford's CEO Jim Hackett boosted his salary by over a million dollars last year despite the automaker's poor results. \r\n Hackett's compensation rose 6% to $17.75 million, from $16.7 million in 2017 according to an SEC filing, despite the company's difficult 201… [+1085 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "'I don't trust some computer to drive me around': Trump says he'd never get in a 'crazy' driverless car", "description": "Four sources told Axios that Donald Trump has a deep mistrust of driverless cars. Trump sometimes enacts scenes in which the cars career out of control. One source said Trump could be spurred into action to make the regulatory landscape much tougher for auton…", "url": "https://www.businessinsider.com/donald-trump-hates-self-driving-cars-axios-reports-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f5c04daa507798c246405-2732-1366.jpg", "publishedAt": "2019-03-18T09:11:53Z", "content": "Donald Trump is not a fan of driverless cars, according to a new report from Axios. \r\n Four sources told Axios that they've heard Trump voice doubts about autonomous vehicles in conversation, apparently sometimes acting out scenes where the vehicles veer out … [+1406 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "There’s even more evidence that drinking lots of soda and sugar-filled coffee could lead to an early death", "description": "A long-term study of more than 118,000 men and women suggests the more sugar people drink, the more likely they are to die, especially from heart trouble. This was especially true for women. The study also suggests artificial sweeteners are unhealthy when con…", "url": "https://www.businessinsider.com/sugar-coffee-soda-could-be-linked-to-early-death-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c11f56123ca63f10677c2-1920-960.jpg", "publishedAt": "2019-03-18T09:00:00Z", "content": "Scientists have found even more evidence it's time to ditch the soda, put down the lemonade, and drop the sugary-sweet coffee routine. These sweet drinks taste good, but they may also set drinkers up for early death. \r\n A 34 year-long study of more than 118,0… [+2530 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Reuters and Jake Kanter", "title": "Lyft is seeking a valuation of up to $23 billion as it embarks on its IPO road show", "description": "Lyft is seeking a valuation of up to $23 billion as it embarks on its initial-public-offering road show this week. The company wants to raise as much as $2 billion from the road show. Lyft is the first ride-hailing firm to go public and is expected to spark a…", "url": "https://www.businessinsider.com/lyft-to-launch-ipo-roadshow-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f59bb003f5c7af5602703-2732-1366.jpg", "publishedAt": "2019-03-18T08:58:00Z", "content": "Lyft will launch the investor road show for its initial public offering on Monday, seeking a valuation of up to $23 billion, the ride-hailing firm said Monday. \r\n The ride-hailing company said in an updating filing with the Securities and Exchange Commission … [+3797 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Reuters and Jake Kanter", "title": "Lyft is seeking a valuation of up to $23 billion as it embarks on its IPO roadshow", "description": "Lyft is seeking a valuation of up to $23 billion as it embarks on its IPO roadshow this week, according to Reuters and The Wall Street Journal. The company wants to raise as much as $2 billion from the roadshow. Lyft is the first ride-hailing firm to go publi…", "url": "https://www.businessinsider.com/lyft-to-launch-road-show-for-up-to-2-billion-ipo-sources-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8f59bb003f5c7af5602703-2732-1366.jpg", "publishedAt": "2019-03-18T08:58:00Z", "content": "Ride-hailing platform Lyft will launch the investor roadshow for its initial public offering on Monday, seeking to raise as much as $2 billion and to be valued at more than $20 billion, according to people familiar with the matter. \r\n Lyft will be seeking to … [+3844 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "10 things in tech you need to know today", "description": "Good morning! This is the tech news you need to know this Monday. Tech firms scrambled to keep dozens of copies of videos showing the New Zealand mosque shooting off their platforms. YouTube, Facebook, and Twitter struggled to stop users ripping and uploading…", "url": "https://www.businessinsider.com/10-things-in-tech-you-need-to-know-today-march-18-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b73f59904f1622c008b5105-2732-1366.jpg", "publishedAt": "2019-03-18T08:03:56Z", "content": "Research shows Gen Z loves Instagram.\r\n Rachel Murray/Getty Images for Teen Vogue \r\nGood morning! This is the tech news you need to know this Monday. \r\n Tech firms scrambled to keep dozens of copies of videos showing the New Zealand mosque shooting off their … [+2734 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sam Shead, Business Insider Australia", "title": "Over 1 million people have signed a petition to remove an Australian senator who blamed Muslim immigration for the New Zealand shooting - Business Insider", "description": "Over 1 million people have signed a petition to remove an Australian senator who blamed Muslim immigration for the New Zealand shooting Business Insider New Zealand shooting: Australian leader sides with teen who egged anti-Muslim senator NBC News Who is Eggb…", "url": "https://www.businessinsider.com/over-1-million-people-petition-to-remove-fraser-anning-from-australian-government-after-new-zealand-shooting-comments-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8eee1c124d0478706f6c55-960-480.jpg", "publishedAt": "2019-03-18T01:17:25Z", "content": "A petition to remove Senator Fraser Anning from the Australian government has received over 1 million signatures as of Monday morning. \r\n Anning, a far-right politician who has been called out for his controversial views in the past, faced public backlash aft… [+2539 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "Here's your 2019 NCAA tournament bracket", "description": "March Madness is back! The 2019 bracket was officially revealed on Sunday, with 68 teams playing for the biggest prize in college basketball. Get your printable version below and start filling our your bracket for your March Madness pool. March Madness is her…", "url": "https://www.businessinsider.com/printable-ncaa-tournament-bracket-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ecf3d113a5077ae057766-1920-960.jpg", "publishedAt": "2019-03-17T22:47:28Z", "content": "March Madness is here! \r\n The 2019 NCAA Basketball Tournament starts with the First Four games on Tuesday and Wednesday, before tipping off with a full slate of 16 games on Thursday. Between now and then, there's just a few days to get to work filling out you… [+287 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "James Brains", "title": "How to make sausage with a KitchenAid Stand Mixer", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/how-to-make-sausage-with-a-kitchenaid-stand-mixer", "urlToImage": "https://amp.businessinsider.com/images/5c8bce36daa50752b574d608-2732-1366.jpg", "publishedAt": "2019-03-17T22:00:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+8585 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "In a flurry of angry St Patrick’s Day tweets, Trump bashes GM, John McCain, and SNL", "description": "President Donald Trump spent the early part of his St. Patrick's Day on Twitter, taking aim at the late Sen. John McCain, Fox News, \"Saturday Night Live,\" and GM. Trump started the morning by slamming \"Saturday Night Live\" for its repeated jokes about his pre…", "url": "https://www.businessinsider.com/trump-bashes-gm-john-mccain-and-snl-on-twitter-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ea25569e11c05ee0d06d3-2732-1366.jpg", "publishedAt": "2019-03-17T21:59:35Z", "content": "President Donald Trump spent the early part of his St. Patrick's Day making waves on Twitter, taking aim at a number of people and issues that he had also sounded off on the day before. \r\n Trump started the morning by slamming \"Saturday Night Live\" for its re… [+2553 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone", "title": "Trump lashed out at Fox News weekend hosts Leland Vittert and Arthel Neville after a critical segment on national emergency", "description": "Amid a flurry of tweets on Sunday by President Trump — which included criticizing \"Saturday Night Live,\" General Motors, and the late John McCain — the president also lashed out against Fox News weekend anchors, Leland Vittert and Arthel Neville. \"Were @FoxNe…", "url": "https://www.businessinsider.com/president-trump-lashing-out-against-fox-news-hosts-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e457969e11c019f735743-2732-1366.jpg", "publishedAt": "2019-03-17T21:54:18Z", "content": "Amid a flurry of tweets on Sunday by President Trump — which included criticism of \"Saturday Night Live,\" General Motors and the late John McCain, calling on Fox News to reinstate show host Judge Jeanie, and wishing his followers a happy St. Patrick's Day — t… [+2043 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "Beto O'Rourke says he has enjoyed 'privileges' in his life as a white man", "description": "Former Rep. Beto O'Rourke of Texas said Sunday that though he had been afforded a number of \"privileges\" because of his race and gender in his life, his background and experience make him a valuable candidate in the Democratic field. O'Rourke spoke to NBC's \"…", "url": "https://www.businessinsider.com/beto-orourke-white-man-privileges-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e75515b066e7453256732-1920-960.jpg", "publishedAt": "2019-03-17T21:30:59Z", "content": "Former Rep. and Democrat presidential candidate Beto O'Rourke of Texas said on Sunday's \"Meet the Press\" that though he had been afforded a number of \"privileges\" because of his race and gender in his life, his background and experience make him a valuable ca… [+2707 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "Acting chief of staff Mick Mulvaney says Trump is 'not a white supremacist,' following New Zealand mass shooting", "description": "Acting White House Chief of Staff Mick Mulvaney insisted Sunday that President Donald Trump \"is not a white supremacist\" and that his past rhetoric has no relation to the mass shooting that killed 50 at two New Zealand mosques last week. Speaking to host Chri…", "url": "https://www.businessinsider.com/mick-mulvaney-says-trump-is-not-a-white-supremacist-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e969cf73f5c71bb7e6832-2732-1366.jpg", "publishedAt": "2019-03-17T20:11:38Z", "content": "Acting White House Chief of Staff Mick Mulvaney sought to distance President Donald Trump and his past rhetoric from a shooting at two New Zealand mosques, saying Sunday any suggested connection was \"absurd.\" \r\n \"The president is not a white supremacist,\" Mul… [+3464 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "James Brains", "title": "We had a competitive distance runner try this $500 running watch for 1,000 miles — and it's better than anything he's ever used", "description": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase. A high-quality GPS running watch provides accurate data about your runs, displays the information…", "url": "https://www.businessinsider.com/garmin-forerunner-935-running-watch-review", "urlToImage": "https://amp.businessinsider.com/images/5c8bd6cc69e11c5f9a23ba85-1920-960.jpg", "publishedAt": "2019-03-17T20:00:00Z", "content": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase. In 2003, Garmin produced the first wrist-worn GPS unit designed specifically for runners: the For… [+8136 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "'Captain Marvel' brought in a huge $69.3 million over the weekend as it continued to dominate the box office", "description": "\"Captain Marvel\" brought in an estimated $69.3 million in its second weekend in theaters. That makes it the second-best March second weekend performance ever, passing 2010's \"Alice in Wonderland\" ($62.7 million). The movie's worldwide total is now at $760 mil…", "url": "https://www.businessinsider.com/captain-marvel-wins-week-2-box-office-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c647d3f0d15f5473b01dde5-1536-768.jpg", "publishedAt": "2019-03-17T19:37:05Z", "content": "In its second weekend Disney and Marvel Studios' \"Captain Marvel\" has proved that it has lasting power. \r\n The first major hit of the year brought in an impressive estimated $69.3 million over the weekend, easily winning the domestic box office for a second-s… [+1542 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone", "title": "Prosecutors investigating alleged poisoning death of 34-year-old Moroccan model who testified against former Italian Prime Minister Silvio Berlusconi", "description": "A 34-year-old Moroccan model — who was a key witness in the trial against former Italian Prime Minister Silvio Berlusconi over allegations that he paid for sex with an underage woman while in office — has died of poisoning, according to her lawyer. Prosecutor…", "url": "https://www.businessinsider.com/imane-fadil-died-of-alleged-poinsoning-berlusconi-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e84f25dfa9977eb564673-1920-960.jpg", "publishedAt": "2019-03-17T19:25:29Z", "content": "A 34-year-old Moroccan model — who was a key witness in the trial against former Italian Prime Minister Silvio Berlusconi over his paying for sex with an underage woman while in office — has died of poisoning, according to her lawyer. Now, prosecutors are inv… [+1727 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marissa Perino", "title": "14 of the most important early Facebook employees — and where they are now", "description": "On March 14, Facebook CEO Mark Zuckerberg announced the departure of two key executives: chief product officer Chris Cox and head of WhatsApp Chris Daniels. Cox and Daniels join a long list of Facebook employees who have left the company. We took a look at wh…", "url": "https://www.businessinsider.com/most-important-facebook-employees-where-are-they-now-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c227569e11c6c8177e745-1920-960.jpg", "publishedAt": "2019-03-17T19:11:00Z", "content": "On March 14, CEO Mark Zuckerberg announced the departure of Chris Cox, chief product officer and longtime employee of Facebook. \r\n Cox joined the team in 2005, one year after Facebook's inception. Cox, along with head of WhatsApp Chris Daniels, now join the r… [+811 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "Meghan McCain swiped at Trump after he attacked her late father for the second day in a row: 'No one will ever love you the way they loved my father'", "description": "Meghan McCain, late Sen. John McCain's eldest daughter, hit back at President Donald Trump after he tweeted insults about her father. As of Sunday morning, Trump had targeted late Republican Sen. McCain on Twitter for the second time in two days nearly seven …", "url": "https://www.businessinsider.com/meghan-mccain-swipes-at-trump-on-twitter-after-john-mccain-criticism-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e5ce36123ca792a459f64-2732-1366.jpg", "publishedAt": "2019-03-17T18:08:11Z", "content": "Meghan McCain, late Sen. John McCain's eldest daughter, hit back at President Donald Trump after he published multiple tweets insulting her dead father. \r\n President Donald Trump targeted late Republican Sen. John McCain on Twitter for the second time in two … [+2206 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Mayer", "title": "The best vegetable peelers you can buy", "description": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase. A sharp, well-designed vegetable peeler can make all the difference when it comes to efficient me…", "url": "https://www.businessinsider.com/best-vegetable-peeler", "urlToImage": "https://amp.businessinsider.com/images/5c70613f26289835df08c8e5-1334-667.jpg", "publishedAt": "2019-03-17T18:00:00Z", "content": "Why you'll love it: The Kuhn Rikon Original Swiss Peeler looks like nothing special, but the carbon steel blade and Y-shaped design can cut through even the toughest veggie skins. \r\n If one vegetable peeler can ever claim a cult following, it's the Kuhn Rikon… [+1217 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Goggin", "title": "Ethiopian Airlines and Lion Air crash black boxes reportedly showed 'clear similarities,' according to transport minister", "description": "Data from black boxes recovered from the Ethiopian Airlines and Lion Air Boeing 737 Max crashes that both occurred in the last year showed \"clear similarities,\" according to Ethiopian transport minister Dagmawit Moge, who spoke to journalists Sunday. Moge sai…", "url": "https://www.businessinsider.com/ethiopian-airlines-crash-and-lion-air-black-boxes-had-clear-similarities-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e86a3113a50749c614744-1920-960.jpg", "publishedAt": "2019-03-17T17:41:42Z", "content": "Data from the black boxes recovered from the Ethiopian Airlines and Lion Air Boeing 737 Max crashes, which have inspired numerous countries to ground the plane, showed \"clear similarities,\" according to a statement from Ethiopian transport minister Dagmawit M… [+2324 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone", "title": "Former Disney Channel star Kyle Massey allegedly sent sexually explicit messages to a teenage girl (DIS)", "description": "Former \"That's So Raven,\" Disney Channel star Kyle Massey has been accused of sending sexually explicit messages to a 13-year-old girl, according to court documents obtained by US Weekly. Massey — now 27 — met the unnamed teen in 2009 when she was four-years-…", "url": "https://www.businessinsider.com/kyle-massey-thats-so-raven-allegedly-sent-sexually-explicit-messages-to-a-teenage-girl-disney-channel-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e6844124d04736a7d8513-750-375.jpg", "publishedAt": "2019-03-17T16:17:05Z", "content": "Former \"That's So Raven\" and Disney Channel star Kyle Massey has been accused of sending sexually explicit messages to a 13-year-old girl, according to court documents obtained by US Weekly. \r\n Massey — now 27 — met the unnamed teen in 2009 when she was four-… [+1404 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julie Bort", "title": "Jeff Bezos is about to host his annual invite-only robot conference. Here's the first picture from the show (AMZN)", "description": "Jeff Bezos annual robotic and space conference is about to take place. Trucks are rolling in now to the Palm Springs resort where it is held every March. Business Insider has obtained a picture of at least one cool drone that will be on display for attendees.…", "url": "https://www.businessinsider.com/jeff-bezos-mars-conference-robot-pictures-photos-details-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c3e3af73f5c603c7bb804-2732-1366.jpg", "publishedAt": "2019-03-17T16:00:00Z", "content": "Even though Amazon is launching a new re:MARS conference in June that will be open to the public, CEO Jeff Bezos is still gearing up for his invite-only soiree called MARS next week. \r\n The MARS conference typically takes place around the third week in March … [+1859 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "A Facebook board member denied claims he met the Cambridge Analytica whistleblower 2 years before the scandal exploded", "description": "Andreessen Horowitz investor and Facebook board member Marc Andreessen has denied claims he met the Cambridge Analytica whistleblower Chris Wylie in 2016. The Observer reported that Andreessen hosted a meeting to determine how Cambridge Analytica might be mis…", "url": "https://www.businessinsider.com/marc-andreessen-denies-claims-he-met-with-cambridge-analytica-whistleblower-2016-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b3f87529e2a1018008b47d0-1920-960.jpg", "publishedAt": "2019-03-17T15:57:00Z", "content": "A prominent Silicon Valley investor and Facebook board member has denied claims that he met with a Cambridge Analytica representative as early as 2016. \r\n The Observer reported that Marc Andreessen, a founding partner at VC firm Andreessen Horowitz and curren… [+2423 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "Trump seemingly threatens 'SNL' with federal investigation over critical sketch", "description": "President Donald Trump slammed \"Saturday Night Live\" for its repeated jokes about his presidency, even calling for federal regulation of the comedy show. In a pair of tweets posted Sunday morning, Trump decried \"one-sided coverage\" by \"SNL\" and other late-nig…", "url": "https://www.businessinsider.com/snl-sketch-trump-alec-baldwin-matt-damon-rerun-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e45db124d047230654ef3-960-480.jpg", "publishedAt": "2019-03-17T15:45:01Z", "content": "President Donald Trump slammed \"Saturday Night Live\" for its repeated jokes about his presidency, even calling for federal regulation of the comedy show, in a pair of tweets posted Sunday morning. \r\n The show had aired a rerun the night before that featured a… [+1622 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone", "title": "Here's the pitch deck this Austin, Texas, entrepreneur used to raise millions for a startup inspired by Mark Zuckerberg's congressional testimony (FB)", "description": "When Facebook CEO Mark Zuckerberg testified before Congress last April, many in the tech industry joked about the out-of-touch questions he fielded from lawmakers. Serial entrepreneur Arlo Gilbert, however, saw a big opportunity and created Osano. Most people…", "url": "https://www.businessinsider.com/osano-pitch-deck-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c0e56003f5c5e885421b3-2732-1366.jpg", "publishedAt": "2019-03-17T15:30:00Z", "content": "When Facebook CEO Mark Zuckerberg testified before Congress last April, many in the tech industry joked about the out-of-touch questions directed at him by lawmakers. \r\n Serial entrepreneur Arlo Gilbert, however, saw a business opportunity. \r\n \"They were aski… [+2283 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "Jeff Bezos predictions from 20 years ago that were right on the money", "description": "Amazon has grown from an online bookseller to a domineering tech giant since it was founded by Jeff Bezos in 1994. Even when Amazon was young, Bezos had an extraordinary vision for the future of his company. Here are some of the most accurate predictions Jeff…", "url": "https://www.businessinsider.com/jeff-bezos-predictions-from-20-years-ago-that-were-right-on-the-money-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a883ddaa50735d91fe900-1334-667.jpg", "publishedAt": "2019-03-17T15:15:00Z", "content": "Bezos said \"entertainment value\"' is why places like movie theaters won't die. \"That experience is what you get when you go to movie theaters, and why you don't always rent movies, right?\" Bezos said to Wired. \r\n Like he predicted, many malls and retailers ha… [+438 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Price", "title": "Facebook is on the lookout for foreign spies trying to infiltrate the company (FB)", "description": "Facebook is on the lookout for foreign spies that might try to infiltrate its workforce. Recent allegations of industrial theft involving Huawei and Chinese employees at Apple have highlighted the potential risk to tech companies of state-sponsored corporate …", "url": "https://www.businessinsider.com/facebook-state-sponsored-corporate-espionage-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c0a9a5b066e5e86312227-1334-667.jpg", "publishedAt": "2019-03-17T15:00:00Z", "content": "On a day-to-day basis, Facebook's security team has its hands full dealing with the hoards of people that turn up at the company's offices to complain about their accounts, attempt to meet Mark Zuckerberg, or just try to look around. \r\n But the California soc… [+3049 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "The top 7 shows on Netflix and other streaming services this week", "description": "Every week, Parrot Analytics provides Business Insider the most in-demand original TV shows on streaming services. This week sees the addition of Netflix's \"On My Block\" ahead of its new season. \"The Umbrella Academy\" continues to dominate. The second season …", "url": "https://www.businessinsider.com/top-shows-to-watch-on-netflix-this-week-umbrella-academy-on-my-block-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bc6c269e11c5c7e077c85-1920-960.jpg", "publishedAt": "2019-03-17T14:45:00Z", "content": "Average demand expressions: 24,449,850 \r\nDescription: \"DOOM PATROL reimagines one of DC's most beloved groups of Super Heroes: Robotman aka Cliff Steele (BRENDAN FRASER), Negative Man aka Larry Trainor (MATT BOMER), Elasti-Woman aka Rita Farr (APRIL BOWLBY) a… [+1160 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dennis Green", "title": "Sam's Club CEO reveals what the company has learned from its cashierless 'beta lab' store (WMT)", "description": "Sam's Club Now is a \"beta lab\" store in Dallas, Texas, where Sam's Club does real-world tests of the features that the company's Plano, Texas, emerging-tech center dreams up. The store is smaller than the average Sam's Club, and it has zero cashiers. Customer…", "url": "https://www.businessinsider.com/sams-club-cashierless-store-lessons-ceo-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c093be0575a5cbc002b40-2732-1366.jpg", "publishedAt": "2019-03-17T14:33:00Z", "content": "Sam's Club Now isn't just about the future — it's about the present as well. \r\n Opened in November 2018, Now is a functioning Sam's Club warehouse store in Dallas, Texas, where Sam's Club members can shop. \r\n But it's also what CEO John Furner calls a \"beta l… [+2857 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanza Loudenback", "title": "A Georgetown professor says the same skill that will help you earn more money in your job can help you retire early", "description": "Mastering a skill could help you make more money, leverage your career, and reach financial independence sooner. On an episode of the Mad Fientist podcast, Cal Newport, an associate professor at Georgetown University, says skills are our \" strongest weapon\" f…", "url": "https://www.businessinsider.com/make-more-money-master-a-skill-cal-newport-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8aad62401d583cf71bc4b2-1920-960.jpg", "publishedAt": "2019-03-17T14:12:00Z", "content": "Whether you're after more money, a better job, or greater happiness, start by taking stock of what you're good at. \r\n Refining or mastering a skill is our \"strongest weapon\" when it comes to building wealth or career satisfaction, according to Cal Newport, an… [+1892 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marley Jay", "title": "Investors focused on themes are making 5 big mistakes. Here's how UBS says they can be avoided.", "description": "UBS says there are five common mistakes that thematic investors need to avoid for their strategies to work. Laura Kane, the firm's head of Americas thematic research, offers advice mostly centered around the patience investors should exhibit when deciding whe…", "url": "https://www.businessinsider.com/investing-tips-strategy-how-to-avoid-5-common-thematic-mistakes-ubs-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bdc834f07ae5c7d124d1f-2732-1366.jpg", "publishedAt": "2019-03-17T14:05:00Z", "content": "Investing based on themes requires patience and confidence, according to one of UBS's top researchers. But actually abiding by those principles is easier said than done. \r\n Laura Kane — the head of Americas thematic research for the firm's chief investment of… [+4606 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Mosher", "title": "Elon Musk's SpaceX might launch 'Test Hopper' — a prototype for a giant Mars rocket ship — for the first time this week", "description": "SpaceX has built a stainless-steel rocket ship at its launch site near Boca Chica Beach, located at the southern tip of Texas. \"Test Hopper\" is the first, though only partly-functional, prototype of Starship : a launch system that SpaceX founder Elon Musk hop…", "url": "https://www.businessinsider.com/spacex-test-hopper-raptor-engine-static-fire-boca-chica-texas-elon-musk-starship2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8df9d2e0575a6e2c6a2af5-1136-568.jpg", "publishedAt": "2019-03-17T13:41:17Z", "content": "SpaceX workers crawl the lower section of the Test Hopper out to a launch pad near Boca Chica Beach, Texas, on March 8, 2019.\r\nMaria Pointer (bocachicaMaria)\r\n SpaceX, the aerospace company founded by Elon Musk and headed by Gwynne Shotwell, is about to test-… [+7230 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "America's obsession with trucks and SUVs is helping push car loan payments to a 10-year high", "description": "The average car loan payment just hit a decade high. It's a result of Americans' renewed zeal for trucks and SUVs. But the keenness for big cars — and the ease with which lenders have issued car loans to even high-risk recipients — has boosted loan delinquenc…", "url": "https://www.businessinsider.com/americas-love-for-trucks-suvs-pushes-car-loan-payments-to-decade-high-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c82e5a226289824534f644b-2732-1366.jpg", "publishedAt": "2019-03-17T13:37:00Z", "content": "The average car loan payment just hit a decade high, according to Experian data first reported by Automotive News. \r\n In 4Q18, the average new car loan in the US was $545 per month and $387 per month on average for a used vehicle. The average interest rate wa… [+3460 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Áine Cain", "title": "Inside the career of Costco CEO Craig Jelinek, who's worked with the warehouse club almost since its birth (COST)", "description": "Costco CEO Craig Jelinek has been with the company since 1984. He largely worked his way up through the retailer's operations division. Jelinek succeeded Costco co-founder Jim Sinegal as CEO in 2012. Costco CEO Craig Jelinek has been with the warehouse chain …", "url": "https://www.businessinsider.com/costco-ceo-craig-jelinek-bio-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a9f8c69e11c42696101a9-1536-768.jpg", "publishedAt": "2019-03-17T13:22:00Z", "content": "Costco CEO Craig Jelinek has been with the warehouse chain since almost the beginning. The first-ever club bearing the name Costco opened in 1983. Price Club, the company that it eventually merged with, opened in 1976. Jelinek joined Costco in 1984, just mont… [+596 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Tesla's stock doesn't trade like it used to (TSLA)", "description": "Tesla has shifted from a stock that trades like an emerging-growth company to one that's sensitive to more fundamental catalysts, said Craig Irwin, an analyst at Roth Capital Partners. Shares of the electric-car maker were under pressure Friday following the …", "url": "https://markets.businessinsider.com/news/stocks/tesla-stock-price-fundamental-shift-in-trading-2019-3-1028035861", "urlToImage": "https://images.markets.businessinsider.com/image/5c8b911001df724fa6130f03-2400/ap19074196964435.jpg", "publishedAt": "2019-03-17T13:01:00Z", "content": "AP Photo/Jae C. Hong\r\nOver the last year or so, Craig Irwin has taken notice of something happening incrementally with Tesla shares: they don't trade like they used to.\r\n\"We note a fundamental shift in the behavior of Tesla's stock,\" Irwin, an analyst at Roth… [+2525 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Tesla's stock doesn't trade like it used to (TSLA)", "description": "Tesla has shifted from a stock that trades like an emerging-growth company to one that's sensitive to more fundamental catalysts, said Craig Irwin, an analyst at Roth Capital Partners. Shares of the electric-car maker were under pressure Friday following the …", "url": "https://www.businessinsider.com/tesla-stock-price-fundamental-shift-in-trading-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bc7066123ca574c23b612-1920-960.jpg", "publishedAt": "2019-03-17T13:01:00Z", "content": "Over the last year or so, Craig Irwin has taken notice of something happening incrementally with Tesla shares: they don't trade like they used to. \r\n \"We note a fundamental shift in the behavior of Tesla's stock,\" Irwin, an analyst at Roth Capital Partners, a… [+2543 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "Everything we know about the future of Xbox, from a disc-less console to next-gen hardware (MSFT)", "description": "Microsoft is widely expected to further detail its next Xbox consoles this year. Many are expecting details in June, at the company's annual Xbox press conference in Los Angeles. Between a steady supply of credible rumors and Microsoft's own statements, we al…", "url": "https://www.businessinsider.com/new-xbox-consoles-2019-rumors-features-expectations-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bfb8d124d045c4f47a485-1136-568.png", "publishedAt": "2019-03-17T12:40:00Z", "content": "If there's one thing Microsoft is lacking, it's major first-party game franchises. \r\n With the exceptions of \"Minecraft,\" \"Halo,\" and \"Forza,\" the portfolio of hit franchises owned by Microsoft is slim. And even if such franchises existed, Microsoft owns only… [+1067 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "Kirsten Gillibrand officially announces she's running for president in 2020", "description": "Sen. Kirsten Gillibrand has officially joined the race for president. The New York lawmaker, who faces an already-crowded Democratic field, said in a video released Sunday that she wants to prove \"brave wins.\" Gillibrand notably first announced the formation …", "url": "https://www.businessinsider.com/kirsten-gillibrand-officially-announces-presidential-bid-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e391b003f5c713f703f03-1920-960.jpg", "publishedAt": "2019-03-17T12:37:34Z", "content": "Sen. Kirsten Gillibrand officially joined the race for president Sunday after a two-month exploratory phase, saying she was ready to make \"big, bold, brave choices.\" \r\n \"Brave doesn't spread hate, cloud truth, build a wall,\" Gillibrand says in a video release… [+1623 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "You can try to catch Carmen Sandiego in Google Earth's throwback to the original video game (GOOGL)", "description": "You can now play a minigame featuring Carmen Sandiego on Google Earth. The game, \" Carmen Sandiego: The Crown Jewels Caper,\" is an homage to the popular games of the 1980s and 1990s that featured the titular world-traveling thief. Just like the original \"Carm…", "url": "https://www.businessinsider.com/carmen-sandiego-google-earth-game-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c0ca3daa5075c716c08e7-750-375.jpg", "publishedAt": "2019-03-17T12:20:00Z", "content": "Decades ago, the educational \"Carmen Sandiego\" games gave me my first excuse to mess with my parents' computer, which eventually led to me getting hooked on video games. \r\n So naturally, the news that Google was releasing a new \"Carmen Sandiego\" minigame for … [+1134 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "Quantum computing could change everything, and IBM is racing with Microsoft, Intel, and Google to conquer it. Here's what you need to know (IBM, GOOGL, MSFT, INTC)", "description": "Quantum computers are an extremely exciting technology, promising the raw computing power to crack previously-unsolvable problems. IBM has an early lead in quantum computing, experts say, with Google, Intel, Microsoft, and a host of startups close on its heel…", "url": "https://www.businessinsider.com/ibm-google-microsoft-intel-quantum-computing-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8aded4f73f5c42f462f216-2732-1366.jpg", "publishedAt": "2019-03-17T12:00:00Z", "content": "In January, IBM made waves when it announced its IBM Q System One, the world's first quantum computer available to businesses — a system housed in a sleek, 9-cubic-foot glass case. \r\n It's a major milestone for quantum computers, which had to date mostly been… [+15150 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Troy Wolverton", "title": "Here's how Airtable raised $160 million last year — and got a valuation of around $1 billion — without a pitch deck", "description": "Airtable, the maker of an up-and-coming cloud spreadsheet app, raised $160 million last year without having to rely on a pitch deck, CEO Howie Liu said. Investors were reaching out to Airtable, so it didn't need to put together a presentation to solicit fundi…", "url": "https://www.businessinsider.com/how-airtable-raised-money-without-pitch-deck-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bee4c5dfa995bdf0556b4-1334-667.jpg", "publishedAt": "2019-03-17T11:50:00Z", "content": "It turns out that when you have a hot startup, you don't need a pitch deck — investors will give you ample funding without one. \r\n That's what Howie Liu found out last year. His company, startup cloud spreadsheet maker Airtable, raised some $160 million in tw… [+1348 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "Facebook, facing huge criticism over live streaming, says it removed 1.5 million videos of the New Zealand shooting in 24 hours", "description": "Facebook is under pressure after the murder of 50 people in two mosques in Christchurch, New Zealand was livestreamed on its platform. It has been widely reported that 28-year-old Brenton Tarrant, who has been charged with murder over the massacre, livestream…", "url": "https://www.businessinsider.com/facebook-removed-15-million-videos-of-the-new-zealand-mosque-shootings-in-24-hours-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8e1f8b5b066e714b008ba8-1136-568.jpg", "publishedAt": "2019-03-17T10:28:37Z", "content": "Facebook is under pressure over its livestreaming video feature, after the man accused of shooting 50 people in New Zealand is thought to have broadcast the attack live via the social network. \r\n The company stated on on Twitter on Sunday morning that it had … [+2036 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Ciolli", "title": "A Wall Street expert explains why the US is the 'worst place' for Alexandria Ocasio-Cortez's favorite economic theory — and breaks down the 'absolutely horrifying' impact it could have", "description": "Modern Monetary Theory has captured the attention of economic experts around the world, including Federal Reserve Chair Jerome Powell and BlackRock CEO Larry Fink. Vincent Deluard, a macro strategist at INTL FCStone, argues that it's the wrong time to roll ou…", "url": "https://www.businessinsider.com/alexandria-ocasio-cortez-mmt-modern-monetary-theory-expert-opinion-on-drawbacks-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8bcc0d003f5c53b6070f85-1920-960.jpg", "publishedAt": "2019-03-17T10:05:00Z", "content": "Modern Monetary Theory has thrust economic debate into the national spotlight to a nearly unprecedented degree. And it has Rep. Alexandria Ocasio-Cortez of New York to thank for that. \r\n After years spent toiling on the outskirts of progressive economic theor… [+3830 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jim Edwards", "title": "Here is all the saving, investing, and retirement advice I wish someone had told me at the very beginning of my career", "description": "Most people do not realise that if you are not saving in a retirement plan, you're actively choosing to lose money. That's because retirement savings let you accumulate free money. Learning to say yes to free money is a skill you can turn into a habit. If you…", "url": "https://www.businessinsider.com/how-to-save-for-retirement-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a86fe124d0437f96488e4-1920-960.jpg", "publishedAt": "2019-03-17T09:12:21Z", "content": "A long time ago, in a galaxy far, far away, I enrolled in my employer's retirement savings plan. Five percent of each paycheck went into a bunch of mutual funds. For the first few months, I didn't pay much attention to my money. There wasn't very much of it, … [+6349 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Instagram has avoided Facebook's trust problem, beating its parent as app of choice for Generation Z", "description": "In the twelve months since the Cambridge Analytica scandal broke in March 2018, Facebook has experienced some major upheavals. According to a survey commissioned by Business Insider the social network has lost favour with users aged 18-25, who prefer Instagra…", "url": "https://www.businessinsider.com/instagram-is-more-popular-among-generation-z-than-facebook-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a7df1afd030723e038b4d5e-960-480.jpg", "publishedAt": "2019-03-17T08:00:00Z", "content": "Exactly a year ago, the news broke that Facebook had enabled the mass, possibly illegal, collection of people's information by a rogue researcher who handed that data on to a political consultancy called Cambridge Analytica. \r\n The resulting privacy furore en… [+3231 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Thomas Colson", "title": "Why Theresa May's Brexit deal is heading for a third defeat next week", "description": "Theresa May is preparing to put her Brexit deal to a vote for the third time this week. The House of Commons rejected her deal by 149 votes on Tuesday but Downing Street hopes the new threat of a lengthy Brexit delay will persuade Eurosceptic Conservative MPs…", "url": "https://www.businessinsider.com/mays-brexit-deal-is-heading-for-a-third-crushing-defeat-next-week-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8b9a076123ca50a539bce4-1136-568.jpg", "publishedAt": "2019-03-17T07:50:00Z", "content": "LONDON — Theresa May's Brexit deal was handed a second crushing defeat this week — but it's not dead yet. \r\nThe House of Commons voted on Thursday to seek an Article 50 extension which, if approved by European Union member states, will delay the United Kingdo… [+3676 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Illy ha comprato la fabbrica di cioccolato di Willy Wonka - Business Insider Italia", "description": "Illy ha comprato la fabbrica di cioccolato di Willy Wonka Business Insider Italia Illy compra inglese Prestat, brand fornitore della Casa Reale. Ispirò \"La fabbrica di cioccolato\" Rai News Illy acquista il marchio che ispirò \"La fabbrica di cioccolato\" Triest…", "url": "https://it.businessinsider.com/illy-ha-comprato-la-fabbrica-di-cioccolato-di-willy-wonka/", "urlToImage": "https://cdn.gelestatic.it/businessinsider/it/2019/03/comboilly.jpg", "publishedAt": "2019-03-17T03:05:38Z", "content": "Avete visto il film “Willy Wonka e la fabbrica di cioccolato”? Avete letto il libro? Al di là del fatto che chi scrive si augura per voi (e di cuore) di sì, potrebbe interessarvi sapere che l’opera di Roald Dahl è stata ispirata dalla storia di un vero marchi… [+1558 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "At least one person has died in massive floods swallowing eastern Nebraska", "description": "At least one person is dead and two are missing after m assive flooding in several Nebraska towns shut down roads and swallowed homes. Flooding originated from the Platte River in the eastern part of the state caused evacuations in more than 20 communities. C…", "url": "https://www.businessinsider.com/nebraska-flooding-updates-deaths-missing-rescues-2019-3", "urlToImage": null, "publishedAt": "2019-03-16T23:50:38Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Mayer", "title": "The best face wipes you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-face-wipes", "urlToImage": "https://amp.businessinsider.com/images/5c8a71415dfa9935885cd5a5-750-375.jpg", "publishedAt": "2019-03-16T22:00:00Z", "content": "I never thought I'd encounter a face wipe that would seriously make me consider ditching my beloved cleansing oils and balms, until I tried the Philosophy Purity Made Simple One-Step Facial Cleansing Cloths. \r\n Named after the brand's popular Purity Made Simp… [+1276 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "The academic at the heart of the Cambridge Analytica privacy scandal is suing Facebook for defamation", "description": "Aleksandr Kogan, who created an app that enabled Cambridge Analytica to collect personal details of millions of Facebook users, sued Facebook for defamation on Friday, The New York Times reported. Kogan alleged that Facebook defamed him when it said he lied a…", "url": "https://www.businessinsider.com/aleksandr-kogan-facebook-defamation-lawsuit-cambridge-analytica-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8d48b14f07ae735637ffa4-1536-768.jpg", "publishedAt": "2019-03-16T20:11:22Z", "content": "The academic who created an app allowing Cambridge Analytica to collect personal details of millions of Facebook users sued Facebook for defamation on Friday, The New York Times reported. \r\n According to The Times, Aleksandr Kogan said Facebook defamed him by… [+1636 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Goggin", "title": "Founder of busted Florida massage parlor chain reportedly orchestrated donations to Trump campaign from spa employees", "description": "Cindy Yang, the founder of the spa chain that was busted earlier this year in a massive sex-trafficking investigation, appeared to orchestrate a series of political donations to President Donald Trump's re-election campaign, according to a report from The New…", "url": "https://www.businessinsider.com/florida-massage-parlor-founder-orchestrated-trump-donations-from-spa-employees-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c83c079262898640f1b20c2-750-375.jpg", "publishedAt": "2019-03-16T20:06:23Z", "content": "Li \"Cindy\" Yang, the founder of the Florida massage parlor that was recently busted for allegedly selling sexual services to Patriots owner Robert Kraft, appeared to orchestrate a series of political donations to President Donald Trump's campaign from spa emp… [+2354 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jacob Roach and Malarie Gokey", "title": "Apple sells many different iPhone models — here's how much they all cost", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/iphone-price", "urlToImage": "https://amp.businessinsider.com/images/5c88022326289871cb57ffc5-1920-960.jpg", "publishedAt": "2019-03-16T20:00:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1056 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ellen Cranley", "title": "Tucker Carlson ignored white supremacist message of suspected New Zealand shooter, instead criticizing Democrats and journalists", "description": "Fox News host Tucker Carlson hit back against outcry from lawmakers and journalists over the mass shooting in Christchurch, New Zealand that left 49 people dead at two mosques. In his show's monologue Friday evening, Carlson warned that a \"ruling class\" would…", "url": "https://www.businessinsider.com/tucker-carlson-new-zealand-shooting-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8d22e5113a506a91726324-1920-960.jpg", "publishedAt": "2019-03-16T18:42:12Z", "content": "Fox News host Tucker Carlson hit back against outcry from lawmakers and journalists over the mass shooting in Christchurch, New Zealand that left 49 people dead at two mosques. \r\n In a monologue aired hours after the attack, Carlson said it was \"absurd\" that … [+4634 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "JBL's Link 300 smart speaker gives you multi-room audio and the Google Assistant — it's on sale for $125 at Best Buy", "description": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase. The JBL Link speaker series offers smart, multi-room audio for less than $300. The mid-sized Link…", "url": "https://www.businessinsider.com/jbl-link-300-review", "urlToImage": "https://amp.businessinsider.com/images/5c6c7ccd26289857bb44662a-1334-667.jpg", "publishedAt": "2019-03-16T18:00:00Z", "content": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase. Filling your house with speakers can be an expensive endeavor. Not only are many smart speakers p… [+5863 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "Investigators have reportedly found more evidence that could connect the Ethiopian Boeing 737 Max crash to a deadly accident five months before", "description": "New evidence has reportedly emerged from the Ethiopian Airlines Boeing 737 Max 8 crash that could be another connection to the previous deadly Lion Air Boeing crash in October 2018, Reuters reported Friday. According to Reuters, investigators at the crash sit…", "url": "https://www.businessinsider.com/potential-link-between-ethiopian-boeing-737-max-crash-lion-air-mishap-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a6cf5daa50730d94a9177-1920-960.jpg", "publishedAt": "2019-03-16T17:32:40Z", "content": "New evidence has emerged from the Ethiopian Airlines Boeing 737 Max crash that connect it to the previous deadly Lion Air Boeing crash in October 2018, Reuters reported Friday. \r\n According to Reuters, investigators at the crash site found a piece of equipmen… [+1921 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "21 players we can't wait to watch in the NCAA Tournament, ranked", "description": "March Madness begins with Selection Sunday on March 17. Across the country, college basketball fans are preparing for the most unpredictable event in sports. From mid-major standouts to future superstars, these are the players we're most excited to watch in M…", "url": "https://www.businessinsider.com/march-madness-best-players-ncaa-tournament-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c11ab01df7263d80962eb-1334-667.jpg", "publishedAt": "2019-03-16T15:53:40Z", "content": "March Madness is upon us. \r\n On Sunday 68 selected teams enter the bracket that will be predicted millions of times by college basketball fans across the country. \r\n While the joys of a bracket pool are many, what makes March Madness truly special is the bask… [+337 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hillary Hoffower", "title": "These are the 15 hottest destinations billionaires are traveling to in 2019", "description": "The ultra-rich are investing more in travel as a way to show off their wealth, and that includes everything from sabbaticals to brief vacations. We teamed up with luxury travel agency Original Travel to find the hottest spots billionaires are heading to this …", "url": "https://www.businessinsider.com/top-destinations-billionaires-are-traveling-to-luxury-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ada1b5dfa9945fd509a04-1920-960.jpg", "publishedAt": "2019-03-16T15:45:00Z", "content": "Investing in travel is becoming an increasingly popular way for the ultra-rich to signify their status— and they're extending it far beyond the classic idea of a vacation. \r\n Nowadays, the super-rich are taking months-long, multimillion-dollar trips to rechar… [+912 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "Inside 'vaccine court,' where the US government pays millions to people who say they were harmed by vaccines", "description": "Vaccine court in Washington, DC was established in 1988 after a series of unfounded lawsuits threatened to erase the national supply of diphtheria, pertussis, tetanus (DPT) vaccines. The court is a no-fault system where injured people can have their cases hea…", "url": "https://www.businessinsider.com/what-is-vaccine-court-is-it-real-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c89485e69bdec19fe334f72-1334-667.jpg", "publishedAt": "2019-03-16T15:30:00Z", "content": "Just a two minute walk from the front door of the White House, on the eastern edge of leafy Lafayette Square, sits the Howard T. Markey National Courts Building, a 9-story red brick structure with dark, narrow windows. Inside, federal judges oversee a mix of … [+15889 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "A group of women trying to change the sexist culture of open source software have been harassed online", "description": "Women running for the Open Source Initiative board of directors have been harassed online, they told Business Insider. The Open Source Initiative is best known for approving open source licenses and right now it's under the spotlight as companies shift their …", "url": "https://www.businessinsider.com/women-running-for-the-open-source-initiative-face-online-harassment-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8ae1a4daa507427448aad2-2732-1366.jpg", "publishedAt": "2019-03-16T15:15:00Z", "content": "When Mariatta Wijaya went to a conference for the popular programming language Python in 2015, it sparked an interest to join the volunteer community of developers that create and maintain the language. Later, after a mentor reached out, she became even more … [+9120 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "We climbed Vessel, the $200 million art installation at New York's Hudson Yards. Here's what it was like.", "description": "Business Insider was part of the first group to ever climb Vessel, a $200 million art installation at New York's Hudson Yards megadevelopment. The honeycomb-shaped structure, designed by legendary British architect Thomas Heatherwick, rises 150 feet in the ai…", "url": "https://www.businessinsider.com/hudson-yards-vessel-art-installation-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5babb286ea4002e0738b456c-1920-960.jpg", "publishedAt": "2019-03-16T15:00:00Z", "content": "A week before the opening of Vessel, a $200 million art installation at New York's Hudson Yards megadevelopment, Related Chairman Stephen Ross looked down at construction workers putting the finishing touches on the paved walkway. He was standing at the very … [+4533 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "An Australian politician who blamed the New Zealand shooting on immigration was egged by a teen during a press conference", "description": "A right-wing politician, who blamed the New Zealand mosque attacks on Muslim immigration, was egged by a teen during a press conference in Melbourne on Saturday. Local news organizations witnessed the incident. Senator Fraser Anning responded by punching the …", "url": "https://www.businessinsider.com/fraser-anning-teen-eggs-senator-who-blamed-new-zealand-shooting-on-immigration-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8d02f1003f5c693e1f5323-960-480.jpg", "publishedAt": "2019-03-16T14:53:49Z", "content": "An Australian politician, who blamed the New Zealand mosque attacks on Muslim immigration, was egged by a teen during a press conference in Melbourne on Saturday. Several local news organizations witnessed the incident. \r\n Video footage of the incident, which… [+1513 chars]"}]}