{"status": "ok", "totalResults": 3613, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Apple just blew past Microsoft to become the world's most-valuable public company (AAPL, MSFT)", "description": "Apple has surpassed Microsoft to reclaim its title as the world's most-valuable public company with a market cap of $916 billion. Its shares have risen in anticipation of the company releasing a Netflix-style video-streaming service. Watch Apple and Microsoft…", "url": "https://www.businessinsider.com/apple-replaces-microsoft-as-worlds-biggest-public-company-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93ba3cdaa50701ff552bad-2732-1366.jpg", "publishedAt": "2019-03-21T16:40:00Z", "content": "Apple has breezed past Microsoft to reclaim its title as the world's most-valuable public company. Shares of the consumer-electronics titan rallied close to 4% Thursday, giving Apple a market cap of about $916 billion — surpassing its computing archrival's $9… [+1080 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Audrey Schomer", "title": "Consumers are growing frustrated with the increasing number of SVOD options (DIS, AAPL, NFLX, AMZN, ROKU)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here. As the SVOD market continues to expand and fragment, providers a…", "url": "https://www.businessinsider.com/growing-svod-fragmentation-causing-subscription-fatigue-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c361c9e630d9b16fb6f5e65-2732-1366.jpg", "publishedAt": "2019-03-21T16:35:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Digital Media Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n As the SVOD market continues to expand and fragment, providers… [+3286 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Price", "title": "Facebook employees had unfettered access to hundreds of millions of users' unencrypted passwords for years (FB)", "description": "Facebook employees had access to hundreds of millions of users' passwords — for years. Users' passwords were being stored in an unencrypted format, and reportedly were accessible by 20,000 workers at the company. Facebook says it hasn't found any evidence of …", "url": "https://www.businessinsider.com/facebook-millions-users-passwords-stored-plain-text-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93b9645b066e6245495ac1-2732-1366.jpg", "publishedAt": "2019-03-21T16:32:57Z", "content": "Facebook stored hundreds of millions of users' passwords in a format easily readable by its employees for years, in the latest security scandal to hit the beleaguered Silicon Valley tech giant. \r\n Cybersecurity journalist Brian Krebs first reported the news o… [+1676 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Bratskeir", "title": "9 cheap solutions for people who want to waste less and wean themselves off single-use items", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/how-to-reduce-waste", "urlToImage": "https://amp.businessinsider.com/images/5c93b8bd5dfa996dc35da19e-1334-667.jpg", "publishedAt": "2019-03-21T16:30:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1490 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson", "title": "Serena Williams' husband Alexis Ohanian once did a school assignment on how much he hated tennis", "description": "Serena Williams' famous husband Alexis Ohanian hated tennis when he was at school. Tech guru Ohanian wrote a letter to his younger self as part of the \"Note to Self\" series on CBS. In his letter, he told himself to keep an open mind about tennis later in life…", "url": "https://www.businessinsider.com/alexis-ohanian-did-school-assignment-on-hating-tennis-letter-to-younger-self-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c40762f71967135c25a8854-1920-960.jpg", "publishedAt": "2019-03-21T16:16:00Z", "content": "Serena Williams' husband Alexis Ohanian once stood up in class to tell his school friends that he hated tennis. \r\n Ohanian, the co-founder of Reddit and Initialized Capital, reminisced about his childhood years in a letter he wrote to his younger self as part… [+2350 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "There’s a rumor spreading that AirPods and other wireless headphones cause cancer, but the truth is more complicated", "description": "Apple's AirPods and other wireless headphones emit small amounts of radio frequency radiation. So do cell phones. Scientists still aren't sure the dose is enough to harm us, and the studies they've done so far suggest that radiation from cell phones (far grea…", "url": "https://www.businessinsider.com/do-airpods-cause-cancer-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92367569bdec3bfc6b3518-1536-768.jpg", "publishedAt": "2019-03-21T16:12:00Z", "content": "If you've been on the internet lately, you might've heard that you should be worried about how Bluetooth headphones, like Apple's $200 AirPods, are affecting your risk of developing cancer. \r\n The short answer: Everybody calm down. There's nothing especially … [+4882 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Madeline Shi", "title": "Citi Ventures just led a $28 million round for a startup that helps freelancers manage their finances", "description": "Citigroup's investment arm led a $28 million funding round in a San Francisco-based software company that helps creative freelancers manage their finances. The investment comes as more US workers are participating in the \"gig economy,\" meaning they're outside…", "url": "https://www.businessinsider.com/citi-ventures-led-28-million-round-for-honeybook-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92c02a401d584fbf54a332-1536-768.jpg", "publishedAt": "2019-03-21T16:10:25Z", "content": "The investment arm of Citigroup is backing a software company that's aimed at helping freelancers manage their bills and projects. \r\n San Francisco-based HoneyBook has just raised $28 million in its Series C round led by Citi Ventures, with participation from… [+1655 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Amir Ismael", "title": "Save 40% on couches, chairs, and coffee tables at Target — and more of today's best deals from around the web", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/deal-of-the-day-target-furniture-sale-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93b699daa50703b8206f4a-960-480.jpg", "publishedAt": "2019-03-21T16:10:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+3723 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "This $55,000 floating tiny home can be assembled in one day", "description": "An Estonia-based design firm built a floating home that can be recycled and put together (or taken apart) in a single day. The home is built to last 50 years, and can easily be transported from one location to the next. With its minimalist aesthetic and compa…", "url": "https://www.businessinsider.com/floating-tiny-home-assembled-in-one-day-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92922b6123ca59c677efc2-2732-1366.jpg", "publishedAt": "2019-03-21T16:08:00Z", "content": "Recent years have ushered in the rise of digital nomads who conduct business out of restaurants, cafés, and subway cars instead of homes and offices. \r\n But even a nomad needs somewhere to rest their head occasionally — a place they can consider, if not a hom… [+689 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Antonio Villas-Boas", "title": "Apple came up with a clever new idea that could be the future of wireless charging (AAPL)", "description": "Apple submitted a patent that shows how desktop computers, like an iMac, could transmit wireless power to nearby devices, like mice and keyboards. The technology would prevent you having to charge your nearby and compatible peripherals at all. As great as thi…", "url": "https://www.businessinsider.com/apple-wireless-charging-patent-ditches-charging-pad-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a429c564aa6b5570a8b6dc5-2732-1366.jpg", "publishedAt": "2019-03-21T16:03:49Z", "content": "Apple is looking into technology that can transmit wireless power from its computers or displays to nearby devices, like a wireless keyboard or mouse, according to an Apple patent application published by the US Patent and Trademark Office that was first spot… [+1903 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Devon Delfino", "title": "I'm vegan and I spend about $175 a month on groceries — here's exactly what I buy", "description": "I'm a vegan living outside San Francisco, and I spend about $175 a month on groceries. I cook most of my meals at home and typically rely on a few key staples that I use over and over again. I get my groceries from two markets near me: Trader Joe's and Safewa…", "url": "https://www.businessinsider.com/vegan-grocery-budget-trader-joes-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c93b332daa50702a2763823-750.jpg", "publishedAt": "2019-03-21T16:02:00Z", "content": "When it comes to groceries, it's relatively easy for me to stay on budget— I'm vegan, I like simple foods, and I'm fine with cooking in bulk and eating the same meal for a few days. \r\n That's why I only need to spend about $175 a month on groceries. \r\n I have… [+1398 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mekebeb Tesfaye", "title": "Grab is doubling down on financial services with new product announcements", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here. Southeast Asian ride-hailing giant Grab is doubling down on its bankin…", "url": "https://www.businessinsider.com/grab-expands-financial-services-footprint-2019-3", "urlToImage": "https://amp.businessinsider.com/images/584ebcdcca7f0c1c008b4fad-1136-568.jpg", "publishedAt": "2019-03-21T16:02:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Fintech Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Southeast Asian ride-hailing giant Grab is doubling down on its bank… [+3837 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dan DeFrancesco", "title": "A portfolio manager at a $43 billion hedge fund explains firms' flawed approach to using alternative data, and how they can fix it", "description": "Mike Chen, a portfolio manager at PanAgora Asset Management, said firms are struggling to find value in alternative data because of their approach. Instead of trying out a variety of data feeds, Chen said firms should first develop a specific investment quest…", "url": "https://www.businessinsider.com/panagora-asset-management-pm-outlines-how-to-use-alternative-data-better-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92ac7c69e11c7295159278-1920-960.jpg", "publishedAt": "2019-03-21T15:57:56Z", "content": "Like trying to drink water straight from a fire hydrant, investors are having difficulty sifting through the massive amounts of alternative data providers to find insight that can quench their thirst for big returns. \r\n But Mike Chen thinks firms need to comp… [+2603 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "A hidden reference to Apple's long-awaited AirPower wireless charging mat was just discovered on Apple's website", "description": "A reference to Apple's AirPower wireless charger has appeared in the code of the company's Australian website. AirPower was announced in 2017 but has yet to launch due to technical issues, reports have indicated. An AirPower launch would come after Apple made…", "url": "https://www.businessinsider.com/apple-airpower-wireless-charging-mat-discovered-in-website-code-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93ace84f07ae764b71364d-1334-667.png", "publishedAt": "2019-03-21T15:55:32Z", "content": "Apple has yet to make any announcements regarding the availability of its AirPower wireless charging mat. But a recently discovered reference in the code on Apple's Australian website indicates that could be changing soon. \r\n A reference to AirPower is includ… [+1875 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bob Bryan", "title": "Trump got exactly what he wanted from the Fed, but for reasons he is going to hate", "description": "President Donald Trump has for months been pushing the Federal Reserve and chairman Jerome Powell to stop hiking interest rates. The Fed gave Trump some good news on that front Wednesday by projecting no interest-rate increases in 2019 and just one in 2020. B…", "url": "https://www.businessinsider.com/trump-wanted-federal-reserve-rate-hike-pause-but-not-for-weak-economy-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b47c462d87a8e1b008b49ce-1920-960.jpg", "publishedAt": "2019-03-21T15:50:00Z", "content": "President Donald Trump has for months blasted Federal Reserve Chairman Jerome Powell's interest-rate hikes, imploring the central bank chief to stop tightening monetary policy. \r\n On Wednesday, Trump finally got what he wanted from Powell and the Fed. As part… [+2657 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Talia Lakritz", "title": "THEN AND NOW: Royal maternity fashion over the years, from Queen Elizabeth's maternity coats to Meghan Markle's designer gowns", "description": "Women in the royal family continue to carry out engagements while pregnant, when possible. In 1982, Princess Diana made an entrance in a red Bellville Sassoon piece while attending the Barbican Centre in London. On a recent trip to Morocco, Meghan Markle wore…", "url": "https://www.businessinsider.com/meghan-markle-kate-middleton-pregnancy-royal-maternity-clothes-2019-3", "urlToImage": null, "publishedAt": "2019-03-21T15:36:35Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lauren Johnson", "title": "'It's a complex ecosystem': Ad-tech firms promise OTT advertisers granular measurement, but marketers say there are holes in their pitches", "description": "A number of ad-tech companies are rolling out new measurement products they say can help marketers see if their OTT ads led to a sale. These companies pull data from smart TV manufacturers and cable boxes, then match it with third-party stats to determine if …", "url": "https://www.businessinsider.com/marketers-are-critical-of-ott-ad-tech-firms-pitches-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c7f33382628983c836c69b3-1334-667.jpg", "publishedAt": "2019-03-21T15:32:11Z", "content": "As more people ditch traditional TV for OTT viewing, marketers are following by advertising in streaming TV apps. One of the areas they're most interested in is knowing if seeing video ads led people to take real-world actions like visiting a store and making… [+3856 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "Boeing quietly unveiled the $442 million airliner that will replace the 747 jumbo jet (BA)", "description": "The Boeing 777X was unveiled on March 13 in a private employee-only event. The 777X is destined to serve as Boeing's new flagship and as the replacement for the iconic 747 jumbo jet. The 777X comes in two variants, the $410.2 million 777-8 and $442.2 million …", "url": "https://www.businessinsider.com/boeing-quietly-unveiled-777x-replace-747-jumbo-jet-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c929ac3e0575a4b55356b63-1136-568.jpg", "publishedAt": "2019-03-21T15:24:20Z", "content": "Wednesday, March 13 was supposed to be a media bonanza for Boeing. The aviation giant was set to unveil its next great wide-body jetliner. One that is destined to serve as its flagship for decades to come and finally the replace the legendary 747 jumbo jet. \r… [+1227 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hillary Hoffower", "title": "From Converse to Air Jordans, sneakers have been a status symbol for decades — but millennials are redefining what that means in 3 major ways", "description": "Expensive shoes have surpassed luxury handbags as the latest status symbol. Sneakers are at the forefront of the trend, driven in large part by millennials ' desire for comfort and the consequent rise in athleisure — a reflection of how they live and work tod…", "url": "https://www.businessinsider.com/millennials-sneakers-status-symbol-luxury-footwear-style-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91545e4f07ae42d72474ca-1920-960.jpg", "publishedAt": "2019-03-21T15:21:00Z", "content": "Take a walk in a millennial's shoes, and you could find out a lot about their owner. \r\nBalenciaga's Triple S sneakers might find you seated in the front row of a fashion show as a fashion editor or celebrity. Lanvin low-tops might take you around Silicon Vall… [+7887 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Abby Jackson", "title": "Satellite giants Dish and DirecTV are taking wildly different pricing approaches to streaming — here's what it says about the future of live digital TV", "description": "Sling TV and DirecTV Now are taking opposite approaches to OTT growth. DirecT V Now increased its prices, which could cause it to lose half its sub scribers this year, while Sling is ratcheting up promotions to attract new customers. The differences in approa…", "url": "https://www.businessinsider.com/dish-and-directv-are-taking-wildly-different-approaches-to-streaming-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c929a3ddaa5074d79092aaa-1136-568.jpg", "publishedAt": "2019-03-21T15:14:02Z", "content": "Dish CEO Erik Carlson and AT&amp;T CEO Randall Stephenson.\r\n Dish; Richard Drew/AP Photo; Samantha Lee/Business Insider \r\n After competing head to head for years, Sling TV and DirecTV Now, the two biggest digital live TV services by subscribers are taking opp… [+4688 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Johnson", "title": "How to make a Google account and optimize your security settings", "description": "When you make a new Google account, you get access to a free Gmail account along with other services like Google Photos, Google Docs, and a Google Drive with 15 GB of online storage. A Google account also helps other common Google services – like Google Maps …", "url": "https://www.businessinsider.com/how-to-make-a-google-account", "urlToImage": "https://amp.businessinsider.com/images/5c93a310daa50701923e6847-1136-568.jpg", "publishedAt": "2019-03-21T15:14:00Z", "content": "A Google account is sort of like the Internet version of having a passport, library card, and driver's license all wrapped up in one. You can certainly get by without a Google account, but having one makes your life much, much easier. \r\n First and foremost, i… [+3728 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "8 successful retail startups that are the brainchilds of Wharton grads — from Harry's to Warby Parker", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/startups-founded-by-wharton-grads", "urlToImage": "https://amp.businessinsider.com/images/5c93a9d5daa5075c780b1e21-750-375.jpg", "publishedAt": "2019-03-21T15:12:00Z", "content": "Christina Carbonell, a cofounder at online kids basics brand Primary, received her bachelor's degree from Wharton, then went on to Harvard Business School. Along with her former coworker and fellow mom Galyn Bernard, she started selling soft, durable clothes … [+413 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "The Fed was 'as dovish as they could be without spooking the market.' Here's what Wall Street is saying.", "description": "The Federal Reserve lowered its growth forecast for the US economy Wednesday. It signaled interest rates would likely remain unchanged this year. Alongside plans to end its balance sheet runoff in September, the meeting was even more dovish than expected. Wit…", "url": "https://www.businessinsider.com/federal-reserve-wall-street-reacts-to-march-decision-2019-3", "urlToImage": null, "publishedAt": "2019-03-21T15:09:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "After several 'Fantastic Four' flops, Disney should use its upcoming Netflix competitor to revamp the franchise", "description": "The Disney-Fox merger closed on Wednesday, and Disney now owns the film rights to the X-Men and Fantastic Four. Fox made three \"Fantastic Four\" movies in the last fifteen years, and none were resounding successes. The 2015 reboot is an infamous disaster. Disn…", "url": "https://www.businessinsider.com/disney-revamp-of-fantastic-four-in-marvel-cinematic-universe-analysis-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c939fdddaa507003a104ac2-1136-568.jpg", "publishedAt": "2019-03-21T15:07:03Z", "content": "With Disney's acquisition of Fox, which closed on Wednesday, Disney now owns Fox's film studio, many of its television assets (minus its news and sports networks), its 30% stake in Hulu, and its popular movie franchises, including \"Avatar,\" \"Alien,\" \"Planet o… [+4704 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Emma Court", "title": "Big Pharma has tried and failed to cure Alzheimer's more than 200 times. The latest $16 billion flop leaves scientists hunting for a new path forward. (BIIB)", "description": "A promising, experimental Alzheimer's disease had a major failure on Thursday, when the drugmakers behind it announced they were cutting off most research efforts. Biogen lost roughly $16 billion of market value on the news. Watch Biogen trade in real time. A…", "url": "https://www.businessinsider.com/biogen-aducanumab-failure-alzheimers-cure-or-treatment-clinical-trial-cause-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c939a29daa507003e63ce08-1136-568.jpg", "publishedAt": "2019-03-21T15:07:00Z", "content": "A promising but experimental Alzheimer's disease drug had a devastating reversal of fortunes on Thursday, when two huge biotechs said they were largely giving up on it. \r\n The biotechs, Biogen and the Japan's Eisai, announced that they were cutting off most d… [+5022 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Trista Kelley", "title": "A 28-year-old hedge fund star who took on Bill Ackman slammed a 'bizarre' ban on short selling a $14 billion German company", "description": "Short seller Fahmi Quadir has criticized a regulator for banning shorts of payment processing firm Wirecard, and says she is short the stock. Quadir splashed on the scene with bearish bets on Valeant in 2015, taking on Bill Ackman who lost billions. Germany's…", "url": "https://www.businessinsider.com/fahmi-quadir-posts-takedown-of-germanys-ban-on-short-selling-wirecard-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93636c01df7265da6944d4-1334-667.jpg", "publishedAt": "2019-03-21T14:59:02Z", "content": "A star short seller who is one of the youngest female hedge fund managers on Wall Street just penned an explosive critique of German regulators' \"bizarre, backwards\" ban on short selling and what she says is a blow to free and fair markets. \r\n In an open lett… [+2680 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "A data point seen as the bellweather for global trade just tanked — and 'the floor is not yet in sight'", "description": "South Korean exports, seen as a bellwether for global trade, fell nearly 5%in the first 20 days of March. Exports to China and Japan fell by more than 10%. Shipments of microchips, oil products, and telecoms devices were all down. South Korean exports, widely…", "url": "https://www.businessinsider.com/korean-export-trade-data-dropped-5-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93a509daa5075c780b1e06-1536-768.jpg", "publishedAt": "2019-03-21T14:56:43Z", "content": "South Korean exports, widely viewed as a \"canary in the coal mine\" for the world economy, slumped 4.9% year-on-year to $28 billion in the first 20 days of March. \r\n \"These data bode ill for [the first quarter],\" said Freya Beamish, chief Asia economist at Pan… [+1242 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rayna Hollander", "title": "No, you don't have a 5G phone yet – US consumers are uninformed and misled about 5G, but T-Mobile, Verizon, Sprint, and AT&T can change that (TMUS, VZ, S, T)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Apps and Platforms Premium subscribers. To receive the full story plus other insights each morning, click here. US mobile carriers are racing to invest in the next big thin…", "url": "https://www.businessinsider.com/us-consumers-uninformed-misled-about-5g-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93a1ed4f07ae74ac516202-2732-1366.jpg", "publishedAt": "2019-03-21T14:53:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Apps and Platforms Premium subscribers. To receive the full story plus other insights each morning, click here.\r\n US mobile carriers are racing to invest in the next big th… [+5787 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andy Kiersz", "title": "As the Powerball jackpot tips over $600 million, let's remember the time Fox News gave the worst lottery advice ever", "description": "The Powerball jackpot is up to $625 million dollars. In January 2016, amid a media mania around the then-record billion-dollar prize, a segment on the Fox News morning show \"Fox and Friends\" suggested that a good strategy for winning the lottery is to \"buy as…", "url": "https://www.businessinsider.com/fox-news-lottery-tickets-2016-1", "urlToImage": "https://amp.businessinsider.com/images/5693d5dcc08a80d7118b86c3-640-320.png", "publishedAt": "2019-03-21T14:51:00Z", "content": "The best piece of financial advice for playing the lottery is probably to not play the lottery, but in 2016, Fox News offered a very questionable suggestion for would-be gamblers. \r\n Early that year, the Powerball lottery hit a jackpot of over a billion dolla… [+1661 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Connie Chen", "title": "11 top-rated bathroom cleaners and tools to get rid of mold and grime in your shower", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/bathroom-cleaners-for-grime-mold", "urlToImage": "https://amp.businessinsider.com/images/5c92f878daa50754cd3c1b95-750-375.jpg", "publishedAt": "2019-03-21T14:50:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+1004 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bradley Saacks", "title": "Michael Gelband's hedge fund ExodusPoint has added a trio of former Carlson Capital staffers to its growing team", "description": "ExodusPoint, which set a record for the biggest hedge fund launch ever last year with $8 billion in seed capital, has brought on Ivan Ross, the former head of fixed income at Carlson Capital, to run a bond sleeve for the New York-based manager, according to p…", "url": "https://www.businessinsider.com/michael-gelbands-exoduspoint-adds-carlson-team-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c928c68daa5074b275e5a79-1920-960.jpg", "publishedAt": "2019-03-21T14:41:08Z", "content": "Millennium Management's former fixed-income head, Michael Gelband, has hired Carlson Capital's former fixed-income head, Ivan Ross, to his new firm, sources tell Business Insider. \r\n Ross will run a fixed-income strategy at Gelband's ExodusPoint Capital Manag… [+2152 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Akin Oyedele", "title": "Legendary economist Gary Shilling sounds the alarm on a downward spiral confronting investors — one the Fed just signaled is fast approaching", "description": "The Federal Reserve on Wednesday kept interest rates unchanged and signaled zero rate hikes this year, to the satisfaction of investors that were wary of tighter financial conditions. However, its forecasts showed that an economic principle it's held on to fo…", "url": "https://www.businessinsider.com/federal-reserve-forecasts-show-downward-spiral-confronting-investors-gary-shilling-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c939b9b113a5060f447e5fe-960-480.jpg", "publishedAt": "2019-03-21T14:40:50Z", "content": "The Federal Reserve delivered most of what Wall Street was hoping for on Wednesday when it suspended its efforts to normalize the emergency policies it put in place after the financial crisis. \r\n Not only did the central bank keep its benchmark interest rate … [+2491 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Harrison Jacobs", "title": "On a 5-day safari through Tanzania, a local guide told me the number one thing that ruins the experience for tourists", "description": "On a recent five-day safari in Tanzania, I witnessed the Great Migration — when 1.5 million wildebeest travel across Tanzania's grasslands to give birth — as well as countless lions, elephants, and giraffes. I was incredibly lucky on my safari, as few people …", "url": "https://www.businessinsider.com/safari-tip-guide-tanzania-dont-expect-it-to-be-zoo-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92480669bdec3edb2b7250-1920-960.jpg", "publishedAt": "2019-03-21T14:39:00Z", "content": "Most days of the year, you can't see Mount Kilimanjaro, the highest mountain peak in Africa, even when you are driving alongside it. The day I flew into Tanzania was not one of those days. \r\n As I looked out the window driving back from the airport, the mount… [+4351 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Charlie Floyd", "title": "We went inside Ikea's futuristic lab where researchers design algae hot dogs, virtual-reality furniture, and self-driving cafés", "description": "Ikea has a lab in Copenhagen that dreams up, researches, and designs sustainable ways to live. Some projects they are currently developing include algae hot dogs, virtual-reality furniture, self-driving cafés, and a future-food cookbook. Space10 was founded i…", "url": "https://www.businessinsider.com/ikea-future-lab-space10-researching-sustainable-homes-food-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c825b512628980d1737a243-1920-960.jpg", "publishedAt": "2019-03-21T14:35:00Z", "content": "This is Ikea's future lab, Space10. It's a space in downtown Copenhagen where researchers are creating a sustainable future by changing the way we live, work, and eat. \r\n The lab aims to highlight and answer some of the biggest questions about our future, and… [+1388 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanza Loudenback", "title": "There are only 3 things you need to focus on if you want to retire early", "description": "Many people want to retire early, but few are taking the steps to get there. Early retirement requires a lot of earning, saving, and investing. That's according to real-estate investor Chad Carson, who says focusing on those three areas \"with a combination of…", "url": "https://www.businessinsider.com/how-to-retire-early-2017-8", "urlToImage": "https://amp.businessinsider.com/images/5c92e5da113a505899268822-1920-960.jpg", "publishedAt": "2019-03-21T14:33:00Z", "content": "Millennials aren't known for following the rules, especially when it comes to money. \r\n In addition to straying from traditional banks and putting off homeownership, nearly two-thirds are hoping to quit their job and retire before age 65, according to a poll … [+3596 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ryan Pickrell", "title": "US Marines seized a small island for training as a possible China fight looms in the Pacific", "description": "US Marines recently led a simulated assault on a small island in the Pacific, honing skills that would be essential in a fight with China. The exercise, which also involved the Army and Air Force, was part of the Corps' ongoing efforts to refine the Expeditio…", "url": "https://www.businessinsider.com/us-marines-seize-small-island-to-train-for-a-possible-china-fight-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c939619124d045d6b70c709-960-480.jpg", "publishedAt": "2019-03-21T14:32:11Z", "content": "Everything that is old may indeed be new again. \r\n During World War II, US Marines moved from island to island, famously fighting bloody battles against entrenched Japanese forces determined to dominate the Pacific. Now, as a potential conflict with China loo… [+4541 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jinnie Lee", "title": "The best women's rain boots you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-rain-boots-women", "urlToImage": "https://amp.businessinsider.com/images/5ad8a73c817df631008b48de-1920-960.jpg", "publishedAt": "2019-03-21T14:30:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+2516 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jethro Nededog, Jacob Shamsian and Olivia Singh", "title": "How Brad Pitt rose to fame — from Midwestern teen athlete to one of Hollywood's most recognizable actors", "description": "Brad Pitt is one of Hollywood's most recognizable actors, thanks to roles in the \"Ocean's\" franchise, \"Twelve Monkeys,\" and \"A River Runs Through It.\" He was born in Oklahoma and grew up in Missouri before making it big. Pitt is also a producer with his own p…", "url": "https://www.businessinsider.com/brad-pitt-movie-star-producer-career-timeline-2016-9", "urlToImage": "https://amp.businessinsider.com/images/5c928083113a504d3462a373-1136-568.jpg", "publishedAt": "2019-03-21T14:23:00Z", "content": "Brad Pitt is an actor and producer.\r\n Pascal Le Segretain/Getty Images \r\n Brad Pitt arrived in Hollywood two decades ago. \r\n Today, he's one of the most recognizable faces in the world. \r\n While looks may have nabbed him some early roles, it took great ambiti… [+781 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Meghan Morris", "title": "$930 billion Nuveen’s head of private markets is stepping down amid ‘challenges’ to the asset management business", "description": "Nuveen's Heather Davis is leaving the asset manager after 24 years, while four equity portfolio managers are out. Davis was the head of private markets for $930 billion Nuveen where she oversaw private equity, private debt, infrastructure and energy. Her depa…", "url": "https://www.businessinsider.com/heather-davis-is-leaving-days-after-4-equity-portfolio-managers-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c939c80daa507002109d239-750-375.jpg", "publishedAt": "2019-03-21T14:20:34Z", "content": "Both Nuveen's private and public markets teams are seeing cuts amid a challenging environment for the asset management industry.\r\n In a Thursday memo to employees, Jose Minaya, the $930 billion firm's chief investment officer, said private markets head Heathe… [+1800 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Peter Newman", "title": "Qualcomm's new smart speaker platform will drive third-party device growth (QCOM)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence IoT Briefing subscribers. To receive the full story plus other insights each morning, click here. San Diego-based technology company and semiconductor designer Qualcomm ann…", "url": "https://www.businessinsider.com/qualcomm-smart-speaker-platform-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9392d7401d5858be75cc14-2732-1366.jpg", "publishedAt": "2019-03-21T14:13:41Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence IoT Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n San Diego-based technology company and semiconductor designer Qualcomm a… [+3893 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Abigail Abesamis", "title": "How to turn your Apple Watch on and off, and force-restart it for troubleshooting", "description": "You can turn your Apple Watch on and off normally, or force-restart the device when it becomes unresponsive. When turning on Apple Watch, you'll see the Apple logo for a few moments, then the Watch display. There are several ways to wake Apple Watch, which yo…", "url": "https://www.businessinsider.com/how-to-turn-apple-watch-on-off-restart", "urlToImage": "https://amp.businessinsider.com/images/5c939b78daa5070023246415-2560-1280.jpg", "publishedAt": "2019-03-21T14:11:00Z", "content": "There aren't too many reasons to turn your Apple Watch off (I personally turned my Watch on and off for the first time for the sake of this story). \r\n But if the need arises, as your watch becomes unresponsive or its apps freeze up, for instance, here's how y… [+3302 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dana Varinsky", "title": "Insider Inc. is looking for freelance science writers", "description": "The science section of INSIDER and Business Insider is looking for reporters interested in contributing stories on a freelance basis. We’re working to build a network of reliable and talented freelance writers, and we’re especially interested in reporters wit…", "url": "https://www.businessinsider.com/insider-inc-freelance-science-writers-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92ba0c5b066e54ae471124-2732-1366.jpg", "publishedAt": "2019-03-21T14:10:00Z", "content": "The science section of INSIDER and Business Insider is looking for reporters interested in contributing stories on a freelance basis. \r\n We're working to build a network of reliable and talented freelance writers, and we're especially interested in reporters … [+867 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "Jared Kushner's brother, Josh Kushner, donated close to the maximum amount to Beto O'Rourke's 2018 Senate campaign against Ted Cruz", "description": "Josh Kushner, the younger brother of President Donald Trump's son-in-law Jared Kushner, donated the maximum $2,600 to Texas Democrat Beto O'Rourke's Senate campaign last October. Josh Kushner is reportedly a lifelong Democrat and has donated to a host of othe…", "url": "https://www.businessinsider.com/josh-kushner-jared-brother-beto-orourkes-senate-campaign-donation-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c939026401d5858c773cdf7-1136-568.jpg", "publishedAt": "2019-03-21T14:08:06Z", "content": "Josh Kushner, the younger brother of President Donald Trump's son-in-law Jared Kushner, donated $2,600 to Texas Democrat Beto O'Rourke's Senate campaign last October. \r\n The younger Kushner, a venture capitalist, made his donation — $100 shy of the maximum am… [+1511 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Greg Magana", "title": "New study shows consumers want seamless multichannel e-commerce (WMT)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here. Consumers have a strong inclination toward shopping across channels…", "url": "https://www.businessinsider.com/consumers-want-seamless-multichannel-ecommerce-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5ad0c8f7146e711d008b47ed-1920-960.jpg", "publishedAt": "2019-03-21T14:05:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence E-Commerce Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Consumers have a strong inclination toward shopping across channe… [+3094 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Thomas Colson and Adam Bienkov", "title": "Macron says UK must accept a no-deal Brexit if MPs again reject May's deal", "description": "LONDON — Britain is heading for a no-deal Brexit if MPs reject Theresa May's withdrawal agreement, Emmanuel Macron has said. \"In the case of a no vote, we would go towards a no deal,\" the French president said at a summit of EU leaders in Brussels. \"It's abso…", "url": "https://www.businessinsider.com/macron-uk-heading-for-no-deal-if-mps-reject-mays-plan-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9397d2daa507002b5048a8-960-480.jpg", "publishedAt": "2019-03-21T14:02:04Z", "content": "LONDON — Britain is heading for a no-deal Brexit if MPs reject Theresa May's withdrawal agreement, Emmanuel Macron has said. \r\n \"In the case of a no vote, we would go towards a no deal,\" the French president said at a summit of EU leaders in Brussels. \r\n \"It'… [+420 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "From surprise resignations to a sex scandal, WarnerMedia's leadership has undergone a major shakeup since AT&T took over", "description": "All of Time Warner's top executives have left the company since AT&T bought it last year. They include HBO's Richard Plepler, who unexpectedly resigned last month, and Warner Bros. CEO Kevin Tsujihara, who stepped down this week following a report that allege…", "url": "https://www.businessinsider.com/time-warner-leadership-shakeup-after-att-bought-it-analysis-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c910c5c5dfa992c0830abb7-2560-1280.jpg", "publishedAt": "2019-03-21T14:01:31Z", "content": "After AT&amp;T bought Time Warner last year for a massive $85 billion— taking control of Time Warner's many assets including Warner Bros. and HBO in a deal that President Trump opposed — AT&amp;T CEO Randall Stephenson sent a memo to employees. \r\n \"It's been … [+2437 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matthew DeBord", "title": "Ford names Amazon and Snap veteran Tim Stone as new CFO, continuing the company's push closer to Silicon Valley (F)", "description": "Longtime Ford exec Bob Shanks is retiring after over 40 years with the automaker. He's being succeeded by Tim Stone, who spent 20 years at Amazon before a brief stint at Snap that ended in early 2019. Stone's hiring continues CEO Jim Hackett's drive to push F…", "url": "https://www.businessinsider.com/ford-names-amazon-snap-veteran-tim-stone-cfo-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9397e2daa507002279d1a8-1920-960.jpg", "publishedAt": "2019-03-21T14:01:19Z", "content": "Longtime Ford CFO Bob Shanks officially announced his rumored retirement on Thursday. The four-decade veteran of the Detroit automaker will step down this year. He'll be succeeded by Tim Stone, who spent 20 years at Amazon before moving to Snap. \r\n Stone's fi… [+3127 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Cerulli", "title": "The best migraine relief products you can buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/best-migraine-relief-products", "urlToImage": "https://amp.businessinsider.com/images/5c914cb2401d582c1200547d-1920-960.jpg", "publishedAt": "2019-03-21T14:00:00Z", "content": "Why you'll love it: Offering both compression and cooling therapy, the Headache Hat is incredibly versatile and can be worn multiple ways. \r\n Have you ever found yourself wanting to squeeze your head in the midst of a migraine, or pressing a cold glass agains… [+2337 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Green", "title": "Amazon and Worldpay are partnering to expand Amazon Pay acceptance (AMZN, JPM, V, MA, AXP, COF, WP)", "description": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Payments Briefing subscribers. To receive the full story plus other insights each morning, click here. Amazon is partnering with major payment processor Worldpay to enable …", "url": "https://www.businessinsider.com/amazon-worldpay-grow-amazon-pay-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90ff16daa507212531d317-1334-667.jpg", "publishedAt": "2019-03-21T13:52:00Z", "content": "This is an excerpt from a story delivered exclusively to Business Insider Intelligence Payments Briefing subscribers. To receive the full story plus other insights each morning, click here.\r\n Amazon is partnering with major payment processor Worldpay to enabl… [+3239 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Here comes Levi Strauss...", "description": "Levi Strauss & Co. is set to begin trading Thursday on the New York Stock Exchange. The blue-jean maker is returning to the public market after more than three decades. Its trading debut comes amid a host of fresh initial public offerings, as Lyft, Uber, Airb…", "url": "https://www.businessinsider.com/levi-strauss-and-co-initial-public-offering-starts-trading-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c938a30e0575a57df4d0257-1920-960.jpg", "publishedAt": "2019-03-21T13:50:00Z", "content": "Levi Strauss &amp; Co., the iconic 146-year-old blue-jean maker, is set to return to the public market through an initial public offering Thursday after a three-decade absence. \r\n The San Francisco-based company priced its IPO of nearly 36.7 milion Class A sh… [+374 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "KFC's chicken and waffles are returning to menus across America", "description": "KFC is bringing its Kentucky Fried Chicken and Waffles back to menus nationwide this weekend. Chicken and waffles were an immediate hit when KFC introduced the dish in November. The dish will be available from late March to late April. KFC's chicken and waffl…", "url": "https://www.businessinsider.com/kfc-chicken-and-waffles-return-nationally-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9383ee69bdec598005562f-1920-960.jpg", "publishedAt": "2019-03-21T13:44:06Z", "content": "KFC's chicken and waffles are once again returning to menus nationwide. \r\n On Thursday, the chicken chain announced that Kentucky Fried Chicken and Waffles will roll out across the United States this Saturday. The dish, available as a basket meal and as a san… [+1234 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shana Lebowitz", "title": "Melinda Gates almost quit Microsoft in the 1980s because of the combative, male-dominated culture — and even today, bosses reward people who look and act just like they do", "description": "Many bosses exhibit unconscious bias in their hiring and promotion strategies. Specifically, they show favor to people who look and act just like them. Often the result is that people from privileged backgrounds wind up getting ahead. For your own success as …", "url": "https://www.businessinsider.com/unconscious-bias-managers-promote-similar-people-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b1033291ae66252008b4656-750-375.jpg", "publishedAt": "2019-03-21T13:37:00Z", "content": "Melinda Gates joined Microsoft in 1987. Shortly after, she considered quitting. \r\n Gates, who is co-chair of the Bill and Melinda Gates Foundation, wrote on Quartz that she was the only woman hired in the incoming class of MBAs at Microsoft. She said, \"It was… [+6056 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Graham Rapier", "title": "Tesla is suing former employees, accusing them of stealing confidential information and giving it to robo-taxi rival Zoox (TSLA)", "description": "Tesla is accusing four former employees who now work for the robo-taxi startup Zoox of stealing confidential information. The company alleges in a new lawsuit that the documents helped Zoox \"leap frog\" years of work on self-driving cars. More than 100 former …", "url": "https://www.businessinsider.com/tesla-sues-former-employees-zoox-alleging-theft-of-confidential-info-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8b9d85113a504d8202e306-2732-1366.jpg", "publishedAt": "2019-03-21T13:09:17Z", "content": "Tesla has accused four former employees who now work at the robo-taxi startup Zoox of stealing proprietary information and trade secrets. \r\n In a lawsuit filed Wednesday in the US district court for Northern California, Tesla said the theft helped Zoox \"leapf… [+2691 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marley Jay", "title": "The chief market strategist at $1.3 trillion investing giant reveals the hidden red flag that can signal a recession months in advance", "description": "Quincy Krosby, the chief market strategist at $1.4 trillion Prudential Financial, lays out an overlooked economic signal that's historically flashed red months before a full-blown recession occurs. While Krosby isn't calling for an imminent meltdown, she lays…", "url": "https://www.businessinsider.com/next-recession-cause-overlooked-signal-could-send-warning-months-in-advance-2019-3", "urlToImage": "https://amp.businessinsider.com/images/594a97c0114ab6bd008b4584-750-375.png", "publishedAt": "2019-03-21T13:05:37Z", "content": "Investors use revenue as a way to judge individual companies. But if they want to get the full picture, they could also use it as a way to check the economy's health. \r\n Quincy Krosby, the chief market strategist at $1.4 trillion Prudential Financial, says co… [+2653 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Premack", "title": "An Amazon Air plane crashed in February, killing all 3 people on board. Weeks earlier, several pilots said they thought an accident was inevitable.", "description": "An Amazon Air plane called CustomAir Obsession crashed on February 23, killing all three people on board. The cause of the crash remains unknown. In conversations with Business Insider before the crash, several pilots who fly planes for Amazon Air said they t…", "url": "https://www.businessinsider.com/amazon-air-pilots-labor-issues-2019-2", "urlToImage": "https://amp.businessinsider.com/images/5c7ff82c26289806642a71d2-1136-568.png", "publishedAt": "2019-03-21T13:00:56Z", "content": "An Amazon Air plane called CustomAir Obsession crashed on February 23. All three people on board were killed. \r\n The Boeing 767 cargo jet, operated by Atlas Air and contracted by Amazon, had been approaching Houston's George Bush Intercontinental Airport. The… [+23899 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bill Bostock", "title": "Trump reportedly still wants Robert Kraft at the Patriots White House Super Bowl party despite Florida massage-parlor prostitution scandal", "description": "President Donald Trump wants Robert Kraft to attend the New England Patriots Super Bowl party despite Florida massage-parlor prostitution scandal, according to a report. The New England Patriots owner was charged with two counts of soliciting prostitution and…", "url": "https://www.businessinsider.com/trump-wants-robert-kraft-at-super-bowl-party-amid-prostitution-bust-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c704c6426289838d32cfc44-1920-960.jpg", "publishedAt": "2019-03-21T12:50:10Z", "content": "President Donald Trump still wants New England Patriots owner Robert Kraft at the White House party to celebrate the team's Super Bowl win, despite the businessman facing criminal charges over soliciting prostitutes. \r\n According to a senior White House offic… [+1843 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Biogen is crashing after scrapping its late-stage Alzheimer's drug trials (BIIB)", "description": "Biogen and the Japanese pharmaceutical company Eisai said Thursday they would discontinue late-stage Alzheimer's drug trials. Shares of Biogen crashed more than 25% in pre-market trading. Watch Biogen trade live. Biogen shares crashed more than 25% in pre-mar…", "url": "https://www.businessinsider.com/biogen-alzheimers-disease-aducanumab-eisai-clinical-trial-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c937d3d69e11c7ea778e812-2732-1366.jpg", "publishedAt": "2019-03-21T12:25:00Z", "content": "Biogen shares crashed more than 25% in pre-market trading Thursday after the biotech company and Eisai, a Japanese pharmaceutical company, said they would discontinue two late-stage Alzheimer's drug trials. \r\n The two companies said they would scrap their glo… [+1120 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Biogen is crashing after scrapping its late-stage Alzheimer's drug trials (BIIB)", "description": "Biogen and the Japanese pharmaceutical company Eisai said Thursday they would discontinue late-stage Alzheimer's drug trials. Shares of Biogen crashed more than 25% in pre-market trading. Watch Biogen trade live. Biogen shares crashed more than 25% in pre-mar…", "url": "https://markets.businessinsider.com/news/stocks/biogen-alzheimers-disease-aducanumab-eisai-clinical-trial-2019-3-1028048723", "urlToImage": "https://images.markets.businessinsider.com/image/5c937cef124d045ac8314c3e-2400/2017-01-26t120000z1539591680rc1f080d7090rtrmadp3biogen-results.jpg", "publishedAt": "2019-03-21T12:25:00Z", "content": "REUTERS/Brian Snyder\r\nBiogen and the Japanese pharmaceutical company Eisai said Thursday they would discontinue late-stage Alzheimer's drug trials.\r\nShares of Biogen crashed more than 25% in pre-market trading, wiping out nearly $16 billion of market value.\r\n… [+1894 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "It's been nearly 30 years since the Exxon Valdez oil spill. But that crisis pales in comparison to these recent ocean disasters.", "description": "Thirty years ago, the Exxon Valdez oil tanker ran aground on a reef in in Alaska’s Prince William Sound and dumped 11 million gallons of oil into the ocean. The spill affected almost the entire Alaskan coastline, killing birds, sea otters, harbor seals, orcas…", "url": "https://www.businessinsider.com/exxon-valdez-spill-other-disasters-contaminated-ocean-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92531cf73f5c3d047c4092-2732-1366.jpg", "publishedAt": "2019-03-21T12:22:00Z", "content": "At 12:04 am on March 24, 1989, the Exxon Valdez oil tanker struck the Bligh Reef, less than 2 miles off the coast of Alaska. \r\n In the remote waters of the Gulf of Alaska, the tanker hemorrhaged some 11 million gallons of oil into the ocean. \r\n An ill-timed s… [+999 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alexandra Ma", "title": "The crashed Lion Air and Ethiopian jets lacked safety features that could have helped because Boeing charged extra for them, report says (BA)", "description": "Lion Air Flight 610 and Ethiopian Airlines Flight 302 crashed within five months of each other despite being effectively brand new. Both flights lacked two optional safety features that could have prevent the crashes, because Boeing charged extra for them, Th…", "url": "https://www.businessinsider.com/boeing-charged-for-safety-features-that-ethiopian-lion-air-lacked-nyt-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a30615b066e2d6b0c1c42-1536-768.jpg", "publishedAt": "2019-03-21T12:03:46Z", "content": "The two crashed Lion Air and Ethiopian Airlines jets lacked two safety features that could have helped prevent the disasters, because Boeing charged extra for them, The New York Times reported Thursday. \r\n Lion Air Flight 610 crashed over the Java Sea last Oc… [+3297 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Reddit, Wikipedia, and PornHub are strong-arming users into protesting against laws that could change the face of the internet in Europe", "description": "Reddit, Wikipedia, and Pornhub are all protesting against a new EU copyright law due to be put to a vote next week. Wikipedia has blacked out some of its European sites, while Reddit and Pornhub are displaying windows asking users to lobby lawmakers in Europe…", "url": "https://www.businessinsider.com/reddit-wikipedia-and-pornhub-protest-eu-copyright-laws-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9373f701df7266ad615c74-1536-768.jpg", "publishedAt": "2019-03-21T11:58:06Z", "content": "An unlikely alliance of Reddit, Wikipedia, and PornHub has formed in the face of sweeping new online copyright laws due to be voted on by the EU next week. \r\n European Parliament is due to consider the legislation on March 26. In particular, the sites take is… [+1701 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alan Dawson", "title": "Roger Federer just downplayed Novak Djokovic's greatest achievement", "description": "Novak Djokovic is on the cusp of holding all four Grand Slam titles at the same time. Djokovic is the reigning Wimbledon, US Open, and Australian Open champion and could complete the sport's majors for the second time in his career should he win the French Op…", "url": "https://www.businessinsider.com/roger-federer-downplays-novak-djokovic-greatest-achievement-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9368dd01df726635605765-1920-960.jpg", "publishedAt": "2019-03-21T11:58:00Z", "content": "Novak Djokovic is one Grand Slam trophy away from holding all four tennis majors at the same time — a great achievement, but one that has been downplayed by his arch rival Roger Federer. \r\n Djokovic has been on a tear since the middle of last summer when he h… [+3225 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "China's electric buses are killing oil demand as US production booms", "description": "A new report from Bloomberg New Energy Finance suggests that China's electric-bus revolution could kill off oil demand in the future. By the end of 2019, 270,000 barrels a day of diesel will be taken out of the market as a result of China's switch to non-foss…", "url": "https://www.businessinsider.com/chinas-electric-buses-killing-oil-demand-us-production-booms-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9359776123ca664b566a96-1920-960.jpg", "publishedAt": "2019-03-21T11:53:00Z", "content": "China's rapidly growing fleet of electric buses could be the biggest existential threat to oil demand in the future as more and more vehicles shun fossil fuels. \r\n A new report from Bloomberg New Energy Finance suggests that China's electric-bus revolution co… [+1143 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Charlie Wood", "title": "Facebook used experimental audio tech to shut down videos that AI missed after the New Zealand mosque massacres", "description": "Facebook has said it deployed experimental audio tech to support its AI in detecting and blocking copies of the New Zealand mosque shootings video. In a blog published on Wednesday, the social media company admitted its use of AI for detecting harmful content…", "url": "https://www.businessinsider.com/facebook-used-new-audio-tech-to-detect-christchurch-shootings-videos-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5bef6ba866be501e152ffcea-2732-1366.jpg", "publishedAt": "2019-03-21T11:47:29Z", "content": "Facebook has said it used experimental audio technology to help catch copies of the New Zealand mosque shootings video that its AI failed to detect. \r\nIn a blog published on Wednesday, the social media giant said it \"employed audio matching technology to dete… [+3292 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Levi's is getting ready to rejoin the stock market after 30 years", "description": "Levi Strauss & Co. will rejoin the stock market after more than 30 years. Shares priced Wednesday evening at $17 apiece, above the expected range of $14 to $16 — giving the jeans maker a market valuation of $6.6 billion. Levi's listing comes during a boom in …", "url": "https://www.businessinsider.com/levi-strauss-and-co-initial-public-offering-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9371f601df7266996a13c4-1920-960.jpg", "publishedAt": "2019-03-21T11:22:00Z", "content": "A good pair of jeans can last forever. Levi Strauss &amp; Co., which is set to rejoin the stock market on Thursday at a valuation of $6.6 billion, will hope investors see the same longevity in the Levi's brand. \r\n Shares priced Wednesday evening at $17 apiece… [+1220 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "I used Apple’s new iPad mini, and it might finally make me an Apple Pencil believer (AAPL)", "description": "The iPad mini received a long overdue upgrade earlier this week that brings better performance, Apple Pencil support, and an enhanced display. The Apple Pencil feels more natural on the iPad mini than any other Apple tablet I've used it with so far, largely b…", "url": "https://www.businessinsider.com/ipad-mini-review-price-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92c4ba003f5c531b529ed8-1920-960.jpg", "publishedAt": "2019-03-21T11:00:00Z", "content": "Apple's iPads have become increasingly capable of serving as laptop replacements in recent years. \r\n Take the new iPad Pro models that launched last October, for example. They run on Apple's A12X Bionic processor, which the company claims is more powerful tha… [+7077 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "10 things you need to know before the opening bell (SPY, SPX, QQQ, DIA, TSLA)", "description": "Here is what you need to know. The Fed dims its outlook for the US economy. The central bank on Wednesday held its benchmark interest rate unchanged in a range between 2.25% and 2.5%, and said that it expects no rate hikes this year and to end its balance-she…", "url": "https://www.businessinsider.com/stock-market-news-opening-bell-march-21-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c936ca24f07ae6fc035fa74-2732-1366.jpg", "publishedAt": "2019-03-21T10:53:00Z", "content": "Here is what you need to know. \r\n The Fed dims its outlook for the US economy. The central bank on Wednesday held its benchmark interest rate unchanged in a range between 2.25% and 2.5%, and said that it expects no rate hikes this year and to end its balance-… [+1881 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "10 things you need to know before the opening bell (SPY, SPX, QQQ, DIA, TSLA)", "description": "Here is what you need to know. The Fed dims its outlook for the US economy. The central bank on Wednesday held its benchmark interest rate unchanged in a range between 2.25% and 2.5% and said that it expected no rate hikes this year and that it would end its …", "url": "https://markets.businessinsider.com/news/stocks/stock-market-news-opening-bell-march-21-2019-2019-3-1028048218", "urlToImage": "https://images.markets.businessinsider.com/image/5c936c84401d58559303bdc8-2400/2019-03-21t104357z1632210811rc178e202b00rtrmadp3eu-summit.jpg", "publishedAt": "2019-03-21T10:53:00Z", "content": "Your Personalized Market Center"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alexandra Ma", "title": "Europe and Canada are investigating the Boeing 737 Max themselves rather than trusting the US — another apparent snub of American regulators (BA)", "description": "EU and Canadian regulators plan to conduct their own reviews of Boeing's planned safety update to its 737 Max jets. The software updates come after two deadly crashes of Lion Air Flight 610 last October and Ethiopian Airlines Flight 302 earlier this month. Eu…", "url": "https://www.businessinsider.com/eu-canada-investigating-boeing-737-max-in-apparent-snub-to-us-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c87ca5526289858305f30de-2732-1366.jpg", "publishedAt": "2019-03-21T10:36:57Z", "content": "European and Canadian regulators plan to conduct their own reviews of a new safety update to Boeing's 737 Max jets, rather than solely relying on those by US regulators. \r\n It appears to be a snub to the US Federal Aviation Administration (FAA), who is also a… [+3255 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Trista Kelley", "title": "'The market appears more relaxed than it is' — Traders shunning the UK because of Brexit are in for a pound 'tsunami'", "description": "Pound traders are in for a shock. \"It’s near impossible to take a position on the pound right now, so the market appears more relaxed than it is,\" says Neil Wilson at Markets.com Watch the pound trade in real time at Markets Insider. Traders shunning the UK u…", "url": "https://www.businessinsider.com/traders-shunning-uk-because-of-brexit-are-in-for-pound-tsunami-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c936334113a505ca5601cc4-2732-1366.jpg", "publishedAt": "2019-03-21T10:13:00Z", "content": "Traders shunning the UK until the outcome of Brexit becomes clear are in for a shock. \r\n That's according to Neil Wilson at Markets.com, who says that the market appears more relaxed than it is. The UK government's ongoing battle over Britain's exit from the … [+891 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Amazon accused of illegally firing a warehouse worker who protested against working conditions and HQ2", "description": "A former Amazon warehouse employee has filed a complaint against the company claiming he was fired for speaking out about its working conditions. Rashad Long worked at the Staten Island warehouse, and in December participated in a protest over Amazon's planne…", "url": "https://www.businessinsider.com/amazon-accused-of-firing-warehouse-worker-rashad-long-over-protest-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c65dc2c26289879010d2087-2732-1366.jpg", "publishedAt": "2019-03-21T10:04:48Z", "content": "A former Amazon warehouse worker has filed a complaint against the tech giant, saying he was fired as retaliation for speaking out about its working conditions. \r\n Rashad Long was recently dismissed from Amazon's Staten Island warehouse, or fulfillment center… [+2914 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "A Tesla analyst who just toured the electric-car maker's California and Nevada factories reveals what he saw (TSLA)", "description": "Tesla has faced a host of challenges in recent months. But one optimistic analyst who toured Tesla's Fremont, California, plant and its Nevada Gigafactory in recent days is doubling down on his bull thesis. Wedbush analyst Dan Ives described his time at the f…", "url": "https://markets.businessinsider.com/news/stocks/tesla-stock-price-gigafactory-fremont-factory-toured-by-analyst-2019-3-1028048032", "urlToImage": "https://images.markets.businessinsider.com/image/5b7c1e7fe361c036008b51a2-1239/screen-shot-2018-08-21-at-101242-am.png", "publishedAt": "2019-03-21T10:02:00Z", "content": "Marques Browne/YouTube\r\nTesla has faced a host of challenges in recent months.\r\nBut one optimistic analyst who toured Tesla's Fremont, California, plant and its Nevada Gigafactory in recent days is doubling down on his bull thesis.\r\nWedbush analyst Dan Ives d… [+4242 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "A Tesla analyst who just toured the electric-car maker's California and Nevada factories reveals what he saw (TSLA)", "description": "Tesla has faced a host of challenges in recent months. But one optimistic analyst who toured Tesla's Fremont, California, plant and its Nevada Gigafactory in recent days is doubling down on his bull thesis. Wedbush analyst Dan Ives described his time at the f…", "url": "https://www.businessinsider.com/tesla-stock-price-gigafactory-fremont-factory-toured-by-analyst-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c923b1b401d583a365a3db6-1136-568.jpg", "publishedAt": "2019-03-21T10:02:00Z", "content": "Dan Ives really likes Tesla. \r\n He and his fellow Wedbush analyst Strecker Backe, along with a group of investors, have toured both Tesla's Gigafactory in Sparks, Nevada, and its manufacturing plant in Fremont, California, over the past few days to better und… [+3851 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Ciolli", "title": "A $3 billion investment chief breaks down the strategies he expects traders to use around the Lyft IPO — and reveals how his firm is planning to play it", "description": "As Lyft secures investors for its initial public offering, there are many other money managers who won't be involved in the first wave of activity. That group includes Jack Ablin — chief investment officer at $3 billion Cresset Capital Management — who shares…", "url": "https://www.businessinsider.com/lyft-ipo-trading-strategies-investing-guidance-from-jack-ablin-cresset-asset-management-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c927f21003f5c485f3432b6-1920-960.jpg", "publishedAt": "2019-03-21T09:58:00Z", "content": "When it comes to an initial public offering as highly sought-after as Lyft's, it's not always possible for an investor to get in on the action right away. \r\n The roadshow is usually populated by the elite class of investors connected enough to score an invite… [+4505 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jake Kanter", "title": "Facebook rejects idea of putting time delay on live videos to stop horrors like the New Zealand mosque shootings being broadcast to the internet", "description": "Facebook rejected the idea of putting a time delay on live videos to stop harmful content, such as the New Zealand mosque shootings, being broadcast to its billions of users. Facebook said the volume of live video would make this difficult to police even with…", "url": "https://www.businessinsider.com/facebook-rejects-time-delay-on-live-videos-after-new-zealand-shootings-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c934df3e0575a54c310aec5-1920-960.jpg", "publishedAt": "2019-03-21T09:43:43Z", "content": "Facebook has rejected the idea of putting a time delay on live videos to stop horrific acts like the New Zealand mosque shootings being broadcast to its billions of users. \r\n The time delay trick is regularly applied during live television, helping broadcaste… [+1961 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Markets are reeling after a 'bizarre' Fed surprise", "description": "The Federal Reserve surprised markets by cutting its interest-rate forecast to zero hikes this year and just one in 2020. The US-China trade war appears set to linger after President Trump said tariffs could stay in place for a \"substantial period of time.\" B…", "url": "https://www.businessinsider.com/markets-are-reeling-after-a-bizarre-fed-surprise-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c93597d401d5854f30702a0-2732-1366.jpg", "publishedAt": "2019-03-21T09:36:58Z", "content": "Traders were left scrambling after the Federal Reserve forecast zero interest-rate hikes this year and just one in 2020. Rising uncertainty over Brexit and new signs of a prolonged US-China trade war added to the market confusion. \r\n Fed Chairman Jerome Powel… [+2532 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Will Martin", "title": "Trump complains that 'I didn't get a thank you' for John McCain's funeral", "description": "President Donald Trump used a public event in Ohio to complain that he \"didn't get a thank you\" for his role in John McCain's funeral. \"I gave him the kind of funeral that he wanted, which as president, I had to approve,\" Trump said at a visit to a tank facto…", "url": "https://www.businessinsider.com/trump-john-mccain-complains-he-didnt-get-a-thank-you-for-funeral-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5b815f0d2154a332008b54e2-1920-960.jpg", "publishedAt": "2019-03-21T09:18:43Z", "content": "President Donald Trump complained that he \"didn't get a thank you\" for helping to faciltate John McCain's funeral, renewing an attack on the late senator's legacy. \r\n \"I gave him the kind of funeral that he wanted, which as president, I had to approve,\" Trump… [+1128 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Adam Bienkov", "title": "Theresa May has now pushed Britain right to the point of a no-deal Brexit", "description": "Theresa May will on Thursday request a three month delay to Brexit. However the EU has already ruled out a delay of this length and is likely to veto any short delay unless MPs back the Brexit deal. There is little sign that MPs are about to change heart. Unl…", "url": "https://www.businessinsider.com/theresa-may-has-now-pushed-britain-right-to-the-point-of-a-no-deal-brexit-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9345ce5dfa99646d720534-1536-768.jpg", "publishedAt": "2019-03-21T09:09:34Z", "content": "LONDON — Throughout this two-year Brexit process UK politicians have repeatedly made the mistake of assuming that the EU does not mean what it says. That somehow at the eleventh hour the 27 other member states will buckle and give Britain exactly what it asks… [+4683 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "Trump ramps up trade war, saying US will keep tariffs on China for a 'substantial period'", "description": "US President Donald Trump put further pressure on trade war talks with China after indicating that tariffs on goods wouldn't be immediately lifted in the event of a deal. Trump suggested that trade tariffs would continue for a \"substantial period\" to ensure t…", "url": "https://www.businessinsider.com/trade-war-trump-says-keep-china-tariffs-for-substantial-period-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c934ab74f07ae6e10452753-2732-1366.jpg", "publishedAt": "2019-03-21T09:00:33Z", "content": "Trade war tensions were exacerbated once again after President Donald Trump said that the US would leave more than $250 billion of tariffs with China in place for a \"substantial period.\" \r\n The president made the comments ahead of the resumption of trade talk… [+1679 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Charlie Wood", "title": "A former Facebook executive raised $3.7 million to fund a game aiming to match the success of 'Pokémon Go'", "description": "Former Facebook employee Nikki Lannen has raised €3.3 million ($3.7 million) to fund the development of a new augmented-reality game at her startup WarDucks. The funding round was led venture capital firm EQT Ventures and will help get the new location-based …", "url": "https://www.businessinsider.com/ex-facebook-employee-nikki-lannen-raises-millions-warducks-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c927c45003f5c47fb6975ae-1920-960.jpg", "publishedAt": "2019-03-21T09:00:00Z", "content": "Former Facebook executive Nikki Lannen has raised nearly $4 million to create a new augmented-reality mobile game that aims to emulate the success of \"Pokémon Go.\" \r\n Lannen, the founder and CEO of Dublin-based gaming startup WarDucks, raised 3.3 million ($3.… [+1646 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "10 things in tech you need to know today", "description": "Good morning! This is the tech news you need to know this Thursday. Google has been fined $1.7 billion by the European Union for its third breach of EU antitrust rules in three years. The fine relates to Google's abuse of its dominance in search advertising, …", "url": "https://www.businessinsider.com/10-things-in-tech-you-need-to-know-today-march-21-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92751df73f5c42e2408753-1920-960.jpg", "publishedAt": "2019-03-21T08:01:50Z", "content": "Fortnite.\r\n Epic Games \r\nGood morning! This is the tech news you need to know this Thursday. \r\n Google has been fined $1.7 billion by the European Union for its third breach of EU antitrust rules in three years. The fine relates to Google's abuse of its domin… [+2592 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Choi", "title": "'This is what leadership looks like': Alexandria Ocasio-Cortez applauds New Zealand for banning assault rifles", "description": "Democratic Rep. Alexandria Ocasio-Cortez of New York applauded New Zealand Prime Minister Jacinda Ardern for taking legislative action after her country faced its worst shooting in history. Ardern announced on Thursday a sweeping ban on \"military style semi-a…", "url": "https://www.businessinsider.com/alexandria-ocasio-cortez-assault-rifles-christchurch-shooting-new-zealand-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9323dd01df7263b17881a2-1536-768.jpg", "publishedAt": "2019-03-21T05:41:01Z", "content": "Democratic Rep. Alexandria Ocasio-Cortez of New York applauded New Zealand Prime Minister Jacinda Ardern for taking legislative action after her country faced its worst shooting in history. \r\n Ardern announced a sweeping ban on \"military style semi-automatic\"… [+1424 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sarah Gray", "title": "Beto O'Rourke sounds off on big tech companies like Facebook, Twitter, and Google, says government needs to treat them 'a little bit more like a utility'", "description": "Beto O'Rourke, the 2020 presidential candidate and former congressman from Texas, responded to a question about breaking up the big tech companies on Wednesday. O'Rourke, who officially entered the race on March 14, has emerged as a fundraising frontrunner, r…", "url": "https://www.businessinsider.com/beto-orourke-wants-to-treat-tech-a-little-bit-more-like-a-utility-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92e891daa507545b3023c7-1920-960.jpg", "publishedAt": "2019-03-21T01:28:54Z", "content": "Beto O'Rourke, the 2020 presidential candidate and former congressman from Texas, responded to a question about breaking up the big tech companies. \r\n O'Rourke, who officially entered the race on March 14, has emerged as a fundraising frontrunner, raking in $… [+2589 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Choi", "title": "'The president is fighting with a dead guy again': Fox News host flabbergasted by Trump's latest attacks on John McCain", "description": "Fox News host Shepard Smith appeared to be flabbergasted by President Donald Trump's most recent comments about the late Republican Sen. John McCain. Trump claimed to end the US's \"endless wars\" in the Middle East during a speech in Ohio earlier on Wednesday,…", "url": "https://www.businessinsider.com/fox-news-trumps-latest-attacks-on-john-mccain-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92d08fdaa50753523a4262-2732-1366.jpg", "publishedAt": "2019-03-21T00:58:41Z", "content": "Fox News host Shepard Smith appeared to be flabbergasted by President Donald Trump's most recent comments about the late Republican Sen. John McCain during his show on Wednesday afternoon. \r\n During a speech earlier Wednesday in Ohio, Trump claimed to end the… [+2539 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "YouTube has shut down a popular channel after the mother was charged with allegations of abusing her children", "description": "YouTube creator Machelle Hackney, behind the popular channel \"Fantastic Adventures,\" has been arrested in connection with allegations she beat and starved her children who starred in the videos. Her seven adopted kids reportedly told officers they were punish…", "url": "https://www.businessinsider.com/youtube-terminates-fantastic-adventures-following-child-abuse-allegations-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c926a614f07ae59364421d7-1136-568.jpg", "publishedAt": "2019-03-21T00:32:48Z", "content": "YouTube shut down a popular channel about a family's zany adventures on Wednesday following allegations that the woman making the videos was abusing her children. \r\n Police in Arizona arrested Machelle Hackney earlier this month in connection with allegations… [+3721 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone", "title": "Here's a look inside credit card startup Brex's new member-only San Francisco lounge", "description": "Credit card startup Brex has opened a members-only lounge in San Francisco's South Park district to give cardholders a place to gather — whether that be to work, hold meetings, or socialize. Dubbed \"The Oval Room,\" the space feels like a homier version of a W…", "url": "https://www.businessinsider.com/brex-san-francisco-members-only-lounge-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92b051113a5054f10c6da7-2732-1366.jpg", "publishedAt": "2019-03-20T23:58:20Z", "content": "When Brex co-founders Pedro Franceschi and Henrique Dubugras were fundraising for their idea of creating a corporate credit card specifically for startups, they had no office. Instead, they met with venture capitalists at coffee shops and nearby, San Francisc… [+2894 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julie Bort", "title": "VMware CEO says Cisco's networking software is like 'a bicycle' compared to his 'Lamborghini' as they fight for cloud dominance (VMW, CSCO, AMZN)", "description": "VMware and Cisco's rivalry is as fierce as ever, as both companies fight to stay relevant while their customers ditch old-fashioned tech for the cloud. VMware CEO Pat Gelsinger couldn't help but throw some shade at Cisco in a recent interview, calling its sof…", "url": "https://www.businessinsider.com/vmware-ceo-throws-shade-at-ciscos-networking-software-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92c4746123ca60864b34b3-2560-1280.jpg", "publishedAt": "2019-03-20T23:37:09Z", "content": "Years ago, VMware and its then-parent company EMC were best buddies with Cisco. They even sold their products together in a joint venture that did about $2 billion a year, we reported back in 2014.\r\n But when VMware spent $1 billion cash to snatch Nicira, a t… [+2480 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Troy Wolverton", "title": "Hot AI software startup Skymind used this pitch deck to raise $11.5 million", "description": "Skymind just closed an $11.5 million Series A funding round. The San Francisco-based company offers a set of software that helps companies build artificial intelligence systems. It plans to use the new funds to build out its sales team. The pitch deck it used…", "url": "https://www.businessinsider.com/skymind-raised-115-million-with-this-pitch-deck-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9290df01df725848241489-2560-1280.jpg", "publishedAt": "2019-03-20T23:29:16Z", "content": "Artificial intelligence is probably the most important new development in the tech industry, but many companies are struggling to embrace it. \r\n Chris Nicholson thinks his startup can help. \r\n One of the things that's holding companies back from AI is that th… [+1497 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "A dog died in the cargo hold of an Air France flight from Amsterdam to Los Angeles", "description": "A dog died on an Air France flight from Amsterdam to Los Angeles, the airline confirmed to Business Insider in an email on Wednesday. The dog was found in the plane's cargo hold. Investigators are working to determine the cause of death. Air France says the d…", "url": "https://www.businessinsider.com/dog-dies-in-cargo-hold-of-air-france-flight-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c928abfe0575a486f0d7423-1920-960.jpg", "publishedAt": "2019-03-20T23:24:46Z", "content": "A dog died on an Air France flight from Amsterdam to Los Angeles, the airline confirmed to Business Insider in an email on Wednesday. \r\n The animal was found in the plane's cargo hold. Investigators are working to determine its cause of death. \r\n \"The dog's o… [+1073 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Lauletta", "title": "The Cinderella team that rocked March Madness the year you were born", "description": "March Madness is back! Each year, one team emerges as the \"Cinderella\" story of the tournament. Below we go through the Cinderella teams from every year since the bracket expanded to 64 teams in 1985. Check out the rest of our March Madness coverage here. Mar…", "url": "https://www.businessinsider.com/cinderella-march-madness-team-year-you-were-born-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92be85e0575a4fc6258916-1536-768.jpg", "publishedAt": "2019-03-20T23:19:51Z", "content": "The 2010 NCAA tournament was defined by two Cinderellas. \r\n First, No. 9 UNI shocked the world in the opening weekend, winning a thrilling opening game against No. 8 UNLV before stunning top-ranked Kansas 69-67 to punch their ticket to the Sweet 16. \r\n The Pa… [+512 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nick Bastone", "title": "Google may be ready to 'put the brakes' on Pixelbook innovation, analysts say (GOOG, GOOGL)", "description": "Last week, Business Insider learned that Google had moved dozens of employees out of its laptop and tablet division, scaling back the size of its in-house hardware group. On Tuesday, Ben Bajarin, Principal analyst with Creative Strategies, told Business Insid…", "url": "https://www.businessinsider.com/analysts-think-google-will-put-brakes-innovation-pixelbook-laptop-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9167b969e11c4ff8740fb2-2732-1366.jpg", "publishedAt": "2019-03-20T22:56:17Z", "content": "We may have reached peak Pixelbook. \r\n Last week, Business Insider learned that Google had moved dozens of employees out of its laptop and tablet division, scaling back the size of its in-house hardware group. The decision came amid what sources described as … [+5469 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Trump’s former communications director Hope Hicks will cooperate with House Democrats’ investigation into the president", "description": "Hope Hicks will comply with a request for documents from House Judiciary Chairman Jerry Nadler, who is overseeing a probe into President Donald Trump and allegations of obstruction of justice. In a letter sent to Hicks in early March, Nadler asked for \"any pe…", "url": "https://www.businessinsider.com/hope-hicks-will-cooperate-with-house-democrats-probe-into-turmp-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92c090113a5056be0bcf04-1136-568.jpg", "publishedAt": "2019-03-20T22:37:36Z", "content": "Former White House communications director Hope Hicks will cooperate with a House Judiciary Committee probe into President Donald Trump and allegations of obstruction of justice, CNN reported on Wednesday.\r\n Hicks, who had a close working relationship with Tr… [+2132 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christopher Woody", "title": "Mexicans in the world's most violent city are taking barbed wire right off the border wall to protect their own homes", "description": "US troops have piled concertina wire along the US-Mexico border, which has been criticized as security theater with little practical use. In Tijuana, where violence is climbing, Mexicans have repurposed the wire for their own protection. Voluminous bundles of…", "url": "https://www.businessinsider.com/tijuana-residents-stealing-concertina-barbed-wire-on-border-for-homes-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92928e113a504fbb564604-1334-667.jpg", "publishedAt": "2019-03-20T22:03:15Z", "content": "Voluminous bundles of concertina wires US troops strung up around ports of entry on the US-Mexico border have drawn criticism for being displays of security theater that serve no real purpose. \r\n But residents in Tijuana, which recently topped a list of the m… [+3994 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Ellen Knickmeyer), Ellen Knickmeyer", "title": "Want to see results of water tests for a dangerous contaminant at Army installations? That'll be $290,400", "description": "US Army/Spc. Calab Franklin WASHINGTON (AP) — The US Army has put a price tag on releasing the results of water tests for a dangerous contaminant at military installations: nearly $300,000. In a March 12 letter, the Army told the Environmental Working Group, …", "url": "https://www.businessinsider.com/army-bill-for-public-records-on-contaminant-about-300000-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92b705124d0451f43ac548-1334-667.jpg", "publishedAt": "2019-03-20T22:01:00Z", "content": "WASHINGTON (AP) — The US Army has put a price tag on releasing the results of water tests for a dangerous contaminant at military installations: nearly $300,000. \r\n In a March 12 letter, the Army told the Environmental Working Group, an advocacy group, that t… [+2802 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dennis Green", "title": "'We shouldn't be inviting bullies to our neighborhood': Alexandria Ocasio-Cortez defends her criticism of Amazon HQ2 in surprise Queens appearance (AMZN)", "description": "Rep. Alexandria Ocasio-Cortez spoke out about criticism of the opposition she took to the deal New York struck for Amazon's HQ2. At a community board meeting in Astoria, Queens, she answered a constituent's question with a lengthy response in which she emphas…", "url": "https://www.businessinsider.com/alexandria-ocasio-cortez-defends-amazon-hq2-criticism-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92b1c9daa50750d9784633-2732-1366.jpg", "publishedAt": "2019-03-20T21:55:40Z", "content": "Rep. Alexandria Ocasio-Cortez isn't done talking about Amazon and HQ2. \r\n The congresswoman made an appearance at a local community board meeting in Astoria, Queens, which is part of the New York congressional district that she represents, on Tuesday night. \r… [+3101 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "James Brains", "title": "This slow cooker lets you cook 3 dishes at once and keep food warm at parties — here's how it works", "description": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase. A high-quality slow cooker can be used for a variety of purposes, functions reliably, and it’s ea…", "url": "https://www.businessinsider.com/chefman-triple-slow-cooker-buffet-server-review", "urlToImage": "https://amp.businessinsider.com/images/5c92b50669e11c73a746fab5-960-480.jpg", "publishedAt": "2019-03-20T21:55:00Z", "content": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase. Slow cookers are a convenient way to make delicious home-cooked meals. As a work-from-home dad wh… [+5607 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Mosher", "title": "Satellites just photographed California's dazzling 'super bloom' of spring flowers from outer space", "description": "Parts of Southern California are experiencing \"super blooms\" of flowers. Walker Valley and the city of Lake Elsinore, located about 50 miles southeast of Los Angeles, has an ongoing super bloom of orange poppies. Tourists are clogging the valley's roads and c…", "url": "https://www.businessinsider.com/california-superbloom-spring-flowers-space-satellite-pictures-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92a28c01df725b4e5fa917-2560-1280.jpg", "publishedAt": "2019-03-20T21:54:00Z", "content": "The hot, dry hillsides of southern California are normally covered in drab desert scrub. But some of them harbor a colorful secret: Millions of flowers that wait for the perfect conditions to bloom. \r\n Over the past month, the just-right combination of ample … [+2059 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Reuters", "title": "Trump's border wall money may come at the expense of schools for military kids", "description": "AP Photo/Andrew Harnik A Pentagon proposal would see money for facilities for military children directed to President Donald Trump's border wall. Two-thirds of the $1.2 billion in question would be replaced later, but the idea of taking money from the childre…", "url": "https://www.businessinsider.com/trumps-border-wall-money-may-come-at-expense-of-schools-for-military-kids-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c23df6bbd77302f1f041648-1920-960.jpg", "publishedAt": "2019-03-20T21:41:00Z", "content": "WASHINGTON (Reuters) - The US Department of Defense is proposing to pay for President Donald Trump's much-debated border wall by shifting funds away from projects that include $1.2 billion for schools, childcare centers and other facilities for military child… [+3314 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "Oculus showed off a new design for its premium VR headset, but its features are not very ambitious (FB)", "description": "Oculus has announced the Oculus Rift S, an updated model of its Oculus Rift headset designed for use with personal computers. Starting at $399, the Oculus Rift S promises better visuals, improved tracking and a more comfortable headset design. The Oculus Rift…", "url": "https://www.businessinsider.com/oculus-rift-s-new-vr-design-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92ab3b003f5c503b55097e-2732-1366.jpg", "publishedAt": "2019-03-20T21:30:22Z", "content": "Oculus has revealed the Oculus Rift S, an update to the company's flagship virtual reality headset. The Oculus Rift S offers enhanced visuals compared the original Rift, improved tracking with no external sensors, and a new halo headband design similar to the… [+2438 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "Apple's new AirPods have better battery life and a cool new wireless charging case — you can preorder a pair now for $159 or $199", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/apple-airpods-2019-specs-price-availability", "urlToImage": "https://amp.businessinsider.com/images/5c92a72e401d584cb346edea-1536-768.jpg", "publishedAt": "2019-03-20T21:15:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+1533 chars]"}]}