{"status": "ok", "totalResults": 3613, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "Here are the 10 biggest healthcare startups that have shut down and taken hundreds of millions of investors' money with them", "description": "Not every healthcare startup that manages to raise tens or hundreds of millions ends up working out, for one reason or another. Theranos, Drugstore.com, and sleep-tracker Hello are among the healthcare startups that have closed down in the past five years. He…", "url": "https://www.businessinsider.com/theranos-and-other-healthcare-startups-that-failed-and-why-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8c0af05b066e5dfe00464d-1136-568.jpg", "publishedAt": "2019-03-20T13:01:00Z", "content": "When Theranos, the beleaguered blood-testing company that's now the subject of a book, documentaries, and a podcast, closed its doors in 2018, it joined a crop of healthcare startups that ultimately didn't live up to investors' lofty expectations. \r\n While no… [+372 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Nathaniel Lee and Benji Jones", "title": "A dietitian explains which non-dairy milks are best for you", "description": "More people are buying non-dairy milk like soy, almond, and oat — the market grew 62% between 2012 and 2018. That's great for the roughly five billion people who are lactose intolerant. But with so many varieties now crowding the dairy aisle, it's hard to kno…", "url": "https://www.businessinsider.com/non-dairy-milk-health-dietitian-coconut-soy-almond-rice-oat-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91616b6123ca3de620cbb3-2732-1366.jpg", "publishedAt": "2019-03-20T13:00:00Z", "content": "Following is a transcript of the video.\r\nGroetch: The rice milk and the coconut milk and the almond milk are very low in protein. So if you're looking to get a protein source like a vegetarian or plant-based protein source, these are not very good. \r\nNarrator… [+3226 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "Apple just launched new AirPods with wireless charging and hands-free Siri", "description": "Apple announced a new version of AirPods on Wednesday that offers improved performance and the ability to summon Siri hands-free. They're launching today on Apple's online store and will be in its brick-and-mortar retail stores starting next week. The refresh…", "url": "https://www.businessinsider.com/apple-airpods-2-release-date-price-features-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92367569bdec3bfc6b3518-1536-768.jpg", "publishedAt": "2019-03-20T12:54:02Z", "content": "Apple announced a new version of AirPods on Wednesday that offers improved performance and the ability to summon Siri hands-free. They're launching today on Apple's online store and will be in its brick-and-mortar retail stores starting next week. \r\n The refr… [+827 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Price and Shana Lebowitz", "title": "Mark Zuckerberg uses a quick test to make sure he's hiring the best people at Facebook (FB)", "description": "Mark Zuckerberg, CEO of Facebook, has said that he asks himself the same question every time he's considering a new hire. That question is: Would I work for this person? Facebook executives have also said they want candidates who put the company's needs above…", "url": "https://www.businessinsider.com/mark-zuckerberg-tip-for-hiring-employees-2015-3", "urlToImage": "https://static.businessinsider.com/image/5c9239846123ca48b5372247-750.jpg", "publishedAt": "2019-03-20T12:46:00Z", "content": "Mark Zuckerberg, pictured, is picky about his new hires.\r\n REUTERS/Charles Platiau/File Photo \r\nFacebook cofounder and CEO Mark Zuckerberg built his company from scratch. Today, the company boasts a market cap of $481 billion and roughly 1.52 billion daily us… [+1653 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alexandra Ma", "title": "Donald Trump Jr. slammed Britain for lack of progress with Brexit, and said it has fallen prey to the same 'deep-state' forces opposing his father", "description": "Donald Trump Jr. criticized the UK's Brexit negotiations and suggested that the country had fallen prey to \"deep-state operatives\" working to \"subvert the will of the people.\" British Prime Minister Theresa May is struggling to get her deal to leave the EU pa…", "url": "https://www.businessinsider.com/donald-trump-jr-slams-uk-over-brexit-says-it-is-prey-to-deep-state-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c922ebe69e11c5ab46e6784-1920-960.jpg", "publishedAt": "2019-03-20T12:45:41Z", "content": "Donald Trump Jr. slammed the UK over its lack of progress on Brexit, suggesting that the country had fallen prey to \"deep-state operatives\" working to \"subvert the will of the people.\" \r\n In a op-ed published Wednesday in Britain's Daily Telegraph newspaper —… [+3475 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kamran Rosen", "title": "Saving money is a good start, but where you keep those savings can matter even more", "description": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, but our reporting and recommendations are always independent and objective. One of the …", "url": "https://www.businessinsider.com/where-to-save-money", "urlToImage": "https://amp.businessinsider.com/images/5c87c10d26289855c17cc963-1920-960.jpg", "publishedAt": "2019-03-20T12:45:00Z", "content": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, but our reporting and recommendations are always independent and objective. Saving mone… [+5998 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jeremy Berke", "title": "The FDA is putting together a group of experts to figure out how to handle the $1 billion CBD industry", "description": "The FDA is putting together a working group to clarify the agency's stance on CBD, outgoing commissioner Scott Gottlieb said in an interview on Tuesday. The working group will be charged with developing a legislative pathway for Congress to allow the cannabis…", "url": "https://www.businessinsider.com/fda-is-putting-together-a-cbd-working-group-led-by-amy-abernethy-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9163ec6123ca3e2378557b-750-375.jpg", "publishedAt": "2019-03-20T12:38:00Z", "content": "The Food and Drug Administration wants to clear up the uncertainty surrounding one of the hottest consumer trends of 2019: CBD. \r\n The FDA is putting together a working group that will be charged with clarifying the agency's stance on the cannabis-derived com… [+3639 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Beatrice Christofaro", "title": "A record 61% of Americans now want weed to be legalized across the US, with support rising in every age group", "description": "A record 61% of Americans say weed should be legalized, according to the respected General Social Survey. Support has grown across all age groups, US regions and political affiliations. Growing support has seen all 2020 presidential candidates backing legaliz…", "url": "https://www.businessinsider.com/61-of-us-supports-legal-weed-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c922b45401d5838df2f3e93-1136-568.png", "publishedAt": "2019-03-20T12:10:57Z", "content": "A record 61% of Americans say pot should be legalized, according to the respected General Social Survey (GSS). \r\n The poll, which has tracked support for legal marijuana since 1973, found that approval reached an all-time high across all age groups, US region… [+2512 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Adam Bienkov", "title": "Theresa May asks the EU to delay Brexit until June 30", "description": "LONDON — Theresa May has written to the EU requesting a three-month extension of Article 50, meaning Brexit could not take place until June 30. The prime minister wrote to European Commission president Donald Tusk on Wednesday morning requesting a short delay…", "url": "https://www.businessinsider.com/theresa-may-brexit-delay-letter-donald-tusk-article-50-extension-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9218794f07ae4e0416c7c2-960-480.jpg", "publishedAt": "2019-03-20T12:09:28Z", "content": "LONDON — Theresa May has written to the EU requesting a three-month extension of Article 50, meaning Brexit could not take place until June 30. \r\n The prime minister wrote to European Commission president Donald Tusk on Wednesday morning requesting rhe delay … [+2324 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alexandra Ma", "title": "4chan, 8chan, and LiveLeak blocked by Australian internet providers for hosting the livestream of New Zealand mosque shootings", "description": "Platforms including 4chan, 8chan, and LiveLeak hosted footage of the New Zealand mosque attacks that killed 50 people last week. In response, a number of internet service providers in Australia temporarily blocked sites that hosted the videos. \"We believe it'…", "url": "https://www.businessinsider.com/new-zealand-shootings-isps-block-4chan-8chan-liveleak-over-stream-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c922574f73f5c36f556d145-1136-568.jpg", "publishedAt": "2019-03-20T11:40:38Z", "content": "Internet service providers in Australia blocked platforms including 4chan, 8chan, and LiveLeak after the sites were found hosting footage of the New Zealand mosque shootings that killed 50 people last week. \r\n Vodafone Australia, TPG, Telstra, and Optus block… [+3310 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jake Kanter and Isobel Asher Hamilton", "title": "Google fined $1.7 billion over a third breach of EU antitrust rules in as many years", "description": "Google has been punished with a third fine by the European Union in as many years. The Alphabet-owned company was fined €1,49 billion ($1.7 billion) on Wednesday by European Competition Commissioner Margrethe Vestager over anticompetitive practices related to…", "url": "https://www.businessinsider.com/google-fined-17-billion-for-breaking-eu-antitrust-rules-over-adsense-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9201e24f07ae4c9e28b272-1136-568.jpg", "publishedAt": "2019-03-20T11:08:09Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jonathan Garber", "title": "10 things you need to know before the opening bell (SPY, SPX, QQQ, DIA, DIS, BA, FDX)", "description": "Here is what you need to know. Here comes the Fed. Traders see just a 0.8% chance the Fed hikes rates at the conclusion of Wednesday's meeting, according to Bloomberg data, and will be on the lookout for any clues about the central bank's rate-hike path going…", "url": "https://www.businessinsider.com/stock-market-news-opening-bell-march-20-2018-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c921dd7003f5c3abe36f52d-2732-1366.jpg", "publishedAt": "2019-03-20T11:05:00Z", "content": "Here is what you need to know. \r\n Here comes the Fed. Traders see just a 0.8% chance the Fed hikes rates at the conclusion of Wednesday's meeting, according to Bloomberg data, and will be on the lookout for any clues about the central bank's rate-hike path go… [+1643 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Hosie", "title": "The Venetian hotel in Las Vegas is offering a $450,000 package complete with a private jet, butler, and cake adorned with a diamond necklace", "description": "The Venetian hotel in Las Vegas has launched an incredibly lavish package called \"Want The World.\" The luxury hotel 's extravagant offering costs $450,000 for four nights. That's $112,500 a night. It includes private jet travel, a personal butler, a stay in t…", "url": "https://www.businessinsider.com/venetian-hotel-want-the-world-package-private-jet-butler-diamond-necklace-cake-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c92154ff73f5c360e2e1d35-1920-960.jpg", "publishedAt": "2019-03-20T11:00:00Z", "content": "If there's any city in the world that embodies \"more is more,\" it's Las Vegas. \r\n And if you're after not just the ultimate in luxury but also, well, anything you want, one of the city's most famous hotels has just launched the package for you. \r\nThe Venetian… [+2936 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sinéad Baker", "title": "A cockpit voice recording from doomed Lion Air 737 Max shows pilots scoured the plane's manual to fix its fatal dive, but couldn't find the right procedure in time", "description": "The pilots of a Lion Air Boeing 737 Max 8 plane which crashed in October 2018 desperately read an emergency handbook in an attempt to find a way to control the plane before its fatal accident. Both the captain and the first officer scoured the handbook to try…", "url": "https://www.businessinsider.com/lion-air-cockpit-recording-captains-searched-manual-try-stop-crash-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c010d29cc0f471207718842-1536-768.jpg", "publishedAt": "2019-03-20T10:36:36Z", "content": "The pilots of the doomed Lion Air flight which crashed into the Java Sea last October frantically searched the aircraft's manual to try to find a way to keep the plane under control before the crash, cockpit voice recordings show. \r\n The first officer reporte… [+3191 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Trista Kelley", "title": "Germany first? Europe's biggest economy looks more protectionist by the day", "description": "Germany is planning a state-owned fund to block unwanted takeovers by Chinese and other foreign firms. It's the latest move against free trade after propping up its banks and banning short selling that targeted one of its companies. \"Germany was too reluctant…", "url": "https://www.businessinsider.com/germany-protectionism-short-selling-ban-deutsche-bank-merger-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91fb465dfa9943e12afd12-2732-1366.jpg", "publishedAt": "2019-03-20T10:36:31Z", "content": "Germany is looking more and more protectionist and anti-free market by the day. In the latest step to shore up the corporate engine of its economy, the government is planning to create a state-owned fund so it can block unwanted takeovers by Chinese and other… [+2868 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Mark Zuckerberg and other tech CEOs under mounting pressure to speak out over New Zealand mosque shootings", "description": "Big tech is coming under renewed political pressure following the mass shootings at two New Zealand mosques on Friday. The attack was livestreamed on Facebook before spreading like wildfire online, leaving tech companies scrambling to block the footage. The C…", "url": "https://www.businessinsider.com/tech-firms-under-pressure-over-new-zealand-mosque-shooting-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c6aabb7598e232721796503-2732-1366.jpg", "publishedAt": "2019-03-20T10:24:25Z", "content": "Facebook, Google, Twitter, and Microsoft are all coming under mounting political pressure to answer questions following the mass shootings at two mosques in Christchurch, New Zealand on Friday. \r\n The attack was livestreamed on Facebook before spreading like … [+1919 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Business Insider", "title": "PRESENTING: The 15 European fintechs VCs think will blow up in 2019", "description": "Business Insider spoke with some of the most prominent voices in venture capital to pick out the most exciting companies in the European financial technology industry this year. The experts also highlighted what to look out for going forward. Major fintech na…", "url": "https://www.businessinsider.com/the-15-european-fintechs-vcs-think-will-blow-up-in-2019-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c90f18569e11c3587097923-2732-1366.jpg", "publishedAt": "2019-03-20T10:04:45Z", "content": "Business Insider spoke with some of the most prominent voices in venture capital to pick out the most exciting companies in the European financial technology industry this year. The experts also highlighted what to look out for going forward. \r\n Major fintech… [+364 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "The world's best-performing mutual fund features Juul Labs as its top holding. Here are its 12 other biggest bets. (GOOGL, MSFT, AMZN)", "description": "The Fidelity Advisor Growth Opportunities Fund is beating out the rest of its mutual fund peers over the past 12 months, according to Kiplinger, returning 27%. Juul Labs, the private e-cigarette maker, is the fund's top holding. Markets Insider has compiled s…", "url": "https://www.businessinsider.com/fagax-fidelity-advisor-growth-opportunities-top-ranked-mutual-fund-biggest-holdings-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9005055b066e12451c052f-1920-960.jpg", "publishedAt": "2019-03-20T10:03:00Z", "content": "The largest holding in the top-performing large stock mutual fund isn't a publicly traded stock at all. \r\n The Fidelity Advisor Growth Opportunities Fund is beating out the rest of its peers over the course of the last year, returning 27% in that time, accord… [+2034 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Akin Oyedele", "title": "A former Tesla investor explains why he thinks Elon Musk is the wrong person to lead the company, why he dumped the stock, and what he’s now buying instead (TSLA)", "description": "Tesla's Feb. 28 announcement that it will close all physical stores was so unexpected that it prompted one registered investment advisor to dump its entire stake in the company. Tesla has since reversed its decision, but Alex Chalekian — the CEO of Lake Avenu…", "url": "https://www.businessinsider.com/tesla-stock-investor-sells-stake-elon-musk-commentary-what-hes-buying-instead-alex-chalekian-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a7b60ffcdab5f622c8b4709-750-375.jpg", "publishedAt": "2019-03-20T09:58:00Z", "content": "Alex Chalekian weighed selling his firm's stake in Tesla for a whole year before finally pulling the trigger on March 1. \r\n The founder and CEO of Lake Avenue Financial didn't wait for that long because he couldn't find excuses to sell. After all, the electri… [+2869 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Isobel Asher Hamilton", "title": "Google will let Android users choose a rival browser to avoid further wrath from the EU", "description": "Google is going to make it easier for Android users in Europe to select competing browsers and search apps. It follows Google being fined a record $5 billion last year after it was found in breach antitrust laws for abusing the dominance of its Android operat…", "url": "https://www.businessinsider.com/google-to-let-android-users-choose-a-rival-browser-and-search-app-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c47c0512bdd7f55ce06ed44-2732-1366.jpg", "publishedAt": "2019-03-20T09:39:15Z", "content": "Google is rolling out a major change to its Android phones after being found in breach of EU antitrust laws last year — and ahead of a suspected new penalty later on Wednesday. \r\n In July 2018, the EU's antitrust watchdog slapped Google with a $5 billion fine… [+1891 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Callum Burroughs", "title": "US and China plan high level trade talks amid fears tariff war could wipe $1 trillion off economy", "description": "US and Chinese officials are set to meet for high level talks with hopes of securing a deal at the end of April after a difficult patch of negotiating. Tensions were raised after the US Chamber of Commerce indicated that should tariffs increase, $1 trillion c…", "url": "https://www.businessinsider.com/trade-war-us-and-china-plan-talks-amid-1-trillion-economic-hit-fears-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91fabee0575a375c530ef4-1536-768.jpg", "publishedAt": "2019-03-20T09:21:50Z", "content": "Hopes for a US-China trade war deal have been boosted by confirmation that high level talks will continue despite recent difficulties. \r\n The ongoing dispute has been shaky in recent months after President Trump's abrupt decision to re-engage North Korea on d… [+1723 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Bayer plunges after jury finds its Roundup weedkiller caused cancer", "description": "Bayer's shares dropped 12% after a jury found a customer developed cancer from using its Roundup weed-killer. The finding comes after another jury found Bayer's Monsanto unit failed to warn customers of the potential cancer risks of its weed-killers. Shares i…", "url": "https://www.businessinsider.com/bayer-plunges-after-jury-finds-its-roundup-weedkiller-caused-cancer-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c920342e0575a37bb42ab94-750-375.jpg", "publishedAt": "2019-03-20T09:16:51Z", "content": "Shares in Bayer plunged 12% in morning trading after a San Francisco jury found one of its customers developed cancer after using its Roundup weed killer in his yard. \r\n The decision strikes another blow to the German pharmaceuticals group. In August, a jury … [+1350 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Theron Mohamed", "title": "Bayer plunges after jury finds its Roundup weedkiller caused cancer", "description": "Bayer's shares dropped 12% after a jury found a customer developed cancer from using its Roundup weed-killer. The finding comes after another jury found Bayer's Monsanto unit failed to warn customers of the potential cancer risks of its weed-killers. Shares i…", "url": "https://markets.businessinsider.com/news/stocks/bayer-plunges-after-jury-finds-its-roundup-weedkiller-caused-cancer-2019-3-1028044328", "urlToImage": "https://images.markets.businessinsider.com/image/5c920230daa507396e6a7c53-800/eu-lawmakers-demand-five-year-phase-out-of-weedkiller-glyphosate.jpg", "publishedAt": "2019-03-20T09:16:51Z", "content": "Thomson Reuters\r\nShares in Bayer plunged 12% in morning trading after a San Francisco jury found one of its customers developed cancer after using its Roundup weed killer in his yard.\r\nThe decision strikes another blow to the German pharmaceuticals group. In … [+1359 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Mosher", "title": "The first day of spring is finally here for about 90% of us. Here's how equinoxes drive the changing seasons.", "description": "This year's spring or vernal equinox will happen on Wednesday, March 20. Earth's rotation does not cause the spring equinox. Rather, equinoxes occur because the planet has a tilted axis. Spring comes when the sun's warming rays line up perpendicular to Earth'…", "url": "https://www.businessinsider.com/when-is-first-day-of-spring-march-equinox-2019-03", "urlToImage": "https://amp.businessinsider.com/images/5c1cfe3ecf0795444b388143-1536-768.png", "publishedAt": "2019-03-20T08:01:00Z", "content": "The year's spring equinox, also called the March or vernal equinox, falls on Tuesday at precisely 5:58 p.m. ET, according to NASA. \r\n This astronomical event signals the arrival of spring, winter's end, and the trend toward increasingly warm and bright days t… [+3537 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "10 things in tech you need to know today", "description": "Good morning! This is the tech news you need to know this Wednesday. Google announced a huge gaming initiative: A Netflix-like video-game streaming platform named Stadia. The service is intended to run high-resolution blockbuster games on any device that runs…", "url": "https://www.businessinsider.com/10-things-in-tech-you-need-to-know-today-march-20-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9186ea01df7240bd146fd3-2732-1366.jpg", "publishedAt": "2019-03-20T07:58:22Z", "content": "Google CEO Sundar Pichai.\r\n REUTERS/Stephen Lam \r\nGood morning! This is the tech news you need to know this Wednesday. \r\nGoogle announced a huge gaming initiative: A Netflix-like video-game streaming platform named Stadia. The service is intended to run high-… [+3028 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Adam Bienkov", "title": "Theresa May abandons request for long Brexit delay after Cabinet revolt", "description": "Theresa May abandons plan to seek a long Brexit delay. Downing Street confirm she will now only seek a short extension of around 3 months. Any longer extension would require Britain to take part in European Parliament elections and could come with conditions,…", "url": "https://www.businessinsider.com/theresa-may-abandons-plan-for-long-brexit-delay-after-cabinet-revolt-article-50-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91eba069e11c57191ef133-960-480.jpg", "publishedAt": "2019-03-20T07:37:23Z", "content": "LONDON — Theresa May has abandoned her plan to request a lengthy delay to Brexit of up to two years after a threatened revolt from her Cabinet. \r\n The prime minister had been intending to write to European Council President Donald Tusk on Wednesday to demand … [+1098 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Associated Press", "title": "Disney closes $71 billion deal for 21st Century Fox — and it's likely to shake up the media landscape - Business Insider", "description": "Disney closes $71 billion deal for 21st Century Fox — and it's likely to shake up the media landscape Business Insider Disney aims to better compete with technology companies such as Amazon and Netflix.", "url": "https://www.businessinsider.com/disney-acquires-fox-71-billion-dollar-deal-2019-3", "urlToImage": "https://amp.businessinsider.com/images/59724529552be5b3008b5d3c-2560-1280.jpg", "publishedAt": "2019-03-20T05:04:26Z", "content": "Disney has closed its $71 billion acquisition of Fox's entertainment business, putting \"Cinderella,\" ''The Simpsons,\" ''Star Wars\" and \"Spider-Man\" under one corporate roof. \r\n The deal is likely to shake up the media landscape. Among other things, it paves t… [+2954 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Meghan Morris", "title": "4 portfolio managers have exited asset management giant Nuveen after their funds took a hit in 2018", "description": "Four portfolio managers have left $930 billion asset manager Nuveen. James Diedrich, Harold Goldstein, Mark Traster, and Derek Sadowsky exited three funds with a collective $1.7 billion in assets. A Nuveen spokesman said: “We routinely evaluate our organizati…", "url": "https://www.businessinsider.com/four-portfolio-managers-overseeing-17-billion-have-left-nuveen-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9151405dfa9939af1f5876-1920-960.jpg", "publishedAt": "2019-03-20T02:31:18Z", "content": "Four portfolio managers have left Nuveen, the $930 billion asset manager, according to a person familiar with the matter. \r\n James Diedrich, Harold Goldstein, Mark Traster, and Derek Sadowsky are no longer leading three equity funds with a collective $1.7 bil… [+1631 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "David Choi", "title": "An off-duty pilot reportedly prevented a Boeing 737 Max 8 crash, one day before the same plane crashed and killed 189 passengers and crew (BA)", "description": "An off-duty pilot riding in the cockpit of a Boeing 737 Max 8 fixed a malfunction during the second-to-the-last flight for the aircraft, before a different flight on the same plane crashed in the Java Sea the next day, Bloomberg reported on Tuesday evening. T…", "url": "https://www.businessinsider.com/lion-air-crash-off-duty-pilot-saved-boeing-737-max-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c080edae60d4f0b27474d56-2732-1366.jpg", "publishedAt": "2019-03-20T01:02:26Z", "content": "An off-duty pilot riding in the cockpit of a Boeing 737 Max 8 fixed a malfunction during the second-to-the-last flight for the aircraft before it crashed into the Java Sea the next day, two people with knowledge of the investigation said in a Bloomberg report… [+1575 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alexei Oreskovic", "title": "Google's weird name and logo for its new gaming service is part of a clever disappearing act (GOOG, GOOGL)", "description": "Google's new game streaming service is called Stadia. It's an apt name with a pretty logo, but it's missing something. Looking at the Stadia logo, you'd never know it was part of Google — and there's a good reason for that. Google took the wraps off its game …", "url": "https://www.businessinsider.com/the-real-reason-google-gaming-service-called-stadia-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9186ea01df7240bd146fd3-2732-1366.jpg", "publishedAt": "2019-03-20T00:51:37Z", "content": "Google took the wraps off its game streaming service on Tuesday with a barrage of fanfare, high-octane demos and a shiny new name and logo. \r\n Meet: Stadia. \r\n As far as names go, it's not bad. According to the Cambridge Dictionary, Stadia is a plural form of… [+4004 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matt Weinberger", "title": "I tried Stadia, Google's big play to conquer video games. It's really promising, but there's still too much we don't know. (GOOG, GOOGL)", "description": "I got to try Google Stadia, its new video game streaming service that promises to use the cloud to deliver games to almost any device with a screen — including laptops, tablets, smartphones, and TVs. In the short demo, I got to try \"Assassin's Creed Odyssey,\"…", "url": "https://www.businessinsider.com/google-stadia-hands-on-impressions-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91874d113a5038e6078aa2-2560-1280.jpg", "publishedAt": "2019-03-20T00:38:16Z", "content": "On Tuesday, Google unveiled Stadia, its ambitious new platform that promises to stream blockbuster, graphics-intensive video games to almost any device with an internet connection — TVs, smartphones, tablets, you name it. \r\n That's a big promise. \r\n But after… [+5105 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paige Leskin", "title": "Theranos founder Elizabeth Holmes used a deep baritone voice at almost all times, but former insiders say it was faked", "description": "Elizabeth Holmes, founder of the blood-testing startup Theranos, is the subject of a new HBO documentary called \"The Inventor: Out for Blood in Silicon Valley.\" The coverage of Holmes — including the HBO documentary, a nonfiction book, and a podcast series — …", "url": "https://www.businessinsider.com/theranos-founder-elizabeth-holmes-deep-voice-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5aa94ccd3be59f19008b475c-2732-1366.jpg", "publishedAt": "2019-03-20T00:37:46Z", "content": "By several accounts, Elizabeth Holmes carefully crafted and maintained a persona while heading up her blood-testing startup Theranos — including adopting a distinctively deep voice that former employees suspect she fabricated altogether. \r\n Holmes' quirks as … [+3817 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "The US could be guilty of war crimes in Somalia and has killed civilians under a 'shroud of secrecy,' according to a new report", "description": "The US government could be guilty of war crimes in Somalia after evidence of civilian casualties was uncovered in an investigation led by Amnesty International. The investigation found that US airstrikes from both drones and manned aircraft killed at least 14…", "url": "https://www.businessinsider.com/the-us-could-be-guilty-of-war-crimes-in-somalia-report-says-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9177414f07ae46f54bc553-1920-960.jpg", "publishedAt": "2019-03-20T00:01:00Z", "content": "The US military could be guilty of war crimes in Somalia, according to a new report that challenges what the government says about civilian casualties from its bombing campaign against al-Shabab, an al-Qaida affiliate, in the African nation. \r\n The investigat… [+4462 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Troy Wolverton", "title": "An internet pioneer is doubtful Mark Zuckerberg can refocus Facebook on privacy. Here's why. (FB)", "description": "Internet pioneer Paul Vixie is dubious about Facebook CEO Mark Zuckerberg's plan to create a \"privacy focused\" social networking platform. Vixie, the CEO of Farsight securities, has worked on privacy and security issues for decades. The concepts of \"private\" …", "url": "https://www.businessinsider.com/paul-vixie-dubious-facebook-mark-zuckerberrg-privacy-plan-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9170545b066e35e97ca534-1920-960.jpg", "publishedAt": "2019-03-19T23:12:23Z", "content": "When it comes to Mark Zuckerberg's plan to transform Facebook by emphasizing \"privacy-focused\" social networking, count Paul Vixie as a skeptic. \r\n The concepts of private and social are, by their nature, at odds with one another, says Vixie, the CEO of Farsi… [+3867 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "African cities are running out of water, and the continent needs $66 billion to avoid a crisis of disease and dehydration", "description": "African cities are experiencing devastating water shortages as their populations continue to grow. These water shortages have led to sanitation problems, which can contribute to the incidence of diseases like cholera and typhoid fever. The African Development…", "url": "https://www.businessinsider.com/african-cities-water-crisis-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c916125e0575a30521042dd-2732-1366.jpg", "publishedAt": "2019-03-19T23:09:00Z", "content": "One of every three people in Africa is affected by water scarcity— the circumstance in which a region's available water supply isn't enough to meet demand. \r\n In nations like Ghana, Mozambique, and Zimbabwe, water shortages can raise people's risk of getting … [+1947 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Brodwin and Aylin Woodward", "title": "12 facts that show why bottled water is one of the biggest scams of the century", "description": "Nearly 780 million people worldwide do not have access to a source of clean water (water that flows through a household connection, borehole, well, or protected spring). In the US, 99.2% of the country has access to clean tap water, but many Americans chose t…", "url": "https://www.businessinsider.com/bottled-water-facts-science-healthy-2017-4", "urlToImage": "https://amp.businessinsider.com/images/599d5570289cc621008b4866-1136-568.jpg", "publishedAt": "2019-03-19T23:01:00Z", "content": "In 2016, 4 billion pounds of plastic was used in US bottled water production.\r\n Flickr/Vlad B. \r\nA gallons worth of single-serve bottled water costs almost $9.50.\r\n Shutterstock \r\n There's nothing quite like the feeling of pure, ice-cold hydration. \r\n While s… [+1778 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rosalie Chan", "title": "Atlassian's first VP of product explains why he couldn't pass up the opportunity to join the $26.9 billion company, even if it meant uprooting to Australia (TEAM)", "description": "In January, Atlassian hired its first vice president of product Noah Wasmer, who joins Atlassian from VMware. As the vice president of product and head of technical teams, Wasmer will head Atlassian 's software and IT products, including Jira, Bitbucket, Opsg…", "url": "https://www.businessinsider.com/atlassian-hires-first-vice-president-of-product-to-lead-jira-bitbucket-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c915fabf73f5c2e233cf041-1334-667.jpg", "publishedAt": "2019-03-19T22:58:34Z", "content": "For years, Noah Wasmer worked in the Silicon Valley tech scene before moving to Atlanta. But now, he's made an even bigger move: uprooting to Sydney, Australia, where he can surf at a beach one block away from his house, take the ferry to work, and serve as A… [+5463 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bob Bryan", "title": "Ivanka Trump reportedly used a workaround to get access to Air Force planes after being rejected. 68% of Americans surveyed think someone who uses the same workaround should be punished.", "description": "According to the new book \"Kushner, Inc.\" by journalist Vicky Ward, White House senior advisers Jared Kushner and Ivanka Trump attempted to exert influence over trips funded by the State Department. Ward also reported that when then-Secretary of State Rex Til…", "url": "https://www.businessinsider.com/ivanka-trump-jared-kushner-air-force-flights-poll-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91672adaa50732d270291d-1536-768.jpg", "publishedAt": "2019-03-19T22:55:59Z", "content": "A significant majority of Americans do not approve of the workaround White House senior adviser Ivanka Trump reportedly used to gain access to the use of Air Force planes, according to a new INSIDER poll. \r\n According to journalist Vicky Ward's new book \"Kush… [+2909 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Thousands of female economists say they've been sexually assaulted or discriminated against by colleagues", "description": "In a new survey, women working in the economics field described a workplace that is hostile and even unsafe at times. More than 250 female economists said in the survey that a colleague had sexually assaulted them or attempted to do so over the past decade, w…", "url": "https://markets.businessinsider.com/news/stocks/thousands-female-economists-sexually-assaulted-discriminated-against-by-colleagues-2019-3-1028043420", "urlToImage": "https://images.markets.businessinsider.com/image/5a74fb995124c98f531bff87-800/feds-yellen-says-solid-economic-growth-means-more-rate-hikes-ahead.jpg", "publishedAt": "2019-03-19T22:54:20Z", "content": "Thomson Reuters\r\nIn a new survey, women working in the economics field described a workplace that is hostile and even unsafe at times.\r\nMore than 250 female economists said in the survey that a colleague had sexually assaulted them or attempted to do so over … [+4336 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gina Heeb", "title": "Thousands of female economists say they've been sexually assaulted or discriminated against by colleagues", "description": "In a new survey, women working in the economics field described a workplace that is hostile and even unsafe at times. More than 250 female economists said in the survey that a colleague had sexually assaulted them or attempted to do so over the past decade, w…", "url": "https://www.businessinsider.com/thousands-female-economists-sexually-assaulted-discriminated-against-by-colleagues-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c914c56e0575a2d3f0b5344-750-375.jpg", "publishedAt": "2019-03-19T22:54:20Z", "content": "Female economists have for years dealt with pervasive sexual misconduct and discrimination in workplaces across the US, according to a new report highlighting unequal treatment in a field dominated by white men. \r\n In an American Economic Association survey r… [+3935 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Francesca Rea", "title": "6 inexpensive products I use to give myself a salon-grade manicure at home", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/at-home-manicure-nail-products-on-a-budget", "urlToImage": "https://amp.businessinsider.com/images/5c8ff69969e11c22d8359dc6-750-375.jpg", "publishedAt": "2019-03-19T22:25:00Z", "content": "After you've filed the edge of our nails (which, by the way, you can use one side of this block for), it's time to buffer the tops of them so your nail polish goes on smooth. I'm guilty of committing the age old sin of nail biting, so thin layers of my nail p… [+1152 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "Bernie Sanders' 2020 campaign has been quietly getting advice from journalist David Sirota for months, even as he relentlessly attacked other Democratic candidates, and now he's the senator's speechwriter", "description": "David Sirota, a journalist who's been tapped as Sen. Bernie Sanders' 2020 speechwriter, was working for the campaign in an unofficial capacity for months as he simultaneously attacked other Democratic candidates on Twitter. According to The Atlantic, Sirota d…", "url": "https://www.businessinsider.com/bernie-sanders-david-sirota-speechwriter-attacked-democrats-unofficial-employee-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c916399daa507329833a3c7-2732-1366.jpg", "publishedAt": "2019-03-19T22:22:14Z", "content": "Sen. Bernie Sanders' new speechwriter for his 2020 campaign has been attacking other 2020 Democratic candidates nonstop for months as an unofficial employee. \r\n David Sirota, a journalist known for his unabashed progressive politics and vicious Twitter-takedo… [+3502 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lucia Moses", "title": "Apple News jitters, Instagram goes shopping, and chatbots rise again", "description": "Hello! Thanks for subscribing. If you got this newsletter forwarded, sign up for your own here. In less than a week, Apple is set to announce a range of services including an all-you-can-read subscription news bundle, and it’s causing a lot of angst for publi…", "url": "https://www.businessinsider.com/advertising-and-media-insider-newsletter-march-20-2019-3", "urlToImage": "https://static.businessinsider.com/image/5c916967401d58308f5ae6c9-750.jpg", "publishedAt": "2019-03-19T22:21:27Z", "content": "Getty \r\nHello! \r\nThanks for subscribing. If you got this newsletter forwarded, sign up for your own here.\r\n In less than a week, Apple is set to announce a range of services including an all-you-can-read subscription news bundle, and it's causing a lot of ang… [+4218 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Yelena Shuster, Contributor", "title": "Long before I became an admissions essay coach, I was an immigrant kid figuring out college applications on my own — and that’s why the admissions scandal upsets me", "description": "Yelena Shuster is an essay coach who helps students through the college admissions process. She says that process has always been one of privilege and pressure, stress and success — which is why the college admissions scandal comes as no surprise. As the daug…", "url": "https://www.businessinsider.com/an-admissions-coach-shares-thoughts-on-the-college-admissions-scandal-2019-3", "urlToImage": null, "publishedAt": "2019-03-19T22:07:09Z", "content": "In today's competitive college-industrial complex, it's no surprise celebrities and the well-connected are accused of Photoshopping their kids' way into the top schools. The college admissions process has always been one of privilege and pressure, stress and … [+4404 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Erin Brodwin", "title": "Regulators just approved a new depression drug with the potential to be a game-changer (SAGE)", "description": "On Tuesday, federal regulators approved the second new antidepressant this month after 35 years of little progress combatting the disease. An injection called Zulresso, the new drug treats post-partum depression (PPD). PPD occurs after childbirth and is thoug…", "url": "https://www.businessinsider.com/fda-approves-new-depression-drug-brexanalone-zulresso-post-partum-sage-2018-12", "urlToImage": "https://amp.businessinsider.com/images/5be6080b01b12d1b5f6216cf-1536-768.jpg", "publishedAt": "2019-03-19T21:50:27Z", "content": "Federal regulators have just given the green light to a second new kind of antidepressant this month, after decades of little progress combating the disease. \r\n The US Food and Drug Administration on Tuesday approved an injection branded Zulresso that is made… [+6238 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lucia Moses", "title": "Forbes is charging $9 a month for a new video education program that takes a page from MasterClass", "description": "Forbes is launching an $8.99-a-month video network for entrepreneurs, Forbes8. It's the latest example of a publisher jumping on the direct consumer revenue train to supplement its ad revenue. Forbes is pushing into an e-learning area with already-established…", "url": "https://www.businessinsider.com/forbes-charging-9-a-month-for-new-video-education-program-forbes8-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c915cc9124d0433726f75e8-1920-960.jpg", "publishedAt": "2019-03-19T21:36:36Z", "content": "To grow its consumer revenue, Forbes is taking a page from the success of video-learning behemoths like MasterClass and Real Vision. \r\n On Monday, the company announced Forbes8, a subscription digital video network that pitches itself as \"Entrepreneurial Insp… [+2906 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "Google just unveiled Stadia, its ambitious attempt to upend the video game industry and take on Xbox and PlayStation. Here's everything we know (GOOG, GOOGL)", "description": "Google just announced a huge new gaming initiative: A Netflix-like video game streaming platform named Stadia. The service is intended to run high-resolution, blockbuster games on any device that runs Google's Chrome — from smartphones to computers to TVs and…", "url": "https://www.businessinsider.com/google-console-stadia-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91432df73f5c28fd404c85-1136-568.jpg", "publishedAt": "2019-03-19T21:26:48Z", "content": "After years of rumors and speculation, Google officially detailed its plans to enter the video game business on Tuesday. \r\n Those plans start with a new service named Stadia, which Google CEO Sundar Pichai says will offer blockbuster games on any device that … [+565 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jason Guerrasio", "title": "Director Alex Gibney looks back on a career of profiling liars and shady characters, from Elizabeth Holmes to Lance Armstrong, and crowns the most despicable", "description": "For close to 40 years, Oscar-winning documentary filmmaker Alex Gibney has made movies about some of the most complex and controversial figures of the last century. He’s examined the maddening drive of Steve Jobs (“Steve Jobs: The Man in the Machine”), the ba…", "url": "https://www.businessinsider.com/director-alex-gibney-has-profiled-notorious-people-from-elizabeth-holmes-to-lance-armstrong-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91467369e11c49554e8bd6-1136-568.jpg", "publishedAt": "2019-03-19T21:14:48Z", "content": "For close to 40 years, Oscar-winning documentary filmmaker Alex Gibney has made movies about some of the most complex and controversial figures of the last century. \r\n He's examined the maddening drive of Steve Jobs (\"Steve Jobs: The Man in the Machine\"), the… [+841 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "The White House is reportedly expected to nominate a permanent FAA head soon — more than a year after the last one left", "description": "The White House is expected to nominate former Delta Air Lines executive Steve Dickson as the permanent head of the Federal Aviation Administration (FAA), The Wall Street Journal reports. The nomination announcement could occur as soon as Tuesday, according t…", "url": "https://www.businessinsider.com/white-house-expected-to-nominate-permanent-faa-head-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9150d8124d0431c044e5f3-1536-768.jpg", "publishedAt": "2019-03-19T21:06:20Z", "content": "The White House is expected to nominate former Delta Air Lines executive Steve Dickson as the permanent head of the Federal Aviation Administration (FAA), The Wall Street Journal reports. \r\n The nomination could be announced as soon as Tuesday, according to T… [+910 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanza Loudenback", "title": "There are 3 things to understand about investing if you want to make money in the stock market", "description": "Learning how to invest in stocks doesn't have to be complicated. The best place to start investing is typically in a retirement account, using low-cost index funds or a robo-advisor. Three factors affect how well your portfolio performs in the stock market: H…", "url": "https://www.businessinsider.com/how-to-invest-in-stocks", "urlToImage": "https://amp.businessinsider.com/images/5c911f8b6123ca313d047be9-1536-768.jpg", "publishedAt": "2019-03-19T21:01:00Z", "content": "Investing is anyone's game. And putting money in the stock market while you're young is one of the best — and easiest — ways you can set yourself up for a comfortable retirement. \r\n But the reality is many people, especially younger Americans, don't invest. M… [+3881 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Goggin", "title": "Kickstarter co-founder Perry Chen resigns as CEO after employees announce they're unionizing", "description": "Kickstarter's co-founder Perry Chen announced he would step down as the company's CEO hours after the company's staff announced that it would unionize. He will continue to be chairman of the board. Chen had a controversial tenure as CEO, which began in July 2…", "url": "https://www.businessinsider.com/kickstarter-perry-chen-resigns-as-ceo-co-founder-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9153e5003f5c306e3681d1-480-240.jpg", "publishedAt": "2019-03-19T20:56:00Z", "content": "Kickstarter co-founder Perry Chen announced Monday that he is stepping down as CEO following the announcement that staff at the company will attempt to form a union. \r\n \"I've decided to step away from the CEO position at Kickstarter to focus on high-level and… [+999 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "The White House's biggest annual economic report lists the alter-egos of Spider-man, Captain America, Batman, and a Game of Thrones' character as interns", "description": "The White House released the annual Economic Report of the President on Tuesday. The report lists interns by name, several of which are fictional characters from comic books and Game of Thrones, as well as actor John Cleese. The White House did not respond to…", "url": "https://www.businessinsider.com/white-house-report-lists-spider-man-batman-game-of-thrones-character-as-interns-2019-3", "urlToImage": "https://amp.businessinsider.com/images/576d3f21910584716f8cb284-1334-667.png", "publishedAt": "2019-03-19T20:31:36Z", "content": "WASHINGTON — The Economic Report of the President released on Tuesday by the White House lists several fictional comic book characters and actors as interns for the Council of Economic Advisers. \r\n Characters from Spider-Man, Batman, and actor John Cleese are… [+2182 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Julie Bort", "title": "Industry veteran Jade Raymond is in charge of turning Google into a major video game publisher — and that has huge ramifications (GOOG, GOOGL)", "description": "On Tuesday, Google announced Stadia, a new video game streaming service that could usher in a new era of cloud-based gaming. Jade Raymond, who Google recently hired as a vice president, will be leading the in-house teams creating games specifically for Stadia…", "url": "https://www.businessinsider.com/jade-raymond-google-stadia-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c913c0469bdec2b7c7e66e1-1136-568.jpg", "publishedAt": "2019-03-19T20:27:26Z", "content": "In Tuesday, Google announced its huge new push into gaming: a streaming service called Stadia, which it promises will bring high-quality games to just about any device. \r\n And in the last minutes of its hour-long keynote came its final big reveal: Jade Raymon… [+3594 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "142,000 people have signed a petition calling for TripAdvisor to 'stop covering up sexual assaults' after the company reportedly instructed a woman to write a review of the tour guide she said raped her", "description": "TripAdvisor is facing backlash for its response to reports of sexual assault. One woman started a petition that has been signed more than 142,000 times, calling for TripAdvisor to change its policies after she says she was raped by a tour guide she found thro…", "url": "https://www.businessinsider.com/tripadvisor-backlash-sexual-assault-response-2019-3", "urlToImage": "https://amp.businessinsider.com/images/59fa22a958a0c169008b5241-1920-960.jpg", "publishedAt": "2019-03-19T20:27:05Z", "content": "TripAdvisor is facing backlash for its response to women who reported sexual assaults linked to people and businesses they found through the service. \r\n As of Tuesday, more than 142,000 people have signed a Change.org petition calling for TripAdvisor to \"Stop… [+3124 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marissa Perino", "title": "Here's how much a beer will cost you in 10 of the world's most expensive cities", "description": "The Economist Intelligence Unit recently released its annual report calculating the cost of living across cities worldwide. The report lists the top 10 most expensive cities, including a three-way tie for the No. 1 spot between Singapore, Paris, and Hong Kong…", "url": "https://www.businessinsider.com/how-much-beer-costs-in-most-expensive-cities-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c914af0003f5c2f15396ea9-960-480.jpg", "publishedAt": "2019-03-19T20:21:00Z", "content": "Three cities currently share the title of most expensive city in the world — Paris, Hong Kong, and Singapore — and, across those cities, the average price for a beer ranges from $1.77 and $2.27. \r\n That's according to the Economist Intelligence Unit's Worldwi… [+699 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Antonio Villas-Boas", "title": "Google hid a reference to one of the oldest cheat codes in video game history on the back of its new Stadia controller", "description": "Google announced its new game-streaming platform, Stadia, along with a compatible controller on Tuesday at the 2019 Game Developers Conference. During the presentation, we noticed a popular gaming reference located on the back of Google's Stadia controller: T…", "url": "https://www.businessinsider.com/google-stadia-controller-konami-code-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91432df73f5c28fd404c85-1136-568.jpg", "publishedAt": "2019-03-19T20:20:31Z", "content": "Keen-eyed gamers who watched Google's announcement of its new Stadia game streaming service on Tuesday will surely have noticed a tribute to historic video game lore. \r\n The \"Konami Code\" is hidden in plain sight on the back of Google's new Stadia controller.… [+774 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Goggin", "title": "Staff at crowdfunding giant Kickstarter are unionizing in a potential first for big tech in the US", "description": "Kickstarter's employees are forming a union called Kickstarter United. If the union is recognized, Kickstarter would be the first major tech company to have union representation. In a statement, the company did not indicate where it stood on the effort. In 20…", "url": "https://www.businessinsider.com/kickstarter-employees-unionizing-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c914b22124d04307d1cfbcc-1920-960.jpg", "publishedAt": "2019-03-19T20:18:42Z", "content": "Employees at Brooklyn's crowdfunding giant Kickstarter are forming a labor union called Kickstarter United, which will aim to secure more rights for the company's workers. \r\n In a statement, the group said: \r\n \"Kickstarter United is proud to start the process… [+2507 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dan DeFrancesco", "title": "JPMorgan promoted its top cyber executive to run technology for its retail business and it shows how seriously the bank is taking security (JPM)", "description": "JPMorgan Chase named Rohan Amin, previously the firm's global chief information security officer, the chief information officer of its consumer and community banking division. Jason Witty, who previously served as US Bancorp's CISO, has been named JPMorgan's …", "url": "https://www.businessinsider.com/jpmorgan-names-rohan-amin-as-head-of-tech-for-consumer-and-community-banking-2019-1", "urlToImage": "https://amp.businessinsider.com/images/5c914dbd124d04310b2f3a3b-320-160.jpg", "publishedAt": "2019-03-19T20:15:34Z", "content": "JPMorgan Chase has promoted its top cyber security executive to lead technology for its retail banking division, Business Insider has learned. \r\n Rohan Amin was named chief information officer of consumer and community banking (CCB) at JPMorgan Chase in recen… [+1601 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Eliza Relman", "title": "67% of Americans don’t know what Jared Kushner and Ivanka Trump actually do in the White House", "description": "The vast majority of Americans say they have no idea what first daughter Ivanka Trump and her husband Jared Kushner do in the White House, a new INSIDER poll found. Both top White House advisers have reportedly maintained central and far-reaching roles in the…", "url": "https://www.businessinsider.com/americans-dont-know-jared-kusher-ivanka-trump-white-house-jobs-poll-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5a95b203aae60519008b4622-1136-568.jpg", "publishedAt": "2019-03-19T20:12:22Z", "content": "The vast majority of Americans say they have no idea what first daughter Ivanka Trump and her husband Jared Kushner do in the White House, a new INSIDER poll found. \r\n 39% of respondents said they \"definitely could not\" accurately describe the couple's job re… [+1899 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "The US government wants to audit how the Boeing 737 Max got approved to fly by the FAA (BA)", "description": "US Transportation Secretary Elaine Chao announced on Tuesday that her department is requesting an audit on how the Boeing 737 Max was certified by the FAA to enter service. The FAA issued an emergency order grounding the entire Boeing 737 Max fleet in the US …", "url": "https://www.businessinsider.com/us-government-audit-faa-boeing-737-max-certification-process-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91493d5dfa9937d9260bd3-1920-960.jpg", "publishedAt": "2019-03-19T20:11:31Z", "content": "US Transportation Secretary Elaine Chao announced on Tuesday that her department is requesting an audit on how the Boeing 737 Max was certified by the Federal Aviation Administration to enter service. \r\n \"This is to confirm my request that the Office of Inspe… [+1896 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Remi Rosmarin", "title": "6 women put Everlane's new $155 Day Loafer to the test — here's how it stacked up", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/everlane-day-loafer-review", "urlToImage": "https://amp.businessinsider.com/images/5c914ba15dfa99384569c7d4-960-480.jpg", "publishedAt": "2019-03-19T20:11:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+9142 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rob Price", "title": "Trump says 'we have to do something' about social media (FB)", "description": "President Trump called vaguely for action to be taken against social media companies, saying \"we have to do something.\" At a press conference, the president repeated allegations, without proof, of anti-conservative bias by Facebook, Twitter, and Google, a pop…", "url": "https://www.businessinsider.com/trump-says-do-something-social-media-bias-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9141ef6123ca37bf482b45-2560-1280.jpg", "publishedAt": "2019-03-19T20:08:49Z", "content": "US President Donald Trump has said \"we have to do something\" about social media. \r\n On Tuesday, at a press conference in the White House Rose Garden, the reality TV star-turned-politician was asked about the potential liability of social media firms for conte… [+2906 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andy Kiersz", "title": "A behavioral economist explains why Elizabeth Holmes might not have felt bad lying about Theranos", "description": "A new HBO documentary by filmmaker Alex Gibney, \"The Inventor: Out for Blood in Silicon Valley,\" explores the downfall of the blood-testing startup Theranos and its founder, Elizabeth Holmes. In the documentary, Gibney interviewed behavioral economist Dan Ari…", "url": "https://www.businessinsider.com/theranos-elizabeth-holmes-the-inventor-hbo-psychology-of-lying-dan-ariely-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5ad0b72f146e7153698b4a15-2732-1366.jpg", "publishedAt": "2019-03-19T20:06:25Z", "content": "Elizabeth Holmes, founder of the now-defunct startup Theranos, has been accused of fraudulently claiming that her company's technology could perform health tests using only a small amount of blood. \r\n It turns out there is psychological evidence that people c… [+3408 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mary Hanbury", "title": "Victoria's Secret brought its swimwear back from the dead, but some shoppers are slamming its prices and saying it doesn't have enough sizes (LB)", "description": "Victoria's Secret relaunched swimwear on Tuesday after a three-year hiatus. Loyal customers had been eagerly awaiting its return, but it seems to be falling flat on social media. Several customers have taken to social media to complain about the costs and siz…", "url": "https://www.businessinsider.com/victorias-secret-swim-returns-disappoints-some-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9146e76123ca38e969a5c3-750-375.jpg", "publishedAt": "2019-03-19T20:05:55Z", "content": "Victoria's Secret relaunched swimwear Tuesday after a three-year hiatus, and despite the hype, it seems to be falling flat on social media. \r\n \"Super disappointed in Victoria's Secret new Swim line. I only found a few that are cute, but Amazon has had cuter b… [+2419 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Susie Moore, Contributor", "title": "The first thing I ask people who say they want to start a side hustle", "description": "Susie Moore is an entrepreneur and life coach who runs her own business. She says the most important thing she asks people who say they want to start a business is, “How do you explain what you do to potential customers?” To have a successful elevator pitch, …", "url": "https://www.businessinsider.com/start-a-side-hustle-first-question-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9147e201df72394f4481b9-1334-667.jpg", "publishedAt": "2019-03-19T19:59:48Z", "content": "Here's the first thing I ask people who say they want to start a side hustle. It's not the idea they have. It's not how much they wanna charge or who they wanna sell it to. Or if they have a website. \r\n It's this: \r\n\"How do you explain what you do to potentia… [+2924 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Devon Delfino", "title": "How to clear the cache on your Mac computer to make it run more efficiently", "description": "When you clear your Mac computer's cached data, you're deleting the temporary media files, like images and text files, that it gathers from the sites you visit. Those files help reduce internet data usage and speed software installation on your Mac. But it's …", "url": "https://www.businessinsider.com/how-to-clear-cache-on-mac-computer", "urlToImage": "https://amp.businessinsider.com/images/5c91449e69bdec2d112a03a6-1536-768.jpg", "publishedAt": "2019-03-19T19:57:00Z", "content": "You may have heard that it's important to clear the cache on your various electronic devices every once in a while. But what exactly is caching, and why do our devices use it? \r\n Cached data consists of the various temporary files that exist on a reserved are… [+3003 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kevin Webb", "title": "Google's new gaming platform launches later this year: here are the games we've seen so far (GOOG, GOOGL)", "description": "Google announced Stadia, their new video game platform, during their keynote address at GDC 2019 in San Francisco. Stadia will launch later this year; a full list of games hasn't been provided but a handful were shown off during Google's keynote address on Tu…", "url": "https://www.businessinsider.com/google-stadia-games-and-features-announced-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9142f1e0575a2b2c63ad0f-1136-568.jpg", "publishedAt": "2019-03-19T19:55:37Z", "content": "Earlier today Google CEO Sundar Pichai announced Stadia, Google's new video game platform. Rather than creating a new console, every game on Stadia will be streamed to players from Google's cloud data centers. That means Stadia will make high quality video ga… [+1522 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Antonio Villas-Boas", "title": "Google's new Stadia gaming service supports so many devices you might not need to buy anything", "description": "Google announced its new Stadia video game-streaming platform on Tuesday. Because it's internet-based, Stadia barely requires anything you might not already own to play games, including high-end AAA titles that usually work and look best on high-end consoles …", "url": "https://www.businessinsider.com/google-stadia-supported-devices-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c913b0b113a502e3a107a8d-1136-568.jpg", "publishedAt": "2019-03-19T19:55:37Z", "content": "Google's video game-streaming platform, Stadia, was announced on Tuesday. \r\n When it launches in 2019, Stadia will let pretty much anyone with almost any TV, computer, tablet, or smartphone play games that are typically only playable on powerful consoles or c… [+706 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rebecca Ungarino", "title": "Here comes FedEx... (FDX)", "description": "FedEx is scheduled to report third-quarter earnings after the market's close on Tuesday. Shares of FedEx have come under pressure in recent months as Amazon is increasingly viewed as a viable threat to the logistics company. Last quarter, the company cut its …", "url": "https://www.businessinsider.com/fedex-earnings-q3-stock-price-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c913d84e0575a2a3c4e9e83-1920-960.jpg", "publishedAt": "2019-03-19T19:49:00Z", "content": "Delivery giant FedEx is set to release its third-quarter results after the bell on Tuesday. Here's what Wall Street analysts surveyed by Bloomberg are expecting: \r\nAdjusted earnings per share (EPS): $3.10. \r\nRevenue: $17.6 billion. \r\nThe report comes after Fe… [+1090 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tanza Loudenback", "title": "A self-made millionaire who retired at 37 says buying a home was 'probably the worst financial decision' he ever made", "description": "A house isn't the best place to put your money for maximum returns. Chris Reining, a self-made millionaire and early retiree, did the math and realized he could have made a greater return on his money if he invested in the stock market. Real estate can still …", "url": "https://www.businessinsider.com/buying-home-not-best-investment-2017-7", "urlToImage": "https://amp.businessinsider.com/images/597b87434528e61d218b51a9-1920-960.jpg", "publishedAt": "2019-03-19T19:46:00Z", "content": "There's an enduring tug-of-war between the value of renting versus homeownership. \r\n Long-term renting is often perceived as a waste of money, while owning a home is seen as a valuable asset that provides long-term financial gain — in other words, it's a good… [+2406 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kate Taylor", "title": "Buffalo Wild Wings is kicking off its turnaround efforts with new menus, classy cocktails, and more changes to win over millennials", "description": "Buffalo Wild Wings is kicking off its first major round of changes to revitalize the chain as it gears up for March Madness this week. Changes include new employee uniforms, updated menus, new advertising, and the end of paper boats for chicken wings. The rev…", "url": "https://www.businessinsider.com/buffalo-wild-wings-changes-turnaround-2019-3", "urlToImage": "https://amp.businessinsider.com/images/56293e219dd7cc24008c3f9c-1536-768.jpg", "publishedAt": "2019-03-19T19:43:00Z", "content": "Buffalo Wild Wings is launching its first round of changes as the chain gears up for March Madness this week. \r\n Customers swarming to Buffalo Wild Wings to watch the NCAA college basketball tournament can expect a new advertising campaign, new menu items, re… [+6699 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Mark Matousek", "title": "Tesla factory workers took twice as many days off last year than in 2017 because of injury or sickness (TSLA)", "description": "Workers at Tesla 's auto plant spent twice as many days away from their jobs due to work-related injuries and illnesses, after adjusting for workforce growth, in 2018 than in 2017, Bloomberg reports, citing a report Tesla filed with the Occupational Safety an…", "url": "https://www.businessinsider.com/tesla-factory-workers-lost-more-time-injury-and-illness-2018-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9133a9124d042bf24b286c-1920-960.jpg", "publishedAt": "2019-03-19T19:39:06Z", "content": "Workers at Tesla's auto plant spent twice as many days away from their jobs due to work-related injuries and illnesses, after adjusting for workforce growth, in 2018 than in 2017, Bloomberg reports, citing a report Tesla filed with the Occupational Safety and… [+2687 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Here comes Tencent Music, China's biggest streaming-music service (TME)", "description": "Tencent Music Entertainment is set to report fourth-quarter financial results after Tuesday's closing bell. It will be Tencent Music's first earnings release since going public in the US in December. Watch Tencent Music Entertainment trade live. Tencent Music…", "url": "https://markets.businessinsider.com/news/stocks/tencent-music-earnings-q4-stock-price-2019-3-1028042996", "urlToImage": "https://images.markets.businessinsider.com/image/5bb3b52621e9cb1c775046d6-2400/2018-09-27t103728z581823106rc126fae86a0rtrmadp3tencentmusic-ipo.jpg", "publishedAt": "2019-03-19T19:33:00Z", "content": "Stringer/REUTERS\r\nTencent Music Entertainment, the biggest streaming-music service in China, is set to report fourth-quarter earnings after Tuesday's closing bell. Here's what analysts surveyed by Bloomberg are expecting:\r\nAdjusted earnings per share: $0.55 \r… [+793 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "Here comes Tencent Music, China's biggest streaming-music service (TME)", "description": "Tencent Music Entertainment is set to report fourth-quarter financial results after Tuesday's closing bell. It will be Tencent Music's first earnings release since going public in the US in December. Watch Tencent Music Entertainment trade live. Tencent Music…", "url": "https://www.businessinsider.com/tencent-music-earnings-q4-stock-price-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c913e97daa5072c8f783d83-2732-1366.jpg", "publishedAt": "2019-03-19T19:33:00Z", "content": "Tencent Music Entertainment, the biggest streaming-music service in China, is set to report fourth-quarter earnings after Tuesday's closing bell. Here's what analysts surveyed by Bloomberg are expecting: \r\nAdjusted earnings per share: $0.55 \r\nRevenue: $5.3 bi… [+779 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Benjamin Zhang", "title": "The Boeing 737 Max is likely to be the last version of the best-selling airliner of all time (BA)", "description": "The Boeing 737 is best selling airliner of all time. There have been four distinct generations of the plane in the five decades years since the original 737-100 entered service in 1967. The latest version, the Boeing 737 Max, entered service in 2017. The plan…", "url": "https://www.businessinsider.com/boeing-737-max-design-pushed-to-limit-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8a6cf5daa50730d94a9177-1920-960.jpg", "publishedAt": "2019-03-19T19:28:13Z", "content": "Last week, the US Federal Aviation Administration issued an emergency order to immediately ground all Boeing 737 Max airliners flying in the US. \r\n The decision came after two effectively brand new 737 Max 8 jetliners crashed under strikingly similar circumst… [+4832 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "John Haltiwanger", "title": "6 ways the Trump administration has tried to roll back environmental protections that keep US drinking water safe", "description": "President Donald Trump has slashed a number of regulations aimed at protecting America's waterways, including many that affect the country's drinking water. Trump has contended the regulations he's rolled back — or sought to rescind — put unnecessary burdens …", "url": "https://www.businessinsider.com/trump-administration-water-regulations-roll-back-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c912e9d5dfa9932716583db-1136-568.jpg", "publishedAt": "2019-03-19T19:25:53Z", "content": "In February 2017, Trump repealed an Obama-era environmental regulation aimed at protecting streams and waterways from coal mining waste — the Stream Protection Rule.\r\n The rule required surface mining activities to be kept at least 100 feet away from streams,… [+1169 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jada Wong", "title": "Household cleaning brand Mrs. Meyer's has introduced new body-care products into its lineup — here’s what to buy", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/mrs-meyers-hand-balm-body-scrub-review", "urlToImage": "https://amp.businessinsider.com/images/5c7022fe2628982527376bd7-1136-568.jpg", "publishedAt": "2019-03-19T19:20:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+3389 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lydia Ramsey", "title": "Investors just made a $35 million bet on a startup that wants to help people find food and housing to keep them healthy", "description": "Unite Us, a health-tech company that wants to help connect health systems to services like housing and food with the hope of keeping people healthier and out of the hospital, just raised another $35 million. The hope is to improve on a process that already ha…", "url": "https://www.businessinsider.com/unite-us-raises-35-million-led-by-oak-hcft-social-services-determinants-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9129ee69e11c427717a103-2732-1366.jpg", "publishedAt": "2019-03-19T19:16:00Z", "content": "Nancy Brown, a partner at venture firm Oak HC/FT, remembers talking with a potential investment about an interesting correlation the company had found in its data: There was a link between a lack of dependable housing and preterm labor. \r\n That meant that if … [+4551 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "'It'll never happen': Trump dismisses Democrats' radical idea to reshape the Supreme Court", "description": "President Trump said proposals to expand the number of Supreme Court justices will \" never happen.\" Several Democratic presidential candidates have entertained the idea of packing the courts. Historically, the Supreme Court's number of justices has fluctuated…", "url": "https://www.businessinsider.com/trump-dismisses-democrats-radical-supreme-court-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c913318003f5c2aff5d6e13-2732-1366.jpg", "publishedAt": "2019-03-19T18:56:33Z", "content": "WASHINGTON — President Donald Trump said proposals from a number of Democrats to expand the number of Supreme Court justices will \"never happen.\" \r\n Several Democratic presidential candidates have embraced the prospect of \"court packing\" and increasing the nu… [+2244 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dennis Green", "title": "Most Amazon private labels aren't flying off the shelves yet, but the company is taking huge steps to change that (AMZN)", "description": "Amazon has been on a tear in the last few years, launching hundreds of private-label brands offering thousands of products. Many of those brands and labels have not quite taken off with customers, according to a new report from Marketplace Pulse. Amazon has r…", "url": "https://www.businessinsider.com/amazon-private-labels-not-all-successful-report-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c913077e0575a27cf3fae9a-1334-667.jpg", "publishedAt": "2019-03-19T18:53:50Z", "content": "Amazon's private-label goods haven't taken over the world yet. \r\n The tech giant's incredible number of private-label goods haven't rocked the retail world as some expected. According to a new report from e-commerce research firm Marketplace Pulse, very few o… [+1944 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sharon Feiereisen", "title": "7 times you should buy the Walmart house brand — and 6 times you should skip it", "description": "Walmart has dozens of house brands in several industries, including food, clothing, and house supplies. But not all of Walmart's store brands are of equal quality. We asked experts which of Walmart's house brands were worth a purchase, and which ones you shou…", "url": "https://www.businessinsider.com/walmart-store-brand-products-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91382ddaa5072b2347de4a-1334-667.jpg", "publishedAt": "2019-03-19T18:52:00Z", "content": "But be careful! Not all of Sam's Choice soup options are good picks. Their Chicken Tortilla Soup, for example, has 170 calories, seven grams of fat, 660 milligrams of sodium, and only nine grams of protein per cup. \r\n Varbanova says to stay away. \r\n \"This sou… [+96 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "I tried Samsung’s $750 Galaxy S10e, and I'm convinced it could be the Android phone to beat", "description": "At $750, the Galaxy S10e costs significantly less than Samsung's other Galaxy S10 devices, while offering many of the same features. The S10e features a large, attractive screen in a form factor that's more compact than most of its rivals, and its ultra wide-…", "url": "https://www.businessinsider.com/samsung-galaxy-s10e-review-specs-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9117af01df7230a61f58b5-1920-960.jpg", "publishedAt": "2019-03-19T18:51:37Z", "content": "Samsung's new Galaxy S10 lineup represents a few firsts for the South Korean electronics giant. \r\n The $900 Galaxy S10 and $1,000 S10+ are the company's first flagship phones to come with an ultrasonic fingerprint sensor embedded in the display, whereas previ… [+8384 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Rachel Askinasi", "title": "We visited a wildly popular Japanese dollar store's first NYC location days after it opened. Here's what it's like to shop there.", "description": "Daiso — a Japanese dollar store — opened its first location in New York City's Flushing, Queens, in March. The store has a cult following, according to Time Out, because of its consistently low prices on quality Japanese goods. We went to the new location jus…", "url": "https://www.businessinsider.com/daiso-flushing-japanese-dollar-store-tour-nyc-shop-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91330569e11c44d00b0667-1920-960.jpg", "publishedAt": "2019-03-19T18:51:00Z", "content": "More:FeaturesVisual SlideshowdaisoStore tour\r\nPopular\r\nThe federal government just confirmed what America's 1.8 million truck drivers have been saying for years: The truck-driver shortage doesn't really exist\r\nPopular\r\nGoogle just unveiled its vision for 'the… [+476 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Meira Gebel", "title": "How the Dumas family, heirs to the $49.2 billion Hermès fortune, turned a leather store into a luxury empire and became one of the wealthiest families in the world", "description": "There are 16 heirs to the Hermès fortune, but two cousins, Pierre-Alexis and Axel Dumas, are at the head of the ultra-luxurious Parisian fashion house that rakes in billions of dollars in profit each year. Bloomberg estimates put the Dumas family fortune at $…", "url": "https://www.businessinsider.com/dumas-family-hermes-wealth-net-worth-heirs-fortune-lifestyle-birkin-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c812f7626289807646e9a44-1136-568.jpg", "publishedAt": "2019-03-19T18:45:00Z", "content": "Thierry Hermès, an orphan, was skilled with leather — so skilled, in fact, that his main clients in the 19th century were royal families. \r\n Six generations later, the Hermès family — and brand — is now known for its exclusive Parisian fashion house and a $49… [+813 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Matthew Stuart and Clancy Morgan", "title": "Watch Google's Stadia video game platform event in 5 minutes", "description": "Google is entering the video game industry, with its Stadia streaming platform. The company officially announced the console at the Game Developer's Conference 2019. Watch the video above for what we can expect will be the console's coolest features. Google f…", "url": "https://www.businessinsider.com/google-stadia-video-game-streaming-platform-console-event-watch-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91372b4f07ae3bf042628d-1136-568.jpg", "publishedAt": "2019-03-19T18:40:00Z", "content": "Google finally showed off its Stadia gaming platform at the 2019 Game Developers Conference. While there is no pricing or date set for the platform's launch, the company says it will be coming in 2019. Players will be able to use the Chrome browser to quickly… [+71 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Remi Rosmarin", "title": "2 former Tumi executives helped launch a startup that lets you customize your luggage down to every last detail — so we tried it out", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…", "url": "https://www.businessinsider.com/roam-custom-luggage-suitcase-review", "urlToImage": "https://amp.businessinsider.com/images/5c8fccf0003f5c077d7b19e0-1136-568.jpg", "publishedAt": "2019-03-19T18:40:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+5352 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Daniel Boan", "title": "Ariana Grande channeled her inner Cher from 'Clueless' in one of 6 outfits from her new tour", "description": "Ariana Grande kicked off her Sweetener World Tour on Monday night in Albany, New York. She had several costume changes during the show, all styled by frequent collaborator Law Roach. Her most striking outfit of the night was a plaid ensemble that seemed to ch…", "url": "https://www.businessinsider.com/ariana-grande-sweetener-world-tour-outfits-2019-3", "urlToImage": null, "publishedAt": "2019-03-19T18:33:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christian de Looper", "title": "Apple's new iMacs are the high-end desktop computers Mac fans have been waiting for — and they're available now for $1,299 and up", "description": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti…", "url": "https://www.businessinsider.com/apple-imac-2019-price-specs", "urlToImage": "https://amp.businessinsider.com/images/5c91316d003f5c2a5e4e3ec0-1536-768.jpg", "publishedAt": "2019-03-19T18:30:00Z", "content": "Insider Picks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and objecti… [+2118 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Mosher", "title": "Elon Musk just revealed 5 major updates to SpaceX's Mars spaceship project. Here's what we learned.", "description": "Elon Musk has confirmed that SpaceX hopes to try \"very short\" launches or \"hops\" of a new spaceship prototype in Texas this week. Called the \"Test Hopper,\" the vehicle is a prototype of a more advanced, 400-foot-tall launch system called Starship, which Space…", "url": "https://www.businessinsider.com/elon-musk-starship-rocket-spaceship-changes-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c8b9d85113a504d8202e306-2732-1366.jpg", "publishedAt": "2019-03-19T18:27:00Z", "content": "On Sunday, Musk shared a video (above) of heat-shield tiles passing a \"full duration\" test. \r\n These tiles are the most recent iteration of the technology SpaceX is developing to cool and protect Starship as it re-enters Earth's atmosphere and attempts to lan… [+1281 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andy Kiersz and Emma Court", "title": "The 10 best states to live in where healthcare is the cheapest", "description": "Healthcare costs in the US tend to be high, but they are more affordable in some places than others. Using data from a recent report from the Commonwealth Fund, we found the states where premiums and deductibles are least expensive. Healthcare costs in the US…", "url": "https://www.businessinsider.com/the-10-states-where-healthcare-is-relatively-cheap-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c911ce4e0575a24ac35b9cf-2732-1366.jpg", "publishedAt": "2019-03-19T18:19:19Z", "content": "Healthcare costs in the US are high, but they're more affordable in some places than others. \r\n A recent report from the Commonwealth Fund broke down the burden of healthcare costs for families with employer-provided health insurance. The report included data… [+560 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joe Perticone", "title": "Beto O'Rourke just endorsed a healthcare idea called 'Medicare for America' which differs in some major ways from Bernie Sanders' 'Medicare for All' plan", "description": "Democratic presidential candidate Beto O'Rourke backed a public option system in which Americans could keep their private health insurance or participate in Medicare. Many of the other Democratic candidates running for president in 2020 are supporting a \"Medi…", "url": "https://www.businessinsider.com/beto-orourke-healthcare-plan-bernie-sanders-medicare-for-all-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c911e96113a5029646a22e6-2732-1366.jpg", "publishedAt": "2019-03-19T18:08:12Z", "content": "Democratic presidential candidate Beto O'Rourke said he would support a health care system that allows Americans to participate in Medicare or keep their existing employer-based and private health insurance coverage. \r\n Backing the \"public option\" plan differ… [+3525 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Alex Morrell", "title": "A shakeup is underway in Bank of America's sales and trading division, as a star sales exec is switching roles and another is leaving the firm", "description": "Bank of America Merrill Lynch is shaking up its fixed-income, currencies, and commodities division. The head of FICC sales and structuring in the Americas is moving on to a new role in trading and will be replaced internally, according to an internal memo see…", "url": "https://www.businessinsider.com/shakeup-in-bank-of-americas-ficc-sales-and-trading-division-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5803e5e3c52402b7248b473c-2732-1366.jpg", "publishedAt": "2019-03-19T18:05:36Z", "content": "There's been a shakeup in Bank of America Merrill Lynch's fixed-income, currencies, and commodities division, as a star sales exec is shifting into trading and another business head is moving on. \r\n Karen Fang, the head of sales and structuring for FICC in th… [+1844 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lauren Johnson", "title": "Facebook is creating a new advertising portal for housing, employment and credit advertisers and will remove 'hundreds' of targeting options", "description": "Facebook has faced backlash from civil rights groups like the National Fair Housing Alliance (NFHA) and American Civil Liberties Union (ACLU) that its platform allows advertisers to discriminate against groups through targeting. Facebook is rolling out new ru…", "url": "https://www.businessinsider.com/facebooks-new-rules-for-housing-employment-and-credit-advertisers-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c911e84401d58243d1790fc-2560-1280.jpg", "publishedAt": "2019-03-19T18:00:00Z", "content": "Facebook is taking steps to clean up its platform for housing, employment and credit advertisers and civil rights groups who have asked for targeting controls. \r\n The social network says that it has reached a settlement with the National Fair Housing Alliance… [+3122 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Clancy Morgan and Matthew Stuart", "title": "Watch Google unveil Stadia, its new video game platform that streams across devices without a console", "description": "Google unveiled its streaming video game platform, Stadia, today at the Game Developer's Conference. The platform has no console, as it's run from its data center, and is expected to connect players across desktop, tablet, mobile, Chrome browser, and TV. Watc…", "url": "https://www.businessinsider.com/google-stadia-video-game-platform-console-unveil-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c91296369bdec27bf634633-1536-768.jpg", "publishedAt": "2019-03-19T18:00:00Z", "content": "Google finally showed off its streaming gaming platform at the 2019 Game Developers Conference. Dubbed Stadia, the platform allows players to quickly load and play games like Doom and Assassin's Creed. The platform will work on desktop, mobile, the Chrome bro… [+26 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "Netflix CEO Reed Hastings revealed the original series he's watching right now", "description": "Netflix CEO Reed Hastings said on Monday that he's currently watching Ricky Gervais' \"After Life.\" In the past, Hastings has said that his favorite Netflix shows included \"The End of the F---ing World\" and \"BoJack Horseman.\" Netflix CEO Reed Hastings loves da…", "url": "https://www.businessinsider.com/netflix-ceo-reed-hastings-is-watching-ricky-gervais-after-life-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c912b49e0575a26ce3b4f65-1136-568.jpg", "publishedAt": "2019-03-19T17:57:48Z", "content": "Netflix CEO Reed Hastings loves dark comedies and he's currently watching Ricky Gervais' new Netflix original series, \"After Life.\" \r\n Hastings revealed that he was watching the show during a Q&amp;A session with journalists on Monday at Netflix Labs, the com… [+1238 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Steven John", "title": "How to create a Google doc on your computer or mobile device", "description": "When you create a Google document, or doc, you're making use of one of the best tools available for collaborative work between people in different locations. Using Google docs, you can create documents ranging from essays to resumes to brochures and more, and…", "url": "https://www.businessinsider.com/how-to-create-a-google-doc", "urlToImage": "https://amp.businessinsider.com/images/5c911e494f07ae372c686e85-2560-1280.jpg", "publishedAt": "2019-03-19T17:57:00Z", "content": "While perhaps the major selling factor of a Google doc is how these online documents allow people to collaborate together on a project from remote locations, the real beauty of a Google dos is how it protects your work from being lost in the event of a comput… [+3522 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "Google is making a new controller for its video game streaming service, and it's a little different than one for PlayStation or Xbox (GOOG, GOOGL)", "description": "Google on Tuesday introduced Stadia, its new video game streaming platform — and a new controller to go with it. This controller, expected to launch alongside the service later this year, includes special features specifically designed for Google's game servi…", "url": "https://www.businessinsider.com/google-stadia-video-game-controller-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5c9128e5daa50728333dd324-1334-667.jpg", "publishedAt": "2019-03-19T17:53:41Z", "content": "Google on Tuesday introduced Stadia, its new video game streaming platform — and a new controller to go with it. \r\n This controller, expected to launch alongside the service later this year, includes special features specifically designed for Google's game se… [+1367 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "AMD has a 'significant' opportunity from Google's cloud gaming initiative (AMD, GOOG)", "description": "In February, AMD revealed that it has been working with Google on a video game streaming service. At the Game Developers Conference on Tuesday, Google announced that the two have created a new chip for the service, which will officially be called Stadia. Whil…", "url": "https://markets.businessinsider.com/news/stocks/google-stadia-amd-stock-price-cloud-gaming-significant-opportunity-2019-3-1028042784", "urlToImage": "https://images.markets.businessinsider.com/image/5bd08d39d2e648504714217c-2400/2006-10-24t000000z368155717bm2dtudiiyaartrmadp3germany.jpg", "publishedAt": "2019-03-19T17:52:00Z", "content": "Fabrizio Bensch/REUTERS\r\nIn February, AMD revealed that it has been working with Google on a video game streaming service.\r\nAt the Game Developers Conference on Tuesday, Google announced that the two have created a new chip for the service, which will officia… [+2396 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ethel Jiang", "title": "AMD has a 'significant' opportunity from Google's cloud gaming initiative (AMD, GOOG)", "description": "In February, AMD revealed that it has been working with Google on a video game streaming service. At the Game Developers Conference on Tuesday, Google announced that the two have created a new chip for the service, which will officially be called Stadia. Whil…", "url": "https://www.businessinsider.com/google-stadia-amd-stock-price-cloud-gaming-significant-opportunity-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5bd08de2d2e64853ef1f1365-2732-1366.jpg", "publishedAt": "2019-03-19T17:52:00Z", "content": "AMD has a \"significant\" opportunity from Google's cloud gaming initiative, Morgan Stanley says. \r\n In February, AMD revealed that it has been working with Google's Project Stream, a video game-streaming service it began testing late last year. CEO Lisa Su ann… [+1971 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Cork Gaines", "title": "Prosecutors reportedly offer to drop charges against Robert Kraft in massage-parlor prostitution case in an 'unusual' deal", "description": "The Wall Street Journal is reporting that prosecutors have offered to drop charges against Robert Kraft and others in the massage-parlor prostitution case. The deal requires Kraft and the other defendants to admit that they would have been found guilty in a t…", "url": "https://www.businessinsider.com/charges-against-robert-kraft-florida-prositution-case-2019-3", "urlToImage": "https://amp.businessinsider.com/images/5bae589d33db9e5b278b4569-1334-667.jpg", "publishedAt": "2019-03-19T17:44:49Z", "content": "New England Patriots owner Robert Kraft and other defendants charged in the Florida massage-parlor prostitution scandal may be able to have the charges dropped as part of a deal, but there is a catch, according to Andrew Beaton of the Wall Street Journal. \r\n … [+726 chars]"}]}